{"bibliography":{"title":"The AstroBID: Preserving and Sharing the Italian Astronomical Heritage","authors":[{"person_name":{"surname":"Gargano","first_name":"Mauro"},"affiliations":[{"department":null,"institution":"INAF-Astronomical Observatory of Capodimonte","laboratory":null}],"email":"gargano@oacn.inaf.it"},{"person_name":{"surname":"Gasperini","first_name":"Antonella"},"affiliations":[{"department":null,"institution":"INAF-Astrophysical Observatory of Arcetri","laboratory":null}],"email":"gasperi@arcetri.inaf.it"},{"person_name":{"surname":"Cirella","first_name":"Emilia"},"affiliations":[{"department":null,"institution":"INAF-Astronomical Observatory of Capodimonte","laboratory":null}],"email":null},{"person_name":{"surname":"Smareglia","first_name":"Riccardo"},"affiliations":[{"department":null,"institution":"INAF-Astronomical Observatory of Trieste","laboratory":null}],"email":"smareglia@oats.inaf.it"},{"person_name":{"surname":"Zanini","first_name":"Valeria"},"affiliations":[{"department":null,"institution":"INAF-Astronomical Observatory of Padua","laboratory":null}],"email":"valeria.zanini@oapd.inaf.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital infrastructure","Astronomical heritage","Preservation"],"citations":{"b0":{"title":"Analisi del formato FITS per la conservazione a lungo termine dei manoscritti","authors":[{"person_name":{"surname":"Allegrezza","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Il caso significativo del progetto della Biblioteca Apostolica Vaticana. Digitalia","series":null,"scope":{"volume":6,"pages":{"from_page":43,"to_page":72}}},"b1":{"title":"Astrum 2009: Astronomy and Instruments","authors":[],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":"Sillabe","journal":null,"series":null,"scope":null},"b2":{"title":"Polvere di stelle -Stardust: the national historical archive for astronomy on the web","authors":[{"person_name":{"surname":"Gargano","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Gasperini","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Mandrino","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"ASP","journal":null,"series":null,"scope":{"volume":433,"pages":{"from_page":244,"to_page":247}}},"b3":{"title":"Le Cinquecentine dell'Osservatorio Astronomico di Capodimonte","authors":[{"person_name":{"surname":"Olostro Cirella","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Caprio","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"Giannini","journal":null,"series":null,"scope":null},"b4":{"title":"The AstroBID: searching through the Italian astronomical heritage","authors":[{"person_name":{"surname":"Olostro Cirella","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"ASP","journal":null,"series":null,"scope":{"volume":492,"pages":{"from_page":143,"to_page":149}}}},"sections":[{"title":"Italian Astronomical Heritage","paragraphs":[{"text":"The historical and scientific heritage of Italian Astronomy consists of ancient Books, scientific Instruments, and archival Documents, the AstroBID, which testify to the important development of astronomy in Italy from pre-Galilean observations to the present time. Preserved in 12 Astronomical Observatories, all these objects constitute an interesting and valuable collection, worldwide, in the field of the history of science. The oldest Italian Observatories hold more than 7000 ancient books (from 1470 to 1830), including 18 Incunabola and 433 Cinquecentine; and they preserve 30 manuscripts also. Some of these books represent true cultural milestones; the works of Galileo, Copernicus, Ptolemy, Kepler and Newton (often first editions), considered the banners of the scientific revolution, have paved the way to modern science. Besides the value due to the content contributing to the history of western culture, these books are also interesting for their fine and precious illustrations. The marvellous star atlases of Hevelius, Doppelmayer, Flamsteed and Bode, the cometographies and selenographies of Northern European astronomers, published in the 16th and 17th centuries, reveal a host of details, illustrated with painstaking care in works of rare beauty that merged art, mythology and science [4]. The oldest document of the National Institute of Astrophysics is a manuscript preserved in the Library of the Copernican Museum in Rome, that dates back to the end of 1300 (Fig. 1). It is a collection of medieval astronomical texts, probably the most popular essays of that period. The ancient astronomical instruments collection of the Italian Observatories is over 1200 items, from the XI century (Fig. 2) to the first half of the 1900. Exhibited in 13 museums, it consists mainly of quadrants, sextants, telescopes, theodolites, clocks, stopwatches, globes, mathematical instruments, and meteorological instrumentations [2]. Among the most precious instruments, the museum collections preserve some arabic astrolabes, one of the biggest mirror for a telescope made by William Herschel, the telescope used by Schiaparelli to describe the surface of Mars and hypothesize a planet inhabited by Martians, and the instruments manufactured and used by Italian astronomers to realize a\"new science\", astrophysics.","refs":[{"start":1308,"end":1311,"marker":"bibr","target":"#b3"},{"start":1491,"end":1492,"marker":"figure","target":"#fig_0"},{"start":1718,"end":1719,"marker":"figure","target":"#fig_1"},{"start":1936,"end":1939,"marker":"bibr","target":"#b1"}]},{"text":"The historical archives of the astronomical observatories preserve the documents of some of the oldest scientific institutions in our country: records from countless nights spent at the telescope, beautiful sketches of nebulae, comets and planets, drawn during the observations under an astronomical dome, letters revealing the stream of cognizance to some extraordinary scientific discoveries, journey logbooks, meteorological observations as a continuum line throughout the centuries, settled bills, read books, reports from journeys, maps, sketches.","refs":[]},{"text":"Over 3 million documents, 122 series containing the fonds of various astronomers are preserved in 12 historical archives [3].","refs":[{"start":121,"end":124,"marker":"bibr","target":"#b2"}]}]},{"title":"Polvere di Stelle: the web portal","paragraphs":[{"text":"In order to present and share the AstroBID to the largest number of people, ranging from scientists and historians to amateur astronomers and general public, INAF has realized Polvere di Stelle (Stardust)1 (Fig. 3), the web portal of the Italian astronomical cultural heritage.","refs":[{"start":204,"end":205,"marker":null,"target":"#foot_0"},{"start":212,"end":213,"marker":"figure","target":"#fig_2"}]},{"text":"Polvere di Stelle presents the modern and ancient library catalogs, the archival inventories, and the museum collections of the Italian Astronomical Observatories and also the astronomical heritage of the Department of Physics and Astronomy of the Bologna University. Besides the historical descriptions for all types of materials, Polvere di Stelle allows for simultaneous searches on books, archives, museums, and astronomer's biographies databases, establishing useful interconnections to build particular events and aspects of the history of astronomy. The AstroBID materials are recorded in different databases following the international standards and the ICCU recommendations for cataloguing modern and ancient books, and manuscripts, for the inventorying of the archive documents, for the description of scientific instruments, artworks, and biographies of astronomers and craftmakers. In addition there are two indexes for authors and bibliographies [5].","refs":[{"start":959,"end":962,"marker":"bibr","target":"#b4"}]},{"text":"The portal permits the performance of interlinking searches among the Astro-BID records with simultaneous queries on different databases to build thematic pathways of important astronomical events, discoveries, biographies of astronomers, and the use of astronomical instruments.","refs":[]},{"text":"A digital showcase plays a relevant role in Polvere di Stelle. Using the knowhow for storing and sharing the astronomical data, the Italian data-center for Astronomical Archives, IA2, hosted by the Astronomical Observatory of Trieste, has set up a high availability platform to create a national repository for the digitalized copy of the ancient books. IA2 is a national infrastructure project to implement \"a new strategy for preserving and providing access to the astrophysical data heritage\". IA2's informatics infrastructure is based on the virtualization and cloud paradigm, hosts data from the main ground based Italian Telescopes and offers proprietary and public data access through user portals and Virtual Observatory (VO) services. All software tools are based on Open Source application and developed in C++, Java and PHP. To best manage all metadata and services information, stored inside, the DMBS plays a main role. Using this infrastructure, and in particular a data cloud storage, we have stored over 100000 pages of about 250 ancient books related to the scientific heritage in the different resolutions: images at 150 DPI are used to publish the books on the web with a watermark on each page, and 300 and 600 DPI images are used to preserve a digital copy of each book and to use them in historical and scientific studies. Hyper resolution images will be also saved as FITS (Flexible Images Transport System). This format is widely used within the astronomical community since 1981. It was developed to ensure long-term preservation of data and documents. In addition to storing images, a FITS file may contain many other additional information inside its keyword header. It is free from legal restrictions and is kept updated by IAU (International Astronomical Union). INAF and Vatican Apostolic Library are working together to extend the FITS keywords dictionary for the needs of cultural heritage data preservation [1].","refs":[{"start":1940,"end":1943,"marker":"bibr","target":"#b0"}]},{"text":"At present, the digital showcase allows one to consult a little part of the ancient book heritage in a colour digital format and in very good resolution. People can leaf through some terrific volumes like the Tractatus de Sphaera by J. Holywood (end of XIV century), and the De Revolutionibus Orbium Coelestium by N. Copernicus (1543).","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The cultural heritage of the National Institute for Astrophysics (INAF), made of rare and modern Books, Instruments and archival Documents, the AstroBID, marks the milestones in the history of astronomy in Italy. INAF, in collaboration with the Department of Physics and Astronomy of the University of Bologna, has developed a project to preserve, digitize, and valorize its patrimony by creating a web portal Polvere di Stelle. It shows the cultural heritage of 12 libraries and historical archives, and 13 instrument collections, and allows both academics and a wider audience to search simultaneously the AstroBID materials.","refs":[]}]}}