{"bibliography":{"title":"Crowdsourcing for Film-Induced Tourism: An Approach to Geolocation","authors":[{"person_name":{"surname":"Zilio","first_name":"Daniel"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"daniel.zilio@unipd.it"},{"person_name":{"surname":"Micheletti","first_name":"Andrea"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"andrea.micheletti@unipd.it"},{"person_name":{"surname":"Orio","first_name":"Nicola"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"nicola.orio@unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-68130-6","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Crowdsourcing","Geolocation","Reputation","Film-induced tourism"],"citations":{"b0":{"title":"Film ties: crowd-sourced teaching of cinematography using intelligent example galleries","authors":[{"person_name":{"surname":"Bares","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Schwartz","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":229,"to_page":232}}},"b1":{"title":"Film-Induced Tourism","authors":[{"person_name":{"surname":"Beeton","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"Clevedon","journal":null,"series":null,"scope":null},"b2":{"title":"The forms of capital","authors":[{"person_name":{"surname":"Bourdieu","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"1985","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Is that a jaguar? Segmenting ancient maya glyphs via crowdsourcing","authors":[{"person_name":{"surname":"Can","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Odobez","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Gatica-Perez","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":37,"to_page":40}}},"b4":{"title":"Le produzioni cinematografiche, il turismo, il territorio","authors":[{"person_name":{"surname":"Di Cesare","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Rech","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"Carrocci","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":45,"to_page":88}}},"b5":{"title":"La società post-crescita: consumi e stili di vita","authors":[{"person_name":{"surname":"Fabris","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Egea","journal":null,"series":null,"scope":null},"b6":{"title":"Assessing internet video quality using crowdsourcing","authors":[{"person_name":{"surname":"Salas","first_name":"Figuerola"},"affiliations":[],"email":null},{"person_name":{"surname":"Adzic","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Shah","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Kalva","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":23,"to_page":28}}},"b7":{"title":"The rise of crowdsourcing","authors":[{"person_name":{"surname":"Howe","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2006","month":"06","day":null},"ids":null,"target":null,"publisher":null,"journal":"Wired Magaz","series":null,"scope":null},"b8":{"title":"Cinema, media e turismo. Esperienze e prospettive teoriche del filminduced tourism","authors":[{"person_name":{"surname":"Lavarone","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":"Padova University Press","journal":null,"series":null,"scope":null},"b9":{"title":"Modeling the concept of movie in a software architecture for film-induced tourism","authors":[{"person_name":{"surname":"Lavarone","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Polato","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Savino","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-319-41938-1_13","arXiv":null},"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":612,"pages":{"from_page":116,"to_page":125}}},"b10":{"title":"Motivating and involving users through gamification: a proposal","authors":[{"person_name":{"surname":"Micheletti","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-319-56300-8_3","arXiv":null},"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":701,"pages":{"from_page":20,"to_page":30}}},"b11":{"title":"Different strokes from different folks: community ties and social support","authors":[{"person_name":{"surname":"Wellman","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Wortley","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"1990","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Am. J. Sociol","series":null,"scope":{"volume":96,"pages":{"from_page":558,"to_page":588}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Film-induced tourism regards the interest towards destinations motivated by a connection with audiovisual content. Film-induced tourism has been defined by Sue Beeton as \"visitation to sites where movies and TV programmes have been filmed as well as to tour to production studios, including film-related theme parks\" [2]. It may be very helpful for destination management and destination marketing: it attracts new visitors and also tourists who have already seen the area for a different reason; it is largely independent of seasonal trends; it might convey tourists from overcrowded sites to new and less explored ones; and it can be suitable for a substantial re-branding of a certain area. A number of film-induced tourism related initiatives has been already undertaken at the international level by public and private bodies, which developed movie maps and movie tours or exploited the success of a particular movie as a tool for destination branding [5].","refs":[{"start":317,"end":320,"marker":"bibr","target":"#b1"},{"start":957,"end":960,"marker":"bibr","target":"#b4"}]},{"text":"Visit Britain, the tourism office of the UK, was one of the first agencies to use movies for attracting tourists: since the nineties it designed movie tours and developed tools such as movie maps, that is maps representing locations of movies and TV series. Another interesting case is related to The Lord of the Rings saga (Jackson, 2001(Jackson, -2003)), which is still attracting masses of tourists in New Zealand, thanks to a thoughtful policy by the local government. Also Italy has a number of relevant cases, including The Passion of the Christ (Gibson, 2004) that doubled the number of tourists visiting Matera in Basilicata and a number of fictions such as Inspector Montalbano in Sicily, Carabinieri and Don Matteo in Umbria [9].","refs":[{"start":324,"end":338,"marker":"bibr","target":null},{"start":338,"end":355,"marker":"bibr","target":null},{"start":552,"end":565,"marker":"bibr","target":null},{"start":735,"end":738,"marker":"bibr","target":"#b8"}]},{"text":"Tourism effectiveness can be improved through the access to a rich collection of structured data, which is the starting point for designing an exhaustive and attractive tourism offer and for developing ICT tourism tools. Unfortunately, the creation of a structured collection of multimedia items is a time-consuming task, which may require a huge quantity of individuals involved in a boring and unsatisfying activity. In this paper, we address this problem using crowdsourcing and reputation principles. Since these tools showed their effectiveness in a variety of fields, we believe that they can be a viable solution to the task of geolocating a large number of audiovisual excerpts.","refs":[]}]},{"title":"Motivation","paragraphs":[{"text":"Our interest towards film-induced tourism applications dates back to 2014 [10]. The goal was the creation of a database to represent the relationship between movie excerpts and locations. The project had a double goal: promoting filminduced tourism and raising interest towards audiovisual productions, their language and their relation with the landscape. Although the focus was on locations in Padua and its Province, the in-depth description even for a relatively small geographical area showed to be a time-consuming task. One critical aspect was that a restricted number of users -e.g. scholars in film studies -were involved in providing all the information, from film analysis to location identification. Yet, only part of this information required the competences of trained experts while most of the time was spent in the less specialized task of annotating multimedia items with geographical information. These considerations suggested a crowdsourcing approach.","refs":[{"start":74,"end":78,"marker":"bibr","target":"#b9"}]},{"text":"The term crowdsourcing was coined in 2006 [8] as a variant of the term (and the practice of) outsourcing: an institution asks that a given function is undertaken by an undefined, and possibly large, group of individuals. The term is applied to situations where individuals receive a payment for their work, but it is also used when participation is voluntary. Amazon Mechanical Turk1 and Crowd-Flower2 are well-known crowdsourcing platforms, which have been exploited also for multimedia research. Relevant research projects that are based on crowdsourcing include the segmentation of ancient Maya hieroglyph-blocks [4], the assessment of Internet video quality [7] and the teaching in cinematography field [1].","refs":[{"start":42,"end":45,"marker":"bibr","target":"#b7"},{"start":382,"end":383,"marker":null,"target":"#foot_0"},{"start":400,"end":401,"marker":null,"target":"#foot_1"},{"start":616,"end":619,"marker":"bibr","target":"#b3"},{"start":662,"end":665,"marker":"bibr","target":"#b6"},{"start":707,"end":710,"marker":"bibr","target":"#b0"}]},{"text":"In order to encourage participation to a crowdsourcing activity, we envisage an interaction with a simple and intuitive interface, which implements a reputation mechanism. The latter is likely to be part of a more complex process that is an investment in social capital. In this contest, \"social capital is the actual or potential resources which are linked to a durable network of institutionalized relationships of mutual acquaintance or recognition\" [3]. The quest for gaining a social capital requires a continuous search for consensus [12] and sharing with the group what we know is becoming a pleasure without the expectation of reciprocity.","refs":[{"start":453,"end":456,"marker":"bibr","target":"#b2"},{"start":540,"end":544,"marker":"bibr","target":null}]},{"text":"This identification with a group, based on sharing just for the pleasure of it with no hidden agenda, is one major aspect of new digital media also because digital objects (e.g. recordings in a music digital library) can be replicated and shared an infinite number of times without losing quality. Moreover, sharing with the group both what we have and what we know is becoming a pleasure without the expectation of reciprocity, an openness based on selfless approach. This sense of belonging, which is shared also by on-line communities that have been called emotion communities, is balanced by an opposite drive: consumption and participation as a narcissistic act of exhibitionism in order to be socially recognized [6,11].","refs":[{"start":719,"end":722,"marker":"bibr","target":"#b5"},{"start":722,"end":725,"marker":"bibr","target":"#b10"}]}]},{"title":"Crowdsourcing for Film-Induced Tourism","paragraphs":[{"text":"Our goal is to develop a web portal where registered users can contribute to data gathering in all the forms that can be useful for film-induced tourism applications. The main functions that will be available are the following.","refs":[]},{"text":"-Discover, and insert into the database system, metadata related to multimedia content -from now on called MOVIE -that is relevant for film-induced tourism: movies, TV and web series, advertisements, documentaries, music videos. -Identify the excerpts of a given MOVIE that are relevant for a given geographical area or a particular location. We define these excerpts MOI, from Moment Of Interest. -Geolocate the MOIs, that is associate to the excerpts one or more geographical locations; geolocation can have different resolutions, from a wide area to a precise place with given spatial coordinates. We define these locations SOI, from Site of Interest as an extension of the well-known concept of Point Of Interest (POI). -Vote the activities carried out by the other users, in particular geolocation, in order to create a community of users based on the concept of reputation.","refs":[]},{"text":"The next section focuses on the geolocation task, providing a first case study.","refs":[]}]},{"title":"Geolocation Model","paragraphs":[{"text":"We define a MOI m as a portion of a MOVIE defined by the time interval [t 1 , t 2 ] with t 1 < t 2 . Considering the set M of the MOIs of a MOVIE, geolocation consists in the association of geographical information to each m ∈ M . Given U the set of users, the outcome of geolocation can be described by","refs":[]},{"text":"which represents the operation carried out by user u ∈ U for MOI m ∈ M ; l is the index of the SOI. Although it is possible that two different geographical areas are relevant for the same movie excerpt, for instance because they are the result of film editing, for simplicity of notation we assume that a single SOI is associated to a MOI and hence we omit the index l in the following discussion.","refs":[]},{"text":"The outcome of geolocation can thus be represented in two, not exclusive, forms:","refs":[]},{"text":"-su,m represents the symbolic description of a geographical area, such as the name of a region, a province, a city, and so on. -ḡu,m represents the geographical coordinates, usually in the form of latitude and longitude. Symbolic information is strictly required, at least defining a wide area such a country or a region, geographical information is not mandatory.","refs":[]},{"text":"Let us define V as the set of all insertions for a given SOI, and vo,m the ground truth. In this case, we assume that the ground truth can be obtained by an expert in film-induced tourism who has a perfect knowledge about both the MOVIE and the SOIs. In our context, the ground truth represents the optimal position for a tourist to fully appreciate the connection between the audiovisual content and the physical location. We assume that the ground truth is described with the maximum available accuracy for associating a SOI to a MOI. The goal is to find v * ∈ V that minimizes the distance with the ground truth, providing that each user of the system can provide an incomplete, imprecise or even incorrect estimate of a SOI. Thus, a distance function needs to be defined between v.","refs":[]},{"text":"The choice of the distance function depends on how v is represented. The computation of a distance between two SOIs that include geographical information ḡ is straightforward but, in a crowdsourcing environment, the requirement of providing precise geographical coordinates may discourage users, who may not be able to geolocate MOI at this level of detail. Yet, users may contribute some relevant information, because they are aware of the geographical area, the city, or even the neighbors of a MOI.","refs":[]},{"text":"Distance Between Symbolic Descriptions. In order to overcome this problem, we propose to use the symbolic representation s of a SOI. Formally, the insertion made by user u about MOI m is defined as","refs":[]},{"text":"while the ground truth for MOI m is defined as","refs":[]},{"text":"where elements have an increasing level of accuracy, and V ≤ N that is the information provided by a user is at most as accurate as the ground truth.","refs":[]},{"text":"A practical example may help describing the approach. Let us consider as MOI m the first four minutes of the MOVIE Galileo (Cavani, 1968), that have been filmed inside the Anatomical Theatre of the Palazzo Bo, the main building of the University of Padua, located in Via VIII Febbraio. Two SOIs, with different level of detail, could be inserted by users u and w: where the second represents also the ground truth, which has the highest level of accuracy according to film scholars. It is important to note that the different levels need to be consistent, but this can be obtained through the user interface that computes whether the insertion corresponds to a real location or not.","refs":[]},{"text":"We propose to measure the difference between two symbolic descriptions through a binary similarity. Starting from α 0 the two arrays are paired until a difference is found or it is reached the end of the shortest one: the longest the common subsequent the highest the similarity. Moreover, it is possible to give a weight ρ k to each level of α k , with ρ 0 ≤ ρ 1 ≤ • • • ≤ ρ N in order to penalize very short common subsequences. A conceptual algorithm that outputs the difference between SOIs su,m and sw,m , with respective length Lu and Lw is the following:","refs":[]}]},{"title":"SOI Insertion","paragraphs":[{"text":"Users are completely free to insert new SOIs, and each new contribution is also managed as a reinforcement of similar records that are already present in the system. For instance in the case of MOI m, user u can insert the array su,m = <α 0 u,m , . . . , α V u,m >. If another user w has already inserted array sw = <α 0 w,m , . . . , α N w,j >, with N ≥ M and with the same first M elements, his/her contribution automatically obtains a reinforcement. For instance, if for the first four minutes of Galileo a user already inserted the array sw,m that has an accuracy until the street number, the insertion of su,m with same location but a lower accuracy gives automatically a positive weight to sw,m . In case of SOIs having the geographical component ḡ they are consider equal only if the distance is within a given threshold. Since we want to encourage participation, the user is asked to give his/her contribution also by voting the quality of the existing contributions, without inserting new SOIs.","refs":[]}]},{"title":"Evaluation of Users' Insertions","paragraphs":[{"text":"As described in Sect. 2, users need to be motivated to contribute to geolocation and in general to the different crowdsourcing tasks. This can be based on the fact that each contribution is evaluated by other users, providing an indirect judgment about user's knowledge about audiovisual content and the geographical areas. Users participate to the activity to gain reputation as experts in the subject. We propose the following evaluation mechanism.","refs":[]},{"text":"Starting from the SOI vw,m = <s w,m , ḡw,m >, each user u ∈ U with u =w can provide a negative, neutral, or positive judgment to all the elements that constitute vw,m . Being ḡw,m the most accurate description, a positive judgement is inherited by all the elements of sw,m . On the contrary, a negative judgement to any of the α i of sw,m is propagated to all α k ∈ s, with k < s, and to ḡw,m if present. The possibility to provide a partial judgement to a SOI allows us to highlight the potentially correct symbolic components, encouraging the community to cooperate inserting new SOIs that refine existing and incomplete information. Using again the example of the movie Galileo, if sw,m = Italy, Veneto, Province of Padua, Padua, Via VIII Febbraio receives positive judgements to the component Province of Padua and negative judgements to Padua, it is likely that the real location is within the province but outside the city of Padua.","refs":[]},{"text":"Judgements are weighted by user's reputation, which in turns depends on the number positive and negative judgements received by the user. It is likely that reputation can be split in general reputation, which takes into account the general reliability of a user, and in local reputation, which is related to the ability of a user to carry out correct and precise identification in a given geographical area. The way reputation is computed is part of our future work.","refs":[]}]},{"title":"Experiments","paragraphs":[{"text":"We are carrying out a first test of the proposed approach, to verify the feasibility of a crowdsourcing approach. We developed a web portal that is currently used by about 100 undergraduate students of Design and Management of Cultural Tourism, who do not have a background in film studies. Participation is not mandatory, although students were encouraged to carry out the activities in order to gain points which could be added to the final grade for the course in Computer Tools for the Organization of Tourism Offer. We assigned the following tasks, to be completed in subsequent steps.","refs":[]},{"text":"1. Identify and insert in the system audiovisual productions that have been filmed in Veneto, specifying the source of information and describing the reason of the insertion.","refs":[]},{"text":"2. Confirm the insertions made by other students, also in this case describing the reason of the confirmation (to this end, the reason of the insertion was not available to other students). 3. Geolocate on GoogleMaps interface the MOIs of the already inserted movies, specifying start and end time of the MOI; geolocation was possible only for audiovisual content available on YouTube.","refs":[]},{"text":"Figure 1 shows a screenshot of the portal homepage. Figure 2 shows the web interface, divided in three vertical parts, that is used for geolocation. In the first part, the user can insert a YouTube URL and select the starting and ending points of the MOI; in the second one, the user geolocates the MOI using the Google Maps interface; and in the last part a summary of the current activity is provided.","refs":[{"start":7,"end":8,"marker":"figure","target":null},{"start":59,"end":60,"marker":"figure","target":null}]},{"text":"The first two tasks started together, while the third one started three weeks later. Students inserted 125 audiovisual productions -including movies, TV and web series -and provided 108 confirmations of already inserted productions. After one week from the beginning of task three students inserted 60 SOIs. The reputation mechanism has not been introduced yet, mainly because our primary goal was to test the effectiveness of the web interface. Nevertheless the initial results are encouraging and we believe that the crowdsourcing mechanism can be extended also to general users. Students feedback was very important for the improvement of the system interface and to refine the model described in Sect. 3.","refs":[]}]},{"title":"Conclusions and Future Developments","paragraphs":[{"text":"This paper described the main ideas behind the design and development of a crowdsourcing portal aimed at gathering information for film-induced tourism. Among the different tasks, the geolocation of audiovisual excerpts plays a central role for film-induced applications and it thus should be carried out reliably also when non expert users are involved. This goal can be achieved by reinforcing user engagement through the concept of reputation, that is the social status of being acknowledged as an expert by a social community. The case study presented in Sect. 3.3 showed that the approach is feasible: the information gathered during this initial step are the basis for the development of the crowdsourcing portal that will be starting point for the development of the crowdsourcing platform.","refs":[]},{"text":"Our future activities will address the complete definition of the reputation mechanism. Moreover, we envisage to include a number of gamification tools to increment users' involvement in the crowdsourcing effort.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper presents an initial proposal for the development of a crowdsourcing platform aimed at gathering information about audiovisual productions. Our goal is to foster the task of identifying movie excerpts that are filmed in a given location and of manually geolocating these excerpts. In this way it is possible to link audiovisual content to a geographical area. The information is used to populate a database system that is the core component for designing novel film-induced tourism offers. The task of identifying the locations of movies, TV and web series, spots and music videos is carried out by a community of non experts, using a crowdsourcing approach where participation and engagement are promoted by a reputation mechanism. The paper presents a multilevel approach to geolocation and discusses its motivations and initial results.","refs":[]}]}}