{"bibliography":{"title":"A Video Game for Stimulating Children's Creativity through Writing Stories","authors":[{"person_name":{"surname":"Siciliani","first_name":"Lucia"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bari Aldo Moro","laboratory":null}],"email":null},{"person_name":{"surname":"Scattarelli","first_name":"Caterina"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bari Aldo Moro","laboratory":null}],"email":null},{"person_name":{"surname":"Basile","first_name":"Pierpaolo"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bari Aldo Moro","laboratory":null}],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Children","Narrative","Creativity","Video game"],"citations":{"b0":{"title":"The hero with a thousand faces","authors":[{"person_name":{"surname":"Campbell","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"New World Library","journal":null,"series":null,"scope":{"volume":17,"pages":null}},"b1":{"title":"Serious games: An overview","authors":[{"person_name":{"surname":"Susi","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Johannesson","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Backlund","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"A brief history of serious games","authors":[{"person_name":{"surname":"Wilkinson","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Entertainment computing and serious games","series":null,"scope":{"volume":null,"pages":{"from_page":17,"to_page":41}}},"b3":{"title":"The effects of video games on creativity: A systematic review, Handbook of lifespan development of creativity 37","authors":[{"person_name":{"surname":"Rahimi","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Shute","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Exploitation of novel multiplayer gesture-based interaction and virtual puppetry for digital storytelling to develop children's narrative skills","authors":[{"person_name":{"surname":"Liang","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Chang","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Deng","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Chen","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Tong","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Zhang","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":63,"to_page":72}}},"b5":{"title":"The effect of digital storytelling in improving the third graders' writing skills","authors":[{"person_name":{"surname":"Yamac","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Ulusoy","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Electronic Journal of Elementary Education","series":null,"scope":{"volume":9,"pages":null}},"b6":{"title":"Us. e. 1.0: costruzione e validazione di uno strumento in lingua italiana per valutare l'usabilità dei siti internet","authors":[{"person_name":{"surname":"Di Nocera","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferlazzo","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Renzi","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"1999","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"HCITALY","series":null,"scope":{"volume":99,"pages":null}},"b7":{"title":"Sus-a quick and dirty usability scale","authors":[{"person_name":{"surname":"Brooke","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"1996","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Usability evaluation in industry","series":null,"scope":{"volume":189,"pages":{"from_page":4,"to_page":7}}},"b8":{"title":"The one number you need to grow","authors":[{"person_name":{"surname":"Reichheld","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Harvard business review","series":null,"scope":{"volume":81,"pages":{"from_page":46,"to_page":55}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Nowadays, children are accustomed to digital devices like smartphones, tablets, and PCs. In fact, unlike previous generations, they have not witnessed the birth of such technologies, but they grow and interact with environments where these devices are already present. For this reason, they are usually referred to as digital natives.","refs":[]},{"text":"These capabilities make digital devices tools for play and entertainment and allies for developing cognitive skills. In fact, multimedia can use multiple communication channels simultaneously (visual, auditory, textual, etc.), offering more opportunities for understanding and interpretation.","refs":[]},{"text":"Fabula Deck 1 is a card game created in 2016 by Andrea Binasco and Matteo di Pascale with the aim of helping writers and screenwriters to build their stories. The original deck is composed of 42 cards, divided into three main groups: Assets, Story Development, and Editing.","refs":[]},{"text":"Given the huge success of Fabula Deck, the same authors released in 2021 Fabula for Kids Deck 2 , which has the same structure and goal as its predecessor but is aimed at a far younger audience, i.e., kids.","refs":[]},{"text":"The Fabula for Kids Deck is composed of 34 cards and a die. The cards are grouped into 4 categories:","refs":[]},{"text":"19th IRCDL (The Conference on Information and Research science Connecting to Digital and Library science), February 23-24, 2023, Bari, Italy * Corresponding author. lucia.siciliani@uniba.it (L. Siciliani); c.scattarelli1@studenti.uniba.it (C. Scattarelli); pierpaolo.basile@uniba.it (P. Basile) 0000-0002-1438-280X (L. Siciliani); 0000-0002-0545-1105 (P. Basile)","refs":[]},{"text":"• 6 Prompt Cards: as the name suggests, these are specific cards used in the beginning stages of the game to gather the first ideas regarding the story. The die is also used in this stage since each of its faces refers to one of the prompt cards; • 4 Ingredient Cards: are used to build the characters and the world where the story will be set; • 9 Structure Cards: these cards help build the story's grounding elements. These cards follow the typical structure of fairy tales. From a narratological point of view, they follow the classic structure called \"Hero's Journey\" [1] which has been summarized by its creator, Joseph Campbell, as follows:\"A hero ventures forth from the world of common day into a region of supernatural wonder: fabulous forces are there encountered and a decisive victory is won: the hero comes back from this mysterious adventure with the power to bestow boons on his fellow man\"; • 10 Boost Cards: these cards can represent further help to bring more details to the story. The 34th card is an Idea card, which can help kids create the kind of story they want to build in a single sentence. Fabula Deck and Fabula for Kids Deck are available not only as a physical deck of cards but also as a digital download so that anyone can print their set of cards at their home. Both these formats allow the free arranging of the cards in a given space (e.g., a table or a wall).","refs":[{"start":573,"end":576,"marker":"bibr","target":"#b0"}]},{"text":"For sure, this game modality has its own features and benefits (like visual and tactile stimuli) it has the drawback of having low portability: the game needs a dedicated space if the story is developed in multiple sessions happening in different periods of time, and the only way to move the same game setting from one place to another (e.g., to complete the story with a friend) is to take note of all the cards used up to that point and re-arrange them later.","refs":[]},{"text":"To this extent, the contribution video games can make is important, and since we are certain that Fabula for Kids Deck represents a powerful tool that can draw near storytelling with children, we decided to develop a video game counterpart of this card game.","refs":[]},{"text":"The rest of the paper is structured as follows: Section 2 describes other approaches available at the state-of-the-art, Section 3 introduces the game we developed, Section 4 reports the results of our evaluation, and finally, conclusions and future work close the paper.","refs":[]}]},{"title":"Related Work","paragraphs":[{"text":"Serious games [2,3] are designed to teach something and aim to educate without neglecting entertainment. Table 1 shows some examples of serious games that have been published within different application areas. A sub-category of serious games is represented by the so-called edugames (Educational Games) that are used mainly in educational settings, such as schools. Game-based learning employs the use of existing or purpose-developed games (serious games or edugames) to teach or achieve a specific learning outcome. The difference between game-based learning and a serious game or edugame is that game-based learning is a learning methodology while the others are categories of games through which game-based learning is possible.","refs":[{"start":14,"end":17,"marker":"bibr","target":"#b1"},{"start":17,"end":19,"marker":"bibr","target":"#b2"},{"start":111,"end":112,"marker":"table","target":"#tab_0"}]},{"text":"In light of the above, it can be said that the Fabula For Kids video game is a serious game that could also be used as an edugame in the appropriate contexts. With regard to the methodology, the one applicable is undoubtedly that of game-based learning. In addition to being a useful tool for story production, the Fabula For Kids video game can also be considered a valuable ally in stimulating children's creativity through story writing. Although it is not possible to trace a large number of video games whose purpose is to invent and write stories, as will be explored later, there is a large number of video games on the market that are useful in stimulating children's creativity with different mechanics.","refs":[]}]},{"title":"Games to foster user's creativity","paragraphs":[{"text":"Minecraft 7 , released in 2011 by the Mojang Studios house, was the first open-world game to fully leave room for the imagination and creativity of the player. This title allows players to explore freely a 3D world made up of blocks, dig for minerals, make tools and build objects and structures. The entire game experience is customizable, from the world's morphology to the character's skin. Given the simplicity of the mechanics, the player's entire work focuses not so much on farming the materials as much as on construction. On the web, it is possible to admire exquisite constructions by players who, through patience and imagination, have also managed to reproduce quite faithfully some of the wonders of the Ancient World, such as The Hanging Gardens of Babylon or the Gates of Ishtar. Minecraft has also proven to enhance players' creativity in several studies [4].","refs":[{"start":10,"end":11,"marker":null,"target":"#foot_4"},{"start":871,"end":874,"marker":"bibr","target":"#b3"}]},{"text":"Scribblenauts 8 is a video game series developed by 5th Cell. The first game of the series was released in 2009 for the Nintendo DS system and completely revolutionized puzzle game mechanics. Basically, Scribblenauts is a game in which the player becomes the narrator of a colorful world and will have to help the hero overcome various levels composed of obstacle courses or puzzles. The revolution lies in giving full powers to the user/narrator. In fact, the only existing mode for solving environmental puzzles is a screen on which the player can literally draw (almost) any existing object that is materialized in the hero's world to help him solve the puzzles. Creativity is what allows the gamer to continue through the obstacles and solve the puzzles, as a game based on environmental puzzles naturally tends to stimulate the player's logical-cognitive abilities, but since there is no one-size-fits-all solution to completing the levels, the player can unleash his or her imagination to its full potential (e.g., create a giraffe to be used as a bridge).","refs":[]},{"text":"The Drawn To Life9 another series from the video game company 5th Cell, published for the first time in 2007 for the Nintendo DS. As in the Scribblenauts series, the player will take on the story's narrator role, however, there are not too many environmental puzzles to solve, rather a fictitious city to run and defend from enemies. It is up to the player to create weapons and objects by drawing them directly on the screen of the Nintendo DS. The fun for the players is represented by the opportunity to see full-screen the world objects they designed and that, in addition to playing a functional role in the plot (or quests), also provide an extra touch of originality and creativity.","refs":[{"start":17,"end":18,"marker":null,"target":"#foot_6"}]},{"text":"Animal Crossing10 is a video game series belonging to the simulation genre first published by Nintendo in 2001. The game is a sandbox game, in which the player has absolute powers over the morphology and logistics of the land. The whole idea of entertainment is based on the management of the island the user creates, both from an economic and demographic point of view. The protagonist himself (the player's avatar) is fully customizable, from skin color to hairstyles and facial features. The entire Animal Crossing saga can thus be considered part and parcel of games devoted to developing players' creativity thanks to several mechanics designed to customize the user's gameplay.","refs":[{"start":15,"end":17,"marker":null,"target":"#foot_7"}]},{"text":"The Sims series11 is probably the most famous life simulator in the world. Released on behalf of EA Games in the early 2000s, it immediately impressed the public with its simplicity and consistency of play. Here, too, the player plays the role of a narrator who will have to manage the daily lives of his or her characters. With The Sims, gamers were able to experience what it was like to lead a virtual life, without the dangers of online games, plus it was the first real-life simulator to approach real dynamics i.e., characters' relationships, desires, and needs. Given the game mechanics, we can also consider this a product capable of stimulating creativity. Like humans, Sims need to work for a living, and making a career is always a great way to increase their income, which is then used to pay the rent, furnish the house they live in or expand it, buy food, attend events, etc. The strength of this series is precisely the respect and consistency with real life that involves earning strategies and developing managerial skills.","refs":[{"start":15,"end":17,"marker":null,"target":"#foot_8"}]}]},{"title":"Fabula-like games","paragraphs":[{"text":"To the best of our knowledge, there are several physical games like Fabula for Kids Deck on the market, but as concerns video games (apps, web apps), it is only possible to provide some examples that do not completely cover the features found in the Fabula For Kids video game.","refs":[]},{"text":"My Storybook 12 is a web app that allows users to write illustrated books, share them through a link to the page and request a printed version. The main difference with the Fabula for Kids video game is that this web app does not support the users about how to develop their story. The users can add a new page to their book where there is a text box where they can type the text related to that page which is followed by a section where the users can select/arrange different images made available within the My Storybook app to create an illustration for that specific page.    Story Maker, like My Storybook is another web app that can be used by kids to create stories. The game proposes the user a questionnaire where he/she can select different elements that will appear in the final story. The options selected by the user are then used to fill some templates.","refs":[]},{"text":"Inventa Storie13 is an app developed by Professor Rita Carlucci, who is a neuro and psychomo-    tor therapist at the University of Rome. The game is created using WordWall14 a web app that allows creating simple edugames. In this game, a sequence of cards composing the story is shown to the player one by one. Each card contains a fragment of the story with some blank phrases (e.g. \"Once upon a time there was a... \"), and the player can fill the gap as desired. Some images are shown on the card as well (e.g., a boy, a girl, a cat) however, the user can't write the story in the game: the only commands available are the ones that allow skipping to the next or previous card. The ways the cards are shown can change as WordWall allows for several display methods.  Story Dice15 is a mobile app developed by Sandclock Games aimed at helping kids create stories. As the name suggests, the whole game is based on dice that are rolled after the input provided by the user. Each die shows a prompt that can be used to develop a story. Also in this case, the user must take note of the story separately, and the game gives no help with the narrative structure.","refs":[{"start":14,"end":16,"marker":null,"target":"#foot_10"},{"start":172,"end":174,"marker":null,"target":"#foot_11"},{"start":780,"end":782,"marker":null,"target":"#foot_12"}]},{"text":"Finally, in [5] the authors propose a game where children can interact with characters and interactive virtual items in the virtual environment through gestures. The game allows users to modify the story being narrated by moving the characters appearing in it.","refs":[{"start":12,"end":15,"marker":"bibr","target":"#b4"}]}]},{"title":"Fabula For Kids: the Video Game","paragraphs":[{"text":"As reported in [6], digital writing in children can improve the quality of ideas, organization, choice of words, and sentence fluency in terms of writing. Similarly, children can raise the number of words used in writing stories and proficiency in using digital systems, develop a greater sense of community by improving interactions between students in the classroom, and raise their motivation to write. Moreover, to try to fill the gap due to the absence of Fabula-like video games, we decided to develop a video game to stimulate the creativity of younger people through the creation of stories.","refs":[{"start":15,"end":18,"marker":"bibr","target":"#b5"}]}]},{"title":"Game mechanics and user interactions","paragraphs":[{"text":"In this section, we will describe Fabula For Kids video game, along with images that show the main mechanics and how the player can interact. When the game starts, we are in the main menu (Figure 11), where it is possible to turn off the background music, reactivate or still deactivate even during the session, exit, or play.  The user gets into the game by pressing the Gioca (Play) button. Each action is driven, and the structure for writing the story is fixed, following the scheme of the Hero's Journey. In any case, it is still possible to avoid writing something related to the card by clicking on Fatto (Done) without adding text, if the story does not require that specific block of narrative according to the author's judgment. In each scene, the first component shown to the user is the sheet with a brief introduction to the game section and instructions to continue.","refs":[{"start":196,"end":198,"marker":"figure","target":"#fig_10"}]},{"text":"To continue, the user has to click on the deck at the bottom left to draw the cards of the section where the user is. The cards the user can drag onto the game table are shown at this point. When clicking on the card, before starting dragging, a marker appears on the board, which indicates to the user the point where the card must be positioned, as shown in figure 13. After dragging the cards onto the playing board, it is time to write the story part about the card itself and to do so the user must click on the card. The click will activate the item, which will show a short description of the selected card and then, with another click on the same object, it will be possible for the user to write his text. Pressing the Fatto (Done) button, the window is closed.    When the game sections run out, the last scene is the one for story generation, where the player is presented with a summary of the written story.","refs":[{"start":367,"end":369,"marker":"figure","target":"#fig_12"}]},{"text":"At this time, the player may decide to edit what he has written and then enters a title for his story. Finally, the button for saving the story (in PDF format) appears on the screen, and then a message congratulates the user for finishing the game. It will then be taken to the main menu. ","refs":[]}]},{"title":"Implementation","paragraphs":[{"text":"We describe the tools used to develop the Fabula For Kids video game. The game was programmed in Unity 2021.3.8f1 with the help of Microsoft Visual Studio 2017 for writing scripts in C#. As for the game assets, the cards belong to Fabula for Kids Deck, the background of the board with free license is downloadable from Vecteezy16 , while the other elements belong to the Paper UI Pack17 of Lynda Mc Donald. The music was composed by Alexander Nakarada and published on Chosic18 ; for the title font, it was chosen to use Bienetresocial, while for the texts Andika.","refs":[{"start":328,"end":330,"marker":null,"target":"#foot_13"},{"start":385,"end":387,"marker":null,"target":"#foot_14"},{"start":476,"end":478,"marker":null,"target":"#foot_15"}]},{"text":"The Andika font was chosen because it is designed especially for literacy use, considering the needs of beginning readers. The focus is on clear, easy-to-perceive letterforms that will not be readily confused with one another. The final PDF generation with the story was implemented through the external libraries PDFsharp and MigraDoc.","refs":[]}]},{"title":"Evaluation","paragraphs":[{"text":"To evaluate the effectiveness of the Fabula For Kids video game, we organized a usability case study that involved 23 children, 13 girls and 10 boys. We decided to proceed with children aged between 8 and 13 since they must possess reading and writing skills. Each session took place in 1-to-1 mode, with the interviewer and tester. At the end of each session, a usability questionnaire was submitted concerning the video game under consideration to measure how easy the Fabula For Kids video game is to use, graphically appealing, complete in terms of functionalities, and considered a useful tool for fulfilling the purpose of stimulating the creativity of the very young through story-writing. This was done by means of Google Forms.","refs":[]},{"text":"The questions in the questionnaire for the usability study are divided into four categories:","refs":[]},{"text":"1. General information about the participant, such as date, time, age, gender, consent to participate, educational qualification, general questions about the relationship with video games and their use, and a confirmation question about the name of the video game just tested were recorded; 2. UsE [7] (Usability Evaluation) questions to quickly investigate the degree of usability and identify the issues present for which it might be necessary to intervene; 3. SUS [8] (System Usability Scale) questions to collect statistically valid data and give to the Fabula For Kids video game a clear and precise score on its usability; 4. NPS [9] (Net Promoter Score) questions aimed at quantifying the probability of someone recommending the video game to other possible users.","refs":[{"start":298,"end":301,"marker":"bibr","target":"#b6"},{"start":467,"end":470,"marker":"bibr","target":"#b7"},{"start":636,"end":639,"marker":"bibr","target":"#b8"}]},{"text":"In addition, a bonus section was provided for leaving a comment on the video game. The UsE questionnaire takes into account three dimensions:","refs":[]},{"text":"• M (Manageability): how easily the user can interact with the game and explore its functionalities;","refs":[]},{"text":"• S (Satisfaction): how much the game can satisfy its purposes and enable users to reach their goals; • A (Attractiveness): how appealing the game graphics and interactions are according to the user.","refs":[]},{"text":"Analyzing the UsE scores, standardized according to the companies/services category, we observe that the average score is above 2. This is a good score since above 0 means a positive feeling. The score for each dimension and gender are reported in Table 2. We obtain a very high score for satisfaction (S) and manageability (M), while female considers video game less attractive. Taking into account the SUS, our video game obtains a score of 93.59 points which is above the average of 68. This result is very encouraging and proves the high usability of our video game.","refs":[{"start":254,"end":255,"marker":"table","target":"#tab_1"}]},{"text":"The obtained NPS score is 67.39, which is largely positive if we consider that the NPS score can have a minimum value of -100 and a maximum value of +100","refs":[]},{"text":"Considering the overall results of the usability tests, we can conclude that the Fabula For Kids video game would be received by the public with great interest, going on to enrich the market of serious games and edugames in the slice that concerns video games in the same category, namely those helpful in writing stories and stimulating the creativity of children.","refs":[]}]},{"title":"Conclusions and Future Work","paragraphs":[{"text":"We design and develop a new video game to stimulate children's creativity by inventing stories. The video game is inspired by a card game called Fabula For Kids Deck and is based on the \"Hero's Journey\" methodology. To evaluate the effectiveness of our game, we conduct a usability case study based on three well-known questionnaires. The study obtains very positive results and proves the interest in these kinds of technologies.","refs":[]},{"text":"Considering some user comments, we can plan some future work. In particular, adding tooltips that can help during the interaction with cards; improving the save functionality in order to close the game and continue writing later; adding social and community features in order to share the stories with other users. Moreover, we plan to build customized/thematic versions for specific domains. For example, the Fabula For Kids video game can engage children during their visit to a museum or historical place by creating stories related to the cultural/historical context.","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1","description":"Examples of serious games in different application areas.","rows":[["Application Area","Examples"],["Advertisement (supplement or sponsorship of other products)","Playmobil minigames"],["Information and Communication Earthquake in Zipland 3 , Food Force 4"],["Health","Dr. Kawashima's Brain Training 5 , Ring Fit Adventure 6"],["Activism","Climate Change, Recycle City"],["Culture","Father and Son, Prisme7"]]},"tab_1":{"heading":"Table 2","description":"UsE scores.","rows":[["","female","","","male",""],["M","S","A","M","S","A"],["2.83 3.98 1.99 3.59 3.42 2.44"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper presents a video game for stimulating children's creativity through writing stories. The video game is based on a card game called Fabula to help writers and screenwriters to build their stories. In particular, a different version of this game, Fabula For Kids, is aimed at a younger audience, i.e., kids. We decided to develop a video game counterpart of this card game since children are accustomed to digital devices like smartphones, tablets, and PCs. We conducted a usability case study involving 23 children on the video game prototype, obtaining promising results and valuable comments for improving the game.","refs":[]}]}}