{"bibliography":{"title":"Towards a Decision Support Framework for Forensic Analysis of Dynamic Signatures","authors":[{"person_name":{"surname":"Mazzolini","first_name":"Daniela"},"affiliations":[{"department":"Dipartimento Peritale","institution":"Associazione Grafologica Italiana (A.G.I.)","laboratory":null}],"email":null},{"person_name":{"surname":"Pavan","first_name":"Patrizia"},"affiliations":[{"department":"Dipartimento Peritale","institution":"Associazione Grafologica Italiana (A.G.I.)","laboratory":null}],"email":null},{"person_name":{"surname":"Pirlo","first_name":"Giuseppe"},"affiliations":[{"department":"Dipartimento di Informatica","institution":"Università degli Studi di Bari","laboratory":null}],"email":null},{"person_name":{"surname":"Vessio","first_name":"Gennaro"},"affiliations":[{"department":"Dipartimento di Informatica","institution":"Università degli Studi di Bari","laboratory":null}],"email":"gennaro.vessio@uniba.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-39905-4_2","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Decision support systems","Dynamic signatures","Forensic analysis","Signature verification"],"citations":{"b0":{"title":"A perspective analysis of handwritten signature technology","authors":[{"person_name":{"surname":"Diaz","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferrer","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Impedovo","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Malik","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Pirlo","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Plamondon","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"ACM Comput. Surv. (CSUR)","series":null,"scope":{"volume":51,"pages":{"from_page":117,"to_page":117}}},"b1":{"title":"Huber and Headrick's Handwriting Identification: Facts and Fundamentals","authors":[{"person_name":{"surname":"Harralson","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Miller","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":"CRC Press","journal":null,"series":null,"scope":null},"b2":{"title":"An evolutionary approach to address interoperability issues in multi-device signature verification","authors":[{"person_name":{"surname":"Impedovo","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Pirlo","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Sarcinella","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Vessio","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":"IEEE","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":3028,"to_page":3033}}},"b3":{"title":"Forensic analysis of digital dynamic signatures: new methods for data treatment and feature evaluation","authors":[{"person_name":{"surname":"Linden","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Marquis","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Mazzella","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Forensic Sci","series":null,"scope":{"volume":62,"pages":{"from_page":382,"to_page":391}}},"b4":{"title":"Toward accurate dynamic time warping in linear time and space","authors":[{"person_name":{"surname":"Salvador","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Chan","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Intell. Data Anal","series":null,"scope":{"volume":11,"pages":{"from_page":561,"to_page":580}}},"b5":{"title":"Feature-based dynamic signature verification under forensic scenarios","authors":[{"person_name":{"surname":"Tolosana","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Vera-Rodriguez","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Fierrez","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Ortega-Garcia","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"IEEE","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1,"to_page":6}}},"b6":{"title":"e-BioSign tool: towards scientific assessment of dynamic signatures under forensic conditions","authors":[{"person_name":{"surname":"Vera-Rodríguez","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Fiérrez","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Ortega-García","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Acien","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Tolosana","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"IEEE","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1,"to_page":6}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Traditionally, forensic handwriting examiners (FHEs) are asked to verify the authenticity of a signature by relying on its static version, i.e. on an image of the signature acquired after the writing process has already occurred. However, with the increasing use of new technology, such as digitizing tablets, PDAs and smart phones, FHEs are more and more often confronted with dynamic signatures, i.e. the ones that can be acquired while the writing process still occurs [2]. Examples of application include information access and document analysis in digital archives. A dynamic signature is characterized not only by the geometrical position of the pen, but also by temporal, inclination and pressure information. In addition, most of modern tablets capture pen movement not only when the pen is on the pad surface, but also when the pen is in proximity of the surface, i.e. \"in-air\". While these new measures provide FHEs with a basis for quantitative and semi-automatic examinations, they also pose new challenges mainly due to a shift of paradigm from a qualitative analysis to a statistical and mathematical one they may be not familiar with.","refs":[{"start":472,"end":475,"marker":"bibr","target":"#b1"}]},{"text":"Historically, the field of signature verification is of interest also to the biometric community. Excellent verification performance have been obtained in a number of studies employing pattern recognition and machine learning strategies to provide an automatic answer about the authenticity of a questioned signature [1]. State-of-the-art methods have also been used in the forensic scenario [6,7]. However, the majority of these systems are characterized by complex solutions and high dimensional data making them perfect \"black-boxes\" to FHEs. Unfortunately, the use of these systems make difficult to FHEs to explain the rationale behind their final evaluation, which is strictly required in a working setting.","refs":[{"start":317,"end":320,"marker":"bibr","target":"#b0"},{"start":392,"end":395,"marker":"bibr","target":"#b5"},{"start":395,"end":397,"marker":"bibr","target":"#b6"}]},{"text":"Therefore, there is the need for an easy to explain yet reliable framework for supporting dynamic signature verification in forensic scenarios. The present paper aims at moving a step towards this direction: a preliminary framework is proposed and the results of a simple case study are reported. Recent research started to address this problem, raising limitations and opportunities [4]. Unfortunately, especially in Italy, there is the lack of cross-fertilization between the forensic and biometric community. The present research is the result of an interdisciplinary collaboration and it is thus aimed at promoting fruitful exchanges.","refs":[{"start":384,"end":387,"marker":"bibr","target":"#b3"}]}]},{"title":"Proposed Method","paragraphs":[{"text":"The proposed method is intended to provide guidelines for the FHE to follow for evaluating the authenticity of a questioned signature, given the time series raw data sampled by the acquisition device. It is worth to remark that it is inspired by the quantitative analysis recently proposed by Linden et al. [4]. The main difference concerns the introduction of a majority voting decision scheme to assist the FHE when multiple evidences arise. Moreover, as we will show in the Next Section, the proposed method has been tested on completely legible signatures instead of less complex initials.","refs":[{"start":307,"end":310,"marker":"bibr","target":"#b3"}]},{"text":"The first main requirement is to have a meaningful set of genuine signatures (around 20), against which to compare the questioned signature, otherwise no convincing conclusion can be obtained.","refs":[]},{"text":"The main attributes acquired by a digitizing tablet are the x and y coordinates of the pen position and their time stamps. Moreover, pen tablets capture pen pressure and pen inclination. The last measure is the so-called button status, which evaluates 0 for pen-downs and 1 for pen-ups. Kinematic features of the handwriting process can be calculated starting from the computation of the pen displacement during movement: 2 , where i = 2, . . . , N, N is the number of sampled points and d 1 = 0. In other words, displacement corresponds to the straight line distance between consecutive sampled points. Given the typically high sampling frequency of the tablet, it provides a good approximation of the pen trajectory. From displacement, the tangential velocity and acceleration of the pen can be straightforwardly calculated as the first and second derivative of displacement, respectively:","refs":[]},{"text":"Our focus is on these kinematic features, together with pressure, as they are directly provided by most of commercial software, such as Firma Certa Forensic (https://www.namirial. com/it/), typically used by FHEs. Therefore, they do not require additional derivations.","refs":[]},{"text":"The guiding principle of this kind of analysis is that a high quality forgery can either appear precise but not fluent, or it could have been written fluently while looking imprecise. However, difficulties arise because of the inherent within writer variability, which makes signatures different even if produced by the same writer. While the trajectory pattern of the pen as well as the velocity, acceleration and pressure profiles can be easily plotted as scatter plots, these representations provide only a qualitative way to perform the signature analysis. Much more convincing conclusions can be obtained by performing a quantitative evaluation.","refs":[]},{"text":"The comparison between a questioned signature and the given set of genuine specimens can be carried out by measuring how the signature to be investigated is positioned against the statistical distribution of the within writer variability of the genuine set. Of course, the classic Euclidean distance cannot be used to compute the similarities among signatures, given the non-perfect alignment of the corresponding time series. To overcome this issue, we use the wellknown Dynamic Time Warping (DTW) algorithm. DTW has been extensively described in the literature: its goal is to measure the similarities between temporal sequences varying in speed. In the present study, we used the FastDTW Python implementation [5].","refs":[{"start":713,"end":716,"marker":"bibr","target":"#b4"}]},{"text":"The proposed method involves computing all distances, with respect to a specific feature, among the N genuine signatures in the reference set. This results in N (N -1) 2 distances which capture the within writer variability and can be plotted as a box plot. Then, the mean distance from the questioned signature and each specimen of the reference set can be calculated and plotted against the previously obtained box plot. If the questioned signature places itself within the main variation, i.e. between the first and third quartile, then it can be considered as a genuine specimen. Otherwise, if it falls outside the main variation, i.e. below or above the first or third quartile, it can be considered to some extent as a suspicious signature. It is worth noting that different degrees of reliability of the conclusion can be obtained depending on how far the questioned signature is from the main variation. This approach is helpful for the FHE to analyze how well the questioned signature is separated from the distribution of genuine signatures. The same analysis can be performed for each of the time-dependent features: velocity, acceleration, pressure. The final conclusion can be provided as the most occurring outcome derived from the previous analysis. For instance, if the questioned velocity and acceleration fall outside the main variation, while pressure does not, the conclusion is that the signature can be a forgery. In other words, a majority vote is taken.","refs":[]}]},{"title":"Case Study","paragraphs":[{"text":"In order to evaluate the effectiveness of the proposed framework, we performed a case study involving a genuine writer and a skilled forger. More specifically, we asked a FHE to provide 20 signatures of an invented person, equally split between two acquisition sessions in two different days for accounting for the within writer variability. Then, we asked the same writer to provide 5 genuine test specimens, performed in another day. Finally, we asked the daughter of the main signer, i.e. one which shares some physiological characteristics with her, to perform several forgery signatures and to choose the best 5 signatures, after practice, to be used as a test.","refs":[]},{"text":"The samples were acquired through the Wacom STU-530 sign-pad, featuring 1024 pressure levels and 200 pps of report rate. It is one of the most common and professionals pads used at the POS or at customer contact points.","refs":[]}]},{"title":"Qualitative Analysis","paragraphs":[{"text":"The geometrical position of the pen and the main dynamic attributes lend themselves to a qualitative analysis performed by considering their visual representation as scatter plots. Figure 1 shows the rendering of the signatures (including both on-surface and in-air trajectories) as well as the pressure and velocity profiles of a test genuine specimen and a test forgery. The solely visual inspection can provide meaningful insights into the signature apposition process. However, more reliable conclusions, especially in more ambiguous cases, cannot be drawn. In fact, the solely visual inspection of the characteristics of a dynamic signature, even if non-redundant with its static version, could provide less reliable evaluations than those performed in the traditional way based on the composition, direction, fluency, etc., of the signature.","refs":[{"start":188,"end":189,"marker":"figure","target":"#fig_0"}]}]},{"title":"Quantitative Analysis","paragraphs":[{"text":"This analysis involves the automatic comparison of time series using DTW. First of all, it is interesting to note the pronounced variation between signatures provided by the same individual in the two different days (Fig. 2). Then, we collapsed the overall reference set into a unique distribution against which to compare each test signature. Figure 3 shows the verification comparison, with respect to velocity, of a test genuine sample and a test forgery: differences are pretty evident.  Table 1 reports the results obtained on the test set. They confirm the effectiveness of the proposed majority voting strategy as, although the individual features sometimes failed in providing the right answer, their combination improved the verification accuracy. Indeed, only the third signature in the forgery set was mistakenly categorized as genuine. Interestingly, acceleration revealed itself as the best predictor for verification, while pressure was the worst performing feature in accurately classifying the forgery class.","refs":[{"start":222,"end":223,"marker":"figure","target":"#fig_1"},{"start":351,"end":352,"marker":"figure","target":"#fig_2"},{"start":498,"end":499,"marker":"table","target":null}]},{"text":"Table 1. Verification performance of the proposed method. On the left, the results concerning the test genuine (G) set; on the right, those concerning the forgery (F) one. The symbol indicates that, based on the corresponding feature, the method correctly classified the given signature as genuine or forgery, respectively. The final decision is taken has the majority vote of the individual features.","refs":[{"start":6,"end":7,"marker":"table","target":null}]}]},{"title":"# Velocity Acceler. Pressure Decision","paragraphs":[]},{"title":"Conclusion and Future Work","paragraphs":[{"text":"In this paper, we have proposed an easy to use yet effective framework for assisting the FHE during the analysis of dynamic signatures. Since the proposed approach is based on simple methods, provided by most of free statistical packages, and easy to derive features, it can be well tolerated by non computer science experts and can be easily explained to non professionals. Moreover, it provides FHEs with an objective evaluation tool which is independent of the specific examiner performing the analysis, resulting in reproducible and less questionable inference. The long term goal of our research is to develop guidelines accepted and used by the forensic community working with data. Our goal promotes synergies between the forensic and biometric community, as they can provide complementary and non mutually exclusive perspectives. Several issues surely demand further research. First, the effectiveness of the proposed method should be tested against a large sample of specimens, involving a large variety of writers. Second, more refined thresholds, other than the first and third quartile, should be studied, based for example on outlier analysis. Third, the results here reported only concern with global characteristics of the signatures under consideration: future work should also take into account local approaches based, for example, on the segmentation between on-surface and inair strokes. Fourth, more refined decision schemes could be investigated, weighting the available features by their different discriminating importance. Finally, device interoperability should also be taken into account, as it can strongly affect the verification results [3].","refs":[{"start":1666,"end":1669,"marker":"bibr","target":"#b2"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper presents a preliminary easy to explain and effective framework for supporting dynamic signature analysis in forensic settings. The proposed approach is based on measuring similarities among signatures by applying Dynamic Time Warping on easy to derive dynamic measures. The long term goal of our research is to provide forensic handwriting examiners with a decision support tool to perform reproducible and less questionable inference.","refs":[]}]}}