{"bibliography":{"title":"Improving User Stereotypes through Machine Learning Techniques","authors":[{"person_name":{"surname":"Basile","first_name":"Teresa"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bari \"Aldo Moro\"","laboratory":null}],"email":"basile@di.uniba.it"},{"person_name":{"surname":"Esposito","first_name":"Floriana"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bari \"Aldo Moro\"","laboratory":null}],"email":"esposito@di.uniba.it"},{"person_name":{"surname":"Ferilli","first_name":"Stefano"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bari \"Aldo Moro\"","laboratory":null}],"email":"ferilli@di.uniba.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Machine learning","Digital libraries","Stereotypes"],"citations":{"b0":{"title":"1 -User Modeling and Recommendation Techniques for Personalized Electronic Program Guides","authors":[{"person_name":{"surname":"Ardissono","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Gena","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Torasso","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Bellifemmine","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Difino","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Negro","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":6,"pages":{"from_page":3,"to_page":26}}},"b1":{"title":"A framework for the initialization of student models in webbased intelligent tutoring systems","authors":[{"person_name":{"surname":"Tsiriga","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Virvou","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"User Modeling and User-Adapted Interaction","series":null,"scope":{"volume":14,"pages":{"from_page":289,"to_page":316}}},"b2":{"title":"The role of human factors in stereotyping behavior and perception of digital library users: a robust clustering approach","authors":[{"person_name":{"surname":"Frias-Martinez","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Chen","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Macredie","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Liu","first_name":"X"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"User Modeling and User-Adapted Interaction","series":null,"scope":{"volume":17,"pages":{"from_page":305,"to_page":337}}},"b3":{"title":"Discovering user communities on the internet using unsupervised machine learning techniques","authors":[{"person_name":{"surname":"Paliouras","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Papatheodorou","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Karkaletsis","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Spyropoulos","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Interacting with Computers","series":null,"scope":{"volume":14,"pages":{"from_page":761,"to_page":791}}},"b4":{"title":"User modeling via stereotypes","authors":[{"person_name":{"surname":"Rich","first_name":"E"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":329,"to_page":342}}},"b5":{"title":"Feedback adaptation in web-based learning systems","authors":[{"person_name":{"surname":"Vasilyeva","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Puuronen","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Pechenizkiy","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Rasanen","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal of Continuing Engineering Education and Life-Long Learning (IJCEELL)","series":null,"scope":{"volume":17,"pages":{"from_page":337,"to_page":357}}},"b6":{"title":"Knowledge acquisition via incremental conceptual clustering","authors":[{"person_name":{"surname":"Fisher","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"1987","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Machine Learning","series":null,"scope":{"volume":2,"pages":{"from_page":139,"to_page":172}}},"b7":{"title":"Induction of decision trees","authors":[{"person_name":{"surname":"Quinlan","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"1986","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Machine Learning","series":null,"scope":{"volume":1,"pages":{"from_page":81,"to_page":106}}},"b8":{"title":"C4.5: programs for machine learning","authors":[{"person_name":{"surname":"Quinlan","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"1993","month":null,"day":null},"ids":null,"target":null,"publisher":"Morgan Kaufmann Publishers Inc","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Digital libraries are becoming increasingly important and pervasive information resources in current society. One of the main obstacles in supporting an effective use of digital libraries is their having typically been designed to provide a uniform access style for all users. However, it is known that the variety of user types and contexts affects both their interaction with a system and the effective response from the digital library for any particular user. As a consequence, a personalization task is necessary in order to improve digital library services. To this aim, a preliminary requirement is a better understanding of the user model. Most of the works on this topic face the problem by modelling the user preferences starting from the user feedbacks, that is the user interest, with respect to the results of the performed search. However, often this kind of personalization is not understood by all the users. In fact, usually users are not willing to provide feedback to the system, not even for receiving a better service. Furthermore, users do not necessarily know what their interests are and how they change over time, and hence cannot provide such an information to the system. Finally, even if the user is aware of his interests, the amount of information available in current digital libraries makes it unrealistic for him to specify his preferences completely on every (even if few) query results obtained by the system.","refs":[]},{"text":"A way to overcome such a limitation could be represented by the exploitation of models built on behaviours instead of explicitly declared user interests. Indeed, more realistic models should take into account information that changes over time, including: cognitive abilities (e.g.: learning styles, perception); individual differences (e.g.: age, gender, education); subject domains (e.g.: arts, health, engineering); work tasks (e.g.: writing an essay, hobby); work environments (e.g.: university, hospital, business office).","refs":[]},{"text":"A challenge, in this respect, is the inability of the systems to meet individual user expectations at run-time. A step in this direction could be done by exploiting machine learning techniques, but this requires approaches that are specific to the task. For example, machine learning could be used to build the initial model by identifying clusters of users, to allow the interface to find out more about the users and to allow reactivity and adaptivity of the system. As to the last step, i.e. the adaptivity and reactivity of the system, a particular issue is that the set of models that are built on user behaviours cannot remain static in the sense that during actual use of the intended interaction strategy more knowledge can be gathered, which should in turn be used to improve the set of models. Moreover, the acquisition of data about the user interest and behaviour can be supported by the user or automatically performed by the system. In the first case the user is asked to execute some action typically providing a feedback on the result. The second method relies on the application of intelligent inference techniques to acquire information about the user by analysing the behaviour.","refs":[]},{"text":"To this regard, in this work we would propose the exploitation of machine learning techniques to improve and adapt the set of user model stereotypes by making use of user log interactions with the system. To do this, a clustering technique is exploited to create a set of user models prototypes; then, an induction module is run on these aggregated classes in order to improve a set of rules aimed at classifying new and unseen users. Furthermore, the approach presented in this paper exploits the knowledge extracted by the analysis of log interaction data without requiring an explicit feedback from the user.","refs":[]}]},{"title":"Related Work","paragraphs":[{"text":"The exploitation of user models might be very useful to improve the interaction between the user and the system itself, in order for the latter to adapt more easily and straightforwardly the functionalities that it implements to the former. Building user models, however, is a very difficult task, because very often a person's behaviour and preferences change in time and according to different environments, situations and objectives. For these reasons, automatic learning of user models is a hot research topic and many different approaches and techniques have been proposed in the literature to accomplish this task.","refs":[]},{"text":"In this work, we focus our attention on the strategies that use the concept of stereotype to model and categorize users in order to provide them the most suitable service. Previous works only exploited the stereotypes initially defined by the domain expert to perform a matching with the facts about the user collected during his interaction with the system.","refs":[]},{"text":"In the last decade, there was an increasing interest in exploiting machine learning techniques in user stereotype theory in order to make the systems completely autonomous in adapting to different user needs. In [1], a stereotypical user model component is used to store the prediction on the user's preferences inferred from prior information about user categories. This prediction is then combined with the predictions of other modules, one of which inferred with a probabilistic machine learning approach, in order to estimate the user's preferences to be employed in the personalization of the services. In [2] a framework for the initialization of student models in Web-based educational applications is presented. The basic idea of the proposal is to set initial values for all aspects of student models using an innovative combination of stereotypes and the distance weighted k-nearest neighbour algorithm. In particular, a student is first assigned to a stereotype category concerning his knowledge level of the domain being taught. Then, the model of a new student is initialized by applying the distance weighted k-nearest neighbour algorithm among the students that belong to the same stereotype category as the new student. In [3] cognitive styles, levels of expertise and gender differences are examined in the stereotype building process and three clustering techniques (k-means, hierarchical clustering and fuzzy clustering) are exploited to understand user behaviour and perception. In [4], machine learning approaches are scheduled to automatically acquire user stereotypes and communities from users'data. Specifically, unsupervised learning techniques on data containing user interests are used to infer user communities.","refs":[{"start":212,"end":215,"marker":"bibr","target":"#b0"},{"start":611,"end":614,"marker":"bibr","target":"#b1"},{"start":1239,"end":1242,"marker":"bibr","target":"#b2"},{"start":1502,"end":1505,"marker":"bibr","target":"#b3"}]},{"text":"All the works above reported assume that the data useful to build user stereotypes are acquired by means of a feedback provided by the users on the results or a questionnaire answered from the users about their interests. Differently, the approach presented in this paper proposes to exploit the knowledge that is extracted by the analysis of log interaction data, without requiring an explicit feedback from the user, in a cascaded unsupervised and supervised machine learning techniques to improve the set of user stereotypes.","refs":[]}]},{"title":"The Framework","paragraphs":[{"text":"The general framework we propose, depicted in Figure 1, is made up of a module aimed at creating a set of user classes, followed by a module devoted to generate, on these classes, a set of rules to be used for classifying the behaviour of new and unseen users. Specifically, it consists of an aggregation phase of the users for which an interaction log is provided, an induction phase trained on the general user data eventually obtained during the login phase and aimed at inferring rules to characterize new users, and finally an updating module to modify the feature values and confidences by means of statistical measurements.","refs":[{"start":53,"end":54,"marker":"figure","target":"#fig_0"}]},{"text":"In detail, the first module concerns the application of clustering techniques to identify similarities among users. Indeed, the aggregation of users that show a similar behaviour could be useful to better understand the conditions under which specific personalized services and interfaces of the system can be proposed to the users. Once clustering has taken place, for each cluster a set of rules is induced that will be able to identify relations between members of a same stereotypical class. Furthermore, on clustered data, a module based on statistical measurements computation is executed to update the definitions characterizing the stereotypical classes.","refs":[]}]},{"title":"The Stereotypes","paragraphs":[{"text":"The whole process is based on the idea of stereotype [5]. A stereotype is made up of a body (the characterizing component) and a trigger (the prediction component). The body represents the characteristics shared by all the users belonging to the stereotype. The trigger describes the pre-conditions to be satisfied by a user in order to be assigned to a stereotype. Specifically, the trigger will contain the expert-coded rules that are able to assign a user to one or more stereotypes with a probability estimation of the membership, while the body is made up of the features characterizing the stereotype, their values and relative confidence. Formally:","refs":[{"start":53,"end":56,"marker":"bibr","target":"#b4"}]},{"text":"• a stereotype is a pair S = (B, T ) where B represents the body and T represents the trigger; • a trigger is a pair T = (P, C) where P is the pre-condition (a proposition or rule) allowing the assignment of the stereotype to a user and C is the confidence with which the membership is assessed; • a body is a set of triples B = {(F, V, R)} where F is the feature (or facet ) describing a property of the stereotype, V is the related value and R is the confidence of having value V for feature F .","refs":[]},{"text":"The static profile of a user, i.e. its membership to one or more stereotypes, is obtained by means of a matching process aimed at predicting the user preferences and the way of interaction. The matching is performed between the initial user features (e.g. age, sex, work, education, handicap, etc.) and a set of fixed (and expert-defined) stereotypes describing the main user classes (e,g, gender, education, job, etc.). Specifically, the matching is performed by means of a set of activation rules encoded by an expert (and contained in the trigger component of the stereotype) that will activate the association of a stereotype to one or more users, and of a user to one or more stereotypes. In the latter case, each of the fired stereotypes is to be interpreted as a partial model of the user: multiple stereotypes could be fired and, consequently, combined in order to provide a complete model for the user. Specifically, according to the stereotype combination proposed in [5], the following formulations are used to evaluate the value and confidence of features in the user profile:","refs":[{"start":978,"end":981,"marker":"bibr","target":"#b4"}]},{"text":"if only one stereotype was activated, or the value V j of a feature F j is defined in only one of the activated stereotypes:","refs":[]},{"text":"then the confidence userR j of having value V j for feature F j to be assigned to the user profile is obtained as:","refs":[]},{"text":"if n stereotypes were activated, all assigning the same value V j to feature","refs":[]},{"text":"then the confidence userR j of having value V j for feature F j for the user profile is obtained as:","refs":[]},{"text":"if there were n stereotypes activated, assigning different values V j to feature F j -say the set of values for feature","refs":[]},{"text":". . , n} -then for each different value of V ji corresponding to feature F j the confidence userR ji is computed according to equation (2) above reported. Then the value V j of feature F j to be assigned to the user profile is chosen as the one to which corresponds the maximum confidence value, i.e. max(userR ji ), while the associated confidence in the user profile userR j is","refs":[]},{"text":"where R agree is the confidence of the stereotypes that contain the chosen value V j for feature F j and R -agree is the confidence of the stereotypes that contain a different value than V j for feature F j .","refs":[]}]},{"title":"Automatic Improvement of the Set of Stereotypes","paragraphs":[{"text":"The problem of the user stereotypes resides in the fact that they are manually built by the personal experience of a domain expert in both the trigger and body components. To overcome such a limitation an automatic procedure, able to generate new and/or modify existing stereotypes exploiting user log interactions with the system, would be desirable. As reported in [6], new stereotypes must be generated by considering long term user features, i.e. features that do not change frequently over time, while short term user features have to be considered in the specialization of the stereotype for a specific user. Furthermore, if the user is not new to the system, a set of user logs, that were collected in the previous user interactions, is available. Thus, the value and confidence of the features in his profile could be automatically modified and, more importantly, new stereotypes can be automatically built. Specifically, according to the above distinction of the set of the features in two distinct types, two steps can be identified in the user model building process: firstly, the user long term features can be used to generate a generic user model stereotype and, subsequently, one can continue by exploiting short term features to improve and personalize it.","refs":[{"start":367,"end":370,"marker":"bibr","target":"#b5"}]},{"text":"As a consequence, also the machine learning techniques to be exploited in the user model stereotype construction must be properly selected with respect to the two kinds of available information. Thus, two distinct learning steps have to be planned: in the former, the general data about the users will be used to group and identify stereotypical classes of users not yet considered. Subsequently, the data about the users belonging to each of the groups that were identified in the previous step will be used as training examples to infer rules that will make up the trigger component of the new discovered stereotypes in order to determine how to assign the new users to them. To this aim, hierarchical clustering [7] and decision trees [8] were exploited. Such techniques have the advantage to be robust with respect to the uncertainty in the data and, in some versions, they are able to deal with incremental availability of data, both fundamental characteristics in this domain.","refs":[{"start":715,"end":718,"marker":"bibr","target":"#b6"},{"start":738,"end":741,"marker":"bibr","target":"#b7"}]},{"text":"Once the new classes of stereotypes are conceptually defined (by means of clustering step) along with the trigger components (by means of rule induction step), the feature values and the associated confidence, that are reported in the user logs, can be used to modify the body component of the new stereotypes, this way allowing to assign such values and confidence to the new users. Specifically, the user logs will be used as background knowledge and a set of statistical measures were identified to update the values along with the confidence of the features. As regards the values of the features, the mean of the values was used. Specifically, let n be the number of users already known to the system that have value V j for feature F j , and m be the number of new users (u 1 , u 2 , . . . , u m ) for which the available stereotypes assign respectively values (a j1 , a j2 , . . . , a jm ) to feature F j . The updated value V j of feature F j is as follows:","refs":[]},{"text":"As to the relative confidence R j for feature F j , we suppose that it is inversely related to variance: a greater variance corresponds to a lower confidence in that value, and vice versa. Accordingly, the following rule was designed to update the confidence value R j :","refs":[]},{"text":"where σ and σ represent the standard deviation of the values of the n known users before the update and of the values of the m new users after the update, respectively. The underlying idea is that a variance on the new users greater than that on the previous ones will contribute to reduce the confidence level, and on the contrary a variance on the new users lower than that on the previous ones will contribute to increase the confidence level. Indeed, σ j /V j and σ j /V j correspond to the percentage of variability with respect to the mean values of the known and new users. α represents a weight of how much the difference between the known and new values has to be considered in confidence updating, by magnifying or softening it. This formulation was improved so that the weight of the two terms is in relation with the number of cases (number of known and new users) that the term represents. The new formulation is as follows:","refs":[]}]},{"title":"An Exploitation Scenario","paragraphs":[{"text":"Let us now better explain the use of the framework components in a typical scenario. When a user connect to the system, it can occur two cases: he is a new user or not. In our setting, the profile can be built on user generalities, eventually acquired by means of a preliminary registration phase, and on information gathered from an eventually performed psycho-attitudinal test, purposely designed with a domain expert, aimed at characterizing the user profile with specific ability values and confidence. It is worth to note that this information is required once for the user and that the user, however, cannot accept to answer. Suppose to have a new user, then he has three possibility after login: 1) he can register by filling a questionnaire with his generalities (age, sex, work, education, handicap, etc.); 2) he can provide his generalities and perform a specific test defined by the experts in order to improve the personal profile; or 3) he can register by providing only name/surname -that is equal to not provide any information. In the first case, the generalities provided by the user are used as knowledge base to activate one or more stereotypes from the set of available stereotypes (both initially provided by the expert and automatically built) that are successively combined according to the combination rules reported in Section 3.1 to generate the initial user profile. In the second case, the information gathered by the results of the performed test are used to fill in the facets' value and confidence in the user profile. Finally, in case of absence of any kind of information at the login phase, a general stereotype (such as a any person stereotype) is assigned to the user and his profile is filled in with default values as setted in the system. Then, the user is let to interact with the system and as soon as a set of log is available, they will be exploited according to the procedure reported in Section 3.2 to modify his profile. On the other hand, in case of a not new user his interaction log are used to improve his profile according to the procedure reported in Section 3.2.","refs":[]},{"text":"In our simulation scenario, each user is represented by two sets of information items: general user data (such as age, sex, job, language, education, job) that are used to provide a value to the trigger component of the stereotypes and to assign a user to one or more stereotypes; and a set of features chosen in such a way that could be used to profile user attitudes in a multimedia environment. In particular, the chosen features are:","refs":[]},{"text":"textual/audio/video/image cognitive ability: how many texts/audio/videos/ images the user is able to acquire; useful to understand the preference of the user with respect to the textual/audio/video/image information; -symbolic/pointing/spoken expressive ability: agreeableness level of the symbolic/pointing/spoken modality in performing queries; -motor ability: estimation of the motor ability of the user; -multi-modal ability: estimation of the multi-modal ability of the user; -work task: estimation of the goal of the user in performing the task. This feature is useful to better understand the level of detail and the amount of information to provide to the user for the specific query. Figure 2 reports an example of the initial static female stereotype. The facets' values and relative confidence are filled with default parameters as provided by the domain expert. However, as above reported, they can be computed according to the real user profile if the psycho-attitudinal test results are available. In this way, a specific ability level for that category of users can be suggest. As to the machine learning techniques, we exploited the incremental concept clustering algorithm COBWEB [7] and the decision tree learner C4.5 [9]. COBWEB works by incrementally arranging the observations in a classification hierarchy. Each node represents a concept (a class) and is labelled with a probability value that provides a distribution of the values and associated confidence of the features in the body component for the objects that belong to that node. It exploits the following operators to build the classification hierarchy: Merge of two nodes (two nodes are replaced by a node that has as child a node coming from the union of the two nodes and that has as distribution the distribution of the values of the attributes of the objects belonging to the two nodes); Split of a node (a node is split by replacing it with its children); Insertion of a new node (a new node is added for each new object to be inserted in the hierarchy); Shift of an object in the hierarchy (the sub-hierarchy having the object as root is shifted in the node). C4.5 builds decision trees starting from a set of labelled attribute-value training examples exploiting the concept of entropy. It uses the information gain on each feature to set a shifting point of the set of data in sets of lower cardinality. The algorithm proceeds iteratively on the subset thus obtained. These algorithms were applied to the user general data in order to obtain a classifier that can characterize each new user and assign him to the appropriate stereotypical class. Successively, the features, their value and the associated confidence of the user belonging to a class were used to process the new values and confidences for the discovered stereotypes according to the statistical measures reported in previous section. Specifically, the trigger components of the new stereotype are the result of the learning phase, while the body components are the result of the statistical measurements on the clustered data.","refs":[{"start":700,"end":701,"marker":"figure","target":"#fig_1"},{"start":1197,"end":1200,"marker":"bibr","target":"#b6"},{"start":1236,"end":1239,"marker":"bibr","target":"#b8"}]},{"text":"To test the proposal, we generated two artificial datasets. The examples were generated by simulating the interaction of the users with the system. Specifically, firstly a specific pattern was established to represent different categories of users and successively, on this pattern, the generation of simulated user interaction started randomly choosing other attribute values. In the first experiment, we generate examples from two user pattern interactions representing generic male and female users. In the second experiment, the intent was to model users that interact with the system for different reasons: work or hobby. In the following the results, i.e. the identified stereotypes along with the trigger and body components, are reported for the two experiments.","refs":[]},{"text":"For the first experiment, on 9980 training data, two clusters (stereotypical classes) were identified along with the trigger and body components. As to the trigger component, the identified stereotypical classes differentiate correctly the users in two groups (men and women) with almost the same ability level for the features provided. (multi-modal ability,0.5,0.5).","refs":[]},{"text":"(work task,0.5,0.5).","refs":[]},{"text":"In the second experiment, on 21358 training data, four clusters (stereotypical classes) were identified. In this case, the trigger component turns out to be more complex compared to the previous experiment. Indeed, it correctly grasps the user profile we represented, i.e. it contains the rule that identifies the kind of task the user performs. However, other specializations for the users that interact with the system for hobby were extracted. For example, one of the trigger rules is: \"the user is a man interacting for hobby with the system in italian language\". ","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"In order for a digital library to be defined adaptive, it must adapt the services it provides to the users, i.e. it should provide users with optimized service/access according to particular needs of individual users or groups of users. A key issue to reach this kind of adaptivity is personalization. An approach already exploited in the personalization task is based on the idea of stereotype.","refs":[]},{"text":"Usually stereotypes are built manually by the personal experience of a domain expert and this can represent a limitation. To overcome the problem, in this","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Users of Digital libraries require more intelligent interaction functionality to satisfy their needs. In this perspective, the most important features are flexibility and capability of adapting these functionalities to specific users. However, the main problem of current systems is their inability to support different needs of individual users due both to their inability to identify those needs, and, more importantly, to insufficient mapping of those needs to the available resources/services. The approaches considered in this paper to tackle such problems concern the use of Machine Learning techniques to adapt the set of user stereotypes with the aim of modelling user interests and behaviour in order to provide the most suitable service. A purposely designed simulation scenario was exploited to show the applicability of the proposal.","refs":[]}]}}