{"bibliography":{"title":"Digital Stacks: Turning a Current Prototype into an Operational Service","authors":[{"person_name":{"surname":"Bergamin","first_name":"Giovanni"},"affiliations":[{"department":null,"institution":"Biblioteca Nazionale Marciana","laboratory":null}],"email":"giovanni.bergamin@bncf.firenze.sbn.it"},{"person_name":{"surname":"Messina","first_name":"Maurizio"},"affiliations":[{"department":null,"institution":"Biblioteca Nazionale Marciana","laboratory":null}],"email":"messina@marciana.venezia.sbn.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{},"sections":[{"title":"Introduction","paragraphs":[{"text":"The Digital Stacks project aims to set up a prototype of a long term digital preservation system for electronic documents published in Italy and made public via digital communication network, according to the legal deposit law (L. 106/2004, DPR  252/2006). The project was originally established in 2006 by the Fondazione Rinascimento Digitale, by the Biblioteca Nazionale Centrale di Firenze and by the Biblioteca Nazionale Centrale di Roma.","refs":[]},{"text":"The first part of this presentation will take into account the technical architecture of Digital Stacks but, of course, it is well known that digital preservation is more than just a technical process. Strategies to avoid bit loss or to prevent hardware and software dependencies are only a part of the issue. Digital Stacks of course have to deal with other problems, including economic implications (sustainability), selection problems (what is important to preserve for future generations), legal aspects, cooperation between legal deposit institutions1 . Some of these aspects will be addressed in the second part of the presentation.","refs":[{"start":555,"end":556,"marker":null,"target":"#foot_0"}]},{"text":"For the purposes of the project, Digital Preservation could be defined as a public service to be provided by trusted digital repositories in order to ensure for deposited digital resources viability, \"renderability\", authenticity and availability for designated communities2 .","refs":[{"start":273,"end":274,"marker":null,"target":"#foot_1"}]},{"text":"The name of the project recalls the stacks of the legal deposit libraries. As stated by a historical European project on digital preservation (NEDLIB)3 : \"For us, as memory organizations, this means we have to move from paper-based stacks to digital stacks\".","refs":[{"start":150,"end":151,"marker":null,"target":"#foot_2"}]},{"text":"In other words the name of the project Digital Stacks intentionally recalls the term used to refer to the stacks of legal deposit libraries.","refs":[]},{"text":"In most aspects digital stacks are comparable to conventional ones: digital resources must be preserved for the long term; digital stacks grow as new resources are added; modification and deletion is not an option; it is impossible to predict the usage frequency of stored digital resources; and it is likely that some resources will be seldom or never be used4 .","refs":[{"start":360,"end":361,"marker":null,"target":"#foot_3"}]},{"text":"It is worth noting that nine years later, a search query for \"Digital stacks\" on Google will return the same expression used within the context of digital preservation: \"Digital stacks: rather than boxes, shelves, and climate controlled environments, digital information must be stored in containers, file systems, and secure servers\"5 .","refs":[{"start":334,"end":335,"marker":null,"target":"#foot_4"}]}]},{"title":"Technical Architecture","paragraphs":[{"text":"The aim of the project was to set up an infrastructure based on a long term framework. Taking into account the fact that component failures are the norm rather than the exception6 , the infrastructure is based on data replication (different machines located in different sites) and on simple and widespread hardware components, non vendordependent, which can easily be replaced (in other words simple personal computers).","refs":[{"start":178,"end":179,"marker":null,"target":"#foot_5"}]},{"text":"The infrastructure does not rely on custom or proprietary software but is based on an open source operating system and utilities (widespread acceptance means less dependencies). b) Luciana Duranti, Un quadro teorico per le politiche, le strategie e gli standards di conservazione digitale: la prospettiva concettuale di InterPARES, <<Bibliotime>>, 9(2006), 1 http://didattica.spbo.unibo.it/bibliotime/num-ix-1/duranti.htm (to assess the authenticity of a digital resource, the public service must be able to establish its identity and demonstrate its integrity) c) PREMIS 2.0, 2008 , PREsevation Metadata: Implementation Strategies, http://www.loc.gov/standards/premis/ (for the concepts of \"Viability: Property of being readable from media\" and \"Renderability\" \"Render: To make -[by the means of a computer] -a Digital Object perceptible to a user, by displaying (for visual materials), playing (for audio materials), or other means appropriate to the Format of the Digital Object\"). d) OAIS. Reference model for an Open Archival Information System, ISO 14721:2003 (for the concept of archive and designated community: \"an organization that intends to preserve information for access and use by a designated community)","refs":[]},{"text":"Nowadays an ordinary personal computer could easily store up to 8 TB (equipped with four 2000 GB hard disks) using widespread and inexpensive SATA 7 technology Data replication relies on open source disk synchronization utility (rsync 8 ); to avoid hardware dependencies, ex. g. disk controllers, RAID 9 is not used.","refs":[]},{"text":"It is worth noting that in the passage from prototype to service we changed the Dark Archive architecture. In this site the original plan was to use an offline storage system (ex. g. LTO 10 tapes). However for the operational service we decided to use the same technology used in the two \"light archives\" (i. e. online storage using just simple personal computers). Note that the use of the term online does not change the purpose of the dark archive that is \"to function as a repository for information that can be used as a fail-safe during disaster recovery 11 \".","refs":[]},{"text":"Even though LTO is a robust and reliable solution, it introduces technology dependencies,ex. g. \"robots\", and media management problems. For the same reasons we decided not to use a HSM 12 (Hierarchical storage management) system, since their different implementation is based on proprietary systems.","refs":[]},{"text":"Comparing all the costs of online and offline storage is not an easy task. For instance regarding SATA disks we can say that their cost is decreasing day by day while their capacity is increasing, but it is difficult to estimate the so called total cost of ownership of a tape based solution 13 . Taking into account all the pros and cons, we concluded that the most convenient solution is online storage on simple and easily replaceable personal computers (\"easily replaceable\" means replaceable with no or minor impact on the overall architecture).","refs":[{"start":292,"end":294,"marker":"bibr","target":null}]},{"text":"The only drawback to this approach is in fact an ecological problem: the power consumption of the storage computers and the carbon dioxide emissions. However in recent years \"green computer\" technology (i. e. more energy-efficient versions of computers) is gaining widespread market awareness. Moreover the Solid State Drive (SSD) 14 is a rapidly developing technology and this solution could significantly reduce the energy consumption of the storage computers in the near future.","refs":[]},{"text":"The current Digital Stacks prototype is now turning into an operational service based on two main deposit sites (managed by the Biblioteca Nazionale Centrale di Firenze and by the Biblioteca Nazionale Centrale di Roma) and a dark archive (managed by the Biblioteca Nazionale Marciana). Of course the Fondazione Rinascimento Digitale will continue to support and promote the Digital Stacks operational service.","refs":[]},{"text":"Each main site is composed of a set of autonomous and independent nodes. In turn each node on a given site has a mirror node on the other site: the Digital Stacks service does not rely on \"master site / mirror site\" architecture and each site will contain, in a symmetrical way, both master nodes and mirror nodes (see Figure 1). Each physical file is replicated twice on different computers within the same node. The dark archive also contains two copies of this file on two different computers. As a result within Digital Stacks each physical file is replicated six times.","refs":[{"start":326,"end":327,"marker":"figure","target":null}]}]},{"title":"Fig. 1. Digital Stacks technical architecture overview","paragraphs":[{"text":"Setting up one main site in Florence close to the Arno river and the Dark Archive in Venice with the well known \"acqua alta\" (or high tide) problem, could result in a relevant threat for the security of the overall service. One important decision was to locate all the hardware at an external data center (or collocation center15 ).","refs":[{"start":327,"end":329,"marker":null,"target":"#foot_6"}]},{"text":"Certification to ISO 2700116 international security standard will be the basic prerequisite for the selection of a data center. Each institution (Florence, Rome and Venice) will select three different data centers owned and managed by three different companies (to reduce the risk of \"domino\" effects).","refs":[{"start":26,"end":28,"marker":null,"target":"#foot_7"}]},{"text":"Moreover we decided that the three collocation centers have to be distant from each other by at least 200 km (to reduce the risk of natural threats). This architecture based on certification to ISO 27001 international security standard will form the basis for a domain specific certification of Digital Stacks as trusted digital repository (during the prototype phase we tried to apply DRAMBORA17 but also TRAC18 was taken into account).","refs":[{"start":394,"end":396,"marker":null,"target":"#foot_8"},{"start":410,"end":412,"marker":null,"target":"#foot_9"}]}]},{"title":"Metadata","paragraphs":[{"text":"The Digital Stacks core is quite simple. Digital Stacks could ingest two kinds of files: data wrapped in WARC containers: a WARC (ISO 28500) container aggregates digital objects for ease of storage in a conventional file system 19 . metadata wrapped in MPEG21-DIDL containers20 : MPEG21-DIDL (ISO 21000) is a simple and agnostic container suitable for the representation of digital resources (sets of metadata conformant to different schemas).","refs":[{"start":228,"end":230,"marker":"bibr","target":null},{"start":275,"end":277,"marker":null,"target":"#foot_11"}]},{"text":"To conclude this first part it is worth noting that Digital Stacks within this architecture has to face the metadata management problem (also known as \"lake or river model\" 21 ).","refs":[]},{"text":"A long term archive can not rely on the \"lake model\" (stores of metadata based on few schemas and fed by a few principal sources). A long term archive has to face stores of metadata based on schemas 22 that can change over time and which are fed by many streams. It could only be based only on a \"river model\".","refs":[]},{"text":"In a long term archive there will be different metadata schemas originating from, using the PREMIS language, different agents (ex. g. OAI-PMH metadata harvesters, metadata extractors like JHOVE, librarians, etc). Every schema is subject to change over time. Semantic overlap elements belonging to different schemas (ex. g. PREMIS, MIX) will probably be the norm rather than the exception.","refs":[]},{"text":"Since metadata are the only mean for controlling data it is essential to control metadata to avoid the risk of the \"Babel model\". We are currently working on that by taking into account the fact that there are no tools available. The are some interesting directions: crosswalks like MORFROM 23 (demonstration OCLC web service, limited to bibliographic metadata) and Dspace future plans (\"HP and MIT also have a research project called SIMILE that is investigating how to support arbitrary metadata schemas using RDF24 \"). This is not an easy project: incidentally it seems that the web site of the project is no longer being updated.","refs":[{"start":515,"end":517,"marker":null,"target":"#foot_13"}]}]},{"title":"Legal Framework and Service Model","paragraphs":[{"text":"The second part of the presentation concerns both the legal and agreements framework of the project and the service model we propose.","refs":[]},{"text":"The most recent Italian law on legal deposit (L. 106/2004, DPR 252/2006) provides for a trial period for legal deposit on a voluntary basis of electronic documents, which are defined by the law as \"documents disseminated via digital communication network\". This legislation can be regarded as a strong commitment for national libraries to set up the foundations of a Digital Preservation Network that could, on the basis of the results of the trial period or just for specific components, also encompass electronic resources of other domains, different from those of the libraries. As it is well known, the \"commitment\" is one of the requirements of a trusted digital repository 25 .","refs":[{"start":679,"end":681,"marker":"bibr","target":null}]},{"text":"The test is funded by MiBAC, General Direction for Libraries; the Fondazione Rinascimento Digitale (FRD) will support the project with human and financial resources, as with the former project Magazzini digitali. As stated, the test will be carried out by the National Library of Florence (BNCF) and the National Library of Rome (BNCR), as main sites for preservation and access, and the Marciana National Library of Venice (BNM), which will act as an off-line dark archive for preservation purposes and redundancy, but not for public access. We would like to point out here the following three main goals:","refs":[]},{"text":"• To implement an organizational model suitable for creating the national and regional archives of electronic publishing production, as provided by the law, and for being extended on a larger scale; • To implement a service model suitable for balancing the right-holders interests in the protection of contents with the final users interests in accessing the contents; • To implement a system suitable for ensuring long term preservation and access to digital contents, as well as their authenticity (identity and integrity).","refs":[]},{"text":"In order to achieve these goals a legal and agreements framework is needed, also for balancing different interests of all the involved stakeholders:","refs":[]},{"text":"• An agreement between the three MiBAC libraries and the FRD, in order to set specific roles and responsibilities of each institution from different points of view: scientific, technical, operational and financial, and to set up a steering committee for all management, monitoring and results assessment activities. It will also be of utmost importance to define an organizational and financial sustainability plan, after the 36 months trial period. The signature of this agreement is underway just in these days; • An agreement about the access to and the use of legal deposit digital contents, to be signed between the three National Libraries and each electronic publisher (or electronic content provider) joining the test. The current Italian legislation (Art. 38, paragraph 2, DPR 3 may 2006, n. 252) provides for a free access via computer net to legal deposit documents that are originally freely accessible on the net and an access restricted to registered users inside the deposit institutions premises to the documents whose access is originally subject to a license. In both cases the copyright law must be adhered to. The agreement should provide for the following points:","refs":[]},{"text":"• BNCF and BNCR will periodically harvest the agreed publisher's electronic documents (harvesting is the cheaper and easier way of feeding the archive, also from the publishers' point of view, provided that copyright is adhered to); • In the case of license subject documents, the publisher will provide the libraries with all the necessary clearances, and the file formats will also be agreed (WARC etc); • Documents will be stored in multiple copies in BNCF and BNCR, and off-line in BNM; the libraries will be allowed to store the documents in ISO 27001 certified external data centers;","refs":[]},{"text":"• Digital archives will be ISO 14721-2003 OAIS compliant, and will be certified as trusted; • BNCF, BNCR and BNM will ensure long term preservation and access of the deposited documents, and will track any changes in the same documents;","refs":[]},{"text":"• BNCF, BNCR and BNM will be allowed to perform any necessary actions (refreshing, duplication, migration etc) in order to achieve long term preservation and access of the deposited documents; • Only registered users will be allowed to access and consult the documents subject to license on multiple workstations (without printers and USB-ports) on the Local Area Networks of BNCF and BNCR; all user actions will be tracked;","refs":[]},{"text":"• Files printing and/or downloading will be subject to specific agreements, a compensation system for right-holders will be provided for if necessary (e.g. for protected documents not available on the publisher's web site); • Access and consultation will also be allowed to regional deposit libraries, in the same way, but only to deposited documents of those publishers whose registered office is in the same region of the deposit library (this could be a critical point to agree upon, but it is in line with the law and with the Italian tradition of legal deposit of analogical material) .","refs":[]},{"text":"To the purpose of extending the test-basis, the project will take the following main types of electronic resources into account:","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The presentation outlines the Digital Stacks project, whose aim is to set up a prototype of a long term digital preservation system for electronic documents published in Italy and made public via digital communication network, according to the legal deposit law. In the first part the technical architecture and the metadata management problems are outlined; the second part concerns the legal and agreements framework of the project, the organizational model and the service model. Also the sustainability issue is briefly addressed.","refs":[]}]}}