{"bibliography":{"title":"Toward an Audio Digital Library 2.0: Smash, a Social Music Archive of SHellac Phonographic Discs","authors":[{"person_name":{"surname":"Canazza","first_name":"Sergio"},"affiliations":[{"department":"Dep. of Information Engineering","institution":"University of Padova","laboratory":null},{"department":"Sound and Music Computing Group Via Gradenigo","institution":null,"laboratory":null}],"email":"canazza@dei.unipd.it"},{"person_name":{"surname":"Dattolo","first_name":"Antonina"},"affiliations":[{"department":"Dep. of Mathematics and Computer Science Via delle Scienze","institution":"University of Udine","laboratory":null}],"email":"antonina.dattolo@uniud.itwww.dimi.uniud.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"Noise and Representation Systems: A Comparison among Audio Restoration Algorithms","authors":[{"person_name":{"surname":"Canazza","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"Lulu Enterprise","journal":null,"series":null,"scope":null},"b1":{"title":"The Digital Library Manifesto","authors":[{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Ioannidis","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Koutrika","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Ross","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Schek","first_name":"H.-J"},"affiliations":[],"email":null},{"person_name":{"surname":"Schuldt","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Semantic tools for accessing, analysing, and extracting information from user generated contents: open issues and challenges","authors":[{"person_name":{"surname":"Casoto","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Dattolo","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Pudota","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Omero","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Tasso","first_name":"C"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":"Handbook of Research on Web","series":null,"scope":{"volume":2,"pages":{"from_page":3,"to_page":3}}},"b3":{"title":"X.0: Technologies, Business and Social Applications","authors":[],"date":{"year":"2009","month":"10","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Optical retrieval and storage of analog sound recordings","authors":[{"person_name":{"surname":"Cavaglieri","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Johnsen","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Bapst","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2001","month":"10","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Preservation of audio in folk heritage collections in crisis","authors":[{"person_name":{"surname":"Cohen","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":65,"to_page":82}}},"b6":{"title":"Reconstruction of recorded sound from an edison cylinder using three-dimensional non-contact optical surface metrology","authors":[{"person_name":{"surname":"Fadeyev","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Haber","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Maul","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Mcbride","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Golden","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Audio Eng. Soc","series":null,"scope":{"volume":53,"pages":{"from_page":485,"to_page":508}}},"b7":{"title":"Reconstruction of mechanically recorded sound by image processing","authors":[{"person_name":{"surname":"Fedeyev","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Haber","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Audio Engineering Society","series":null,"scope":{"volume":51,"pages":{"from_page":1172,"to_page":1185}}},"b8":{"title":"Data Analysis Techniques for High Energy Physics","authors":[{"person_name":{"surname":"Fruhwirth","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Regler","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Bock","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Grote","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Notz","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2000","month":"08","day":null},"ids":null,"target":null,"publisher":"Cambridge University Press","journal":null,"series":null,"scope":null},"b9":{"title":"CD-ROM Bi-lingual: English/French/Spanish","authors":[],"date":{"year":"2000","month":null,"day":null},"ids":null,"target":null,"publisher":"French Ministry of Culture and Communication","journal":null,"series":null,"scope":null},"b10":{"title":"Semi-automatic metadata extraction from shellac and vinyl disc","authors":[{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Snidaro","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Canazza","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"An optical turntable","authors":[{"person_name":{"surname":"Resumé","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"1986","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"The ethics of preservation, restoration, and re-issues of historical sound recordings","authors":[{"person_name":{"surname":"Schüller","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"1991","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Audio Engineering Society","series":null,"scope":{"volume":39,"pages":{"from_page":1014,"to_page":1016}}},"b13":{"title":"Why digitize?","authors":[{"person_name":{"surname":"Smith","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1999","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The availability of digital archives and libraries on the Web represents a fundamental impulse for cultural and didactic development. Guaranteeing an easy and ample dissemination of the music culture of our times is an act of democracy that must be assured to future generations: the creation of new tools for the acquisition, the preservation, and the transmission of information is nowadays a key challenge for international archives and libraries communities [3]. Scholars and the general public have begun paying greater attention to the recordings of artistic events, but the systematic preservation and consultation of these documents are complicated by their diversified nature; in fact, the data contained in the recordings offer a multitude of information on their artistic and cultural life, that goes beyond the audio signal itself. From the first recording on paper, made in 1860 (by Édouard-Léon Scott de Martinville \"Au Clair de la Lune\" using his phonautograph1 ), until to the modern Blu-ray Disc, what we have in the audio carriers field today, is a Tower of Babel: a bunch of incompatible analog and digital approaches and carriers -paper, wire, wax cylinder, shellac disc, film, magnetic tape, vinyl record, magnetic and optical disc, to mention only the principal ones -without standard players able to read all of them. With time the reading of certain of those original documents has become difficult or even impossible. We know that some discs and cylinders are broken, that the resin in which the groove was engraved is sometimes dislocated, that the groove itself is often damaged by the styli of the heads of that age. It is worth noting that, in the Seventies/Eighties of 20th Century, expert associations (AES, NARA, ARSC) were still concerned about the use of digital recording technology and digital storage media for long-term preservation. They recommended re-recording of endangered materials on analogue magnetic tapes, because of: a) rapid change and improvement of the technology, and thus rapid obsolescence of hardware, digital format and storage media; b) lack of consensus regarding sample rate, bit depth and record format for sound archiving; c) questionable stability and durability of the storage media. The digitization was considered primarily a method of providing access to rare, endangered, or distant materials -not a permanent solution for preservation. Smith, still in 1999, suggested that digitization should be considered a means for access, not preservation -\"at least not yet\" [14].","refs":[{"start":462,"end":465,"marker":"bibr","target":"#b1"},{"start":975,"end":976,"marker":null,"target":"#foot_1"},{"start":2533,"end":2537,"marker":"bibr","target":"#b13"}]},{"text":"Nowadays, it is well-known that preserving carriers maintaining dedicated equipment for the ever growing numbers of formats in playable condition is hopeless, and the audio information stored in obsolete formats and carriers is in risk of disappearing. At the end of the 20th century, the traditional \"preserve the original\" paradigm shifted to the \"distribution is preservation\" [6] idea of digitizing the audio content and making it available using digital libraries technology.","refs":[{"start":380,"end":383,"marker":"bibr","target":"#b5"}]},{"text":"For these reasons, if, on the one hand, it is evident the importance of transferring into the digital domain (active preservation) a least carriers in risk of disappearing, respecting the indications of the international archivist community [1,13], on the other part, it became urgent to study and design new forms for organizing and sharing music archives, taking in account the radical revolution imposed by Web 2.0; in fact, the modalities in which people communicate, meet and share information have been strongly influenced by the wide popularity of user generated contents [4]: Facebook, YouTube, Wikipedia, Myspace are only some examples of widely known Web 2.0 applications.","refs":[{"start":241,"end":244,"marker":"bibr","target":null},{"start":244,"end":247,"marker":"bibr","target":"#b12"},{"start":579,"end":582,"marker":"bibr","target":"#b2"}]},{"text":"The rest of this introduction is organized in three subsections: the first (Subsection 1.1) is dedicated to discuss features and limitations of the current Web 2.0 applications in the music field; the second (Subsection 1.2) synthesizes the innovative aspects of the contribute presented in this paper; finally, the last (Subsection 1.2) describes the chosen application domain, that is represented by the shellac discs.","refs":[]}]},{"title":"Current Web 2.0 Applications in the Music Field","paragraphs":[{"text":"In the field of music, several communities, applications and services based on Web 2.0 perspective have been developed. They propose new modalities of social interaction both for music creation and fruition. Some open directories, such as All Things Web 2.0 (www.allthingsweb2.com), GO2WEB20 (go2web20.net), or Feedmyapp (feedmyapp.com), propose daily updated lists of them.","refs":[]},{"text":"Existing applications may be distinct, at least, in the following four macrocategories:","refs":[]},{"text":"-Sharing music. This typology of applications proposes online communities, allowing the users to share and promote free music and related news, broken down by genre, and ranked by community votes. Some examples are Bebo (www.bebo.com), or Laudr Underground Music (www.laudr.com). -Creating music. This typology of applications aims to create large collaborative databases, containing audio snippets, samples, recordings, bleeps, enabling the users to innovative forms of access, browsing and creation. Some of these applications, such as Freesound Project (www.freesound.org) focus only on sounds, while others, such as ccMixter (ccmixter.org), include also songs and compositions. In numerous of these applications, such as Amie street (amiestreet.com), musicians and fans can connect, share their videos/mp3s, promote live shows and to discover the latest up-and-coming music. -Analyzing the user's behavior. This typology of applications tracks how the users interact with music online everyday, and apply a set of metrics with different aims; among them, for example, NextBigSound (thenextbigsound.com) tracks the number of plays, views, fans, comments, and other key metrics for 700,000 artist profiles across major web properties like Facebook, MySpace, Last.fm, Twitter. The aim is to support professionals, such as agents, managers, artists or publicists, in the goal of understanding and increasing the online audience. Since the purchase decisions of a critical mass of consumers has moved online, NextBigSound accurately measures, reports, and uses the interaction to make decisions. -Recommending music. This typology of applications collects the music selection history of the users, and inferring from it the individual user tastes proposes new recommendations; on the basis of the user feedback on approval or disapproval of individual songs, the system calibrates the successive suggestions. Examples of music recommenders are Pandora (www.pandora.com), Last.fm (www.last.fm), and Discogs (short for discographies); this last is the largest online database of vinyl discs and one of the largest online databases of electronic music releases. In it, a user can rate the correctness and completeness of the full set of data for an existing resource, as assessed by the users who have been automatically determined, by an undisclosed algorithm, to be experienced and reliable enough to express their votes. An item's \"average\" vote is displayed with the resource's data.","refs":[]},{"text":"Notwithstanding the differences among the systems, all these services tend to divide users in two categories:","refs":[]},{"text":"the large group of music listeners, which mainly have the task of evaluating and recommending music; -the restricted group of the music content creators, which are required to have skills in the field of music composition or music performance.","refs":[]},{"text":"Currently, the large group of music listeners can generally browse the music by genre, artist or album, but rarely they can use music features automatically extracted from the audio. An interesting example in this direction is MusicSurfer2 , able to mimics humans in listening, understanding and recommending music. It automatically extracts descriptions related to instrumentation, rhythm and harmony. Together with complex similarity measures, the descriptions allow users to navigate on multimillion track music collections in a flexible, efficient, and truly personalized way. As a music similarity opinion engine it can also generate smart playlists. A lightweight version of the similarity engine is available for embedding in portable devices, such as iPods.","refs":[{"start":238,"end":239,"marker":null,"target":"#foot_2"}]}]},{"title":"Contribute of This Work","paragraphs":[{"text":"The analysis of the current Web 2.0 applications, dedicated to the music, highlights the presence of a large set of services, but also highlights a set of general limitations:","refs":[]},{"text":"1. current Web 2.0 applications do not provide users with features and metadata directly extracted from the audio signal; 2. the documentation, that a user owns, such as the cover or a photo of a disc, is not used by the system in order to automatically extract metadata; 3. a user cannot use these applications for listening his/her discs, or for comparing audio features.","refs":[]},{"text":"With the aim to face these limitations and propose innovative modalities of fruition and preservation, we are currently working on a large project, dedicated to the realization of a social music archive, named Smash (Social Music Archive of SHellac phonographic discs). In this paper, we focus our discussion on a specific component of Smash, called PoG (Photos Of Ghosts), created for reconstructing the audio signal from a still image of the surface of shellac phonographic discs. This activity represents an original contribute: in fact, although automatic text scanning and optical character recognition are in wide use at major libraries, yet, unlike texts, A/D transfer of historical sound recordings is often an invasive process.","refs":[]},{"text":"In PoG this process is not invasive, since it is based on a photo: we add, to the contextual information (such as still images of the covers, labels, possible annex, mirror of the discs), the still image of the shellac disc; PoG enables the user to listen the disc by using the photo, maintaining the link between the original real object (i.e. shellac disc) of his/her discography, the contextual information and the metadata included in the database record.","refs":[]},{"text":"We strongly believe that this is the only way to preserve the history of the document transmission.","refs":[]}]},{"title":"The Case Study Domain","paragraphs":[{"text":"We present some experimental results applying our approach to shellac discs. The shellac disc is a common audio mechanical carrier. In 1886-1901 the first engraved discs commercialized by Emile Berliner appeared, first in vertical grooves like phonographic cylinders, then in lateral grooves. Prior the appearance of magnetic tapes, radio broadcasting was recorded live on discs.","refs":[]},{"text":"The phonograph disc is composed of a spiral groove obtained by casting or by direct cutting, in which a sound signal is recorded in the shape of a lateral or vertical modulation, or both if stereophonic.","refs":[]},{"text":"The common factor with the mechanical carrier is the method of recording the information, which is obtained by means of a spiral groove obtained by casting or by direct cutting, in which a sound signal is recorded (either directly in the case of acoustic recordings or by electronic amplifiers) in the shape of a lateral or vertical modulation, or both if stereophonic. Mechanical carriers include: phonograph cylinders; coarse groove gramophone, instantaneous and vinyl discs.","refs":[]}]},{"title":"Shellac Discs","paragraphs":[{"text":"The Shellac disc is a common audio mechanical carrier. The common factor with the mechanical carrier is the method of recording the information, which is obtained by means of a groove cut into the surface by a stylus modulated by the sound, either directly in the case of acoustic recordings or by electronic amplifiers. Mechanical carriers include: phonograph cylinders; coarse groove gramophone, instantaneous and vinyl discs. Tab. 1 summarizes the typologies of these carriers [10]. There are more then 1,000,000 Shellac discs in the worldwide audio archives. They are very important because some of these discs contain music ever re-recorded (R&B, Jazz, Ethnic, Western classical, etc.). The paper is organized as follows: in Section 2 we discuss related work; in Section 3 we propose PoG, our system of audio data extraction, while in Section 4 we present some experimental results through two cases of study. Finally conclusion and future works end the paper.","refs":[{"start":480,"end":484,"marker":"bibr","target":"#b9"}]}]},{"title":"Related Work","paragraphs":[{"text":"Some phonographs are able to play gramophone records using a laser beam as the pickup (laser turntable) [12]; this playback system has the advantage of never physically touching the record during playback: the laser beam traces the signal undulations in the record, without friction. Unfortunately, the laser turntables are only constrained to the reflected laser spot and are very sensitive to the reflexion coefficient of the used part of the disc, and susceptible to damage and debris. In addiction the variation of the distance between the grooves allowing simultaneous reading of several grooves.","refs":[{"start":104,"end":108,"marker":"bibr","target":"#b11"}]},{"text":"Digital image processing techniques can be applied to the problem of extracting audio data from recorded grooves, acquired using an electronic camera or other imaging system. The images can be processed to extract the audio data. The audio signal can be determined by measurement of the horizontal path of the groove. Such an approach offers a way to provide non-contact reconstruction and may in principle sample any region of the groove, also in the case of a broken disc.","refs":[]},{"text":"These scanning methods have several advantages: a) delicate samples can be played without further damage; b) broken samples can be re-assembled virtually; c) the re-recording approach is independent from record material and format (wax, metal, shellac, acetates, etc.); d) effects of damage and debris (noise sources) can be reduced through image processing; e) scratched regions can be interpolated; f) discrete noise sources are resolved in the \"spatial domain\" where they originate rather than being an effect in the audio playback; g) dynamic effects of damage (skips, ringing) are absent; h) classic distortions (wow, flutter, tracking errors, etc.) are absent or removed as geometrical corrections; i) no mechanical method needed to follow the groove; j) they can be used for mass digitization.","refs":[]},{"text":"In the literature, there are some approaches to the use of image processing to reconstruct sound [5,8,7]; in general, they can be based on: Electronic Cameras (2D or horizontal only view, frame based); Confocal Scanning (3D or verti-cal+horizontal view, point based); Chromatic sensors (3D, point based); White Light Interferometry (3D, frame based).","refs":[{"start":97,"end":100,"marker":"bibr","target":"#b4"},{"start":100,"end":102,"marker":"bibr","target":"#b7"},{"start":102,"end":104,"marker":"bibr","target":"#b6"}]},{"text":"In [5] a high resolution analog picture of each side of the disk is shot. The film becomes an intermediate storage media. In order to listen to the sound, the picture is scanned using a high resolution circular scanner. The scanner is made by a glass turntable, a 2048-sensor CCD-linear camera is mounted on microscope lens above the glass. Light source located below the tray lightens the film by transparency.","refs":[{"start":3,"end":6,"marker":"bibr","target":"#b4"}]},{"text":"Fadeyev et al. [8] apply a methodology partially derived from long standing analysis methods used in high energy particle and nuclear physics to follow the trajectories of charged particles in magnetic fields using position sensitive radiation detectors [9]. The device usedis the \"Avant 400 Zip Smart Scope\" manufactured by Optical Gauging Products. It consists of a video zoom microscope and a precision X-Y table. The accuracy of motion in the X-Y (horizontal) plane over the distance L (mm) is (2.5 + L/125) microns. The video camera had a CCD 6.4 mm x 4.8 mm containing 768x494 pixels of dimension 8.4 x 9.8 microns. With appropriate lenses installed it imaged a field of view ranging between approximately 260 x 200 microns and 1400 x 1080 microns.","refs":[{"start":15,"end":18,"marker":"bibr","target":"#b7"},{"start":254,"end":257,"marker":"bibr","target":"#b8"}]},{"text":"Both the systems listed above are applied on shellac disc, both on mechanical and electric recordings. Although the high Signal to Noise Ration (SNR) of the audio signal extracted (more than 40 dB in a 78 rpm shellac disc), these techniques is not adapt in the case of typical european audio archive (they have small-medium dimension) because the hardware equipment is expensive.","refs":[]},{"text":"In [7] is presented a full three-dimensional (3D) measurement of the record surface; in this study the color-coded confocal imaging method is considered, in particular the model CHR150 probe, manufactured by STIL SA, is used. This probe is coupled to custom configured stage movement and read out through a computer. The stages are controlled by DC servo motors and read out by linear encoders. The linear stage resolution is 100 nanometers and the accuracy was 2 µm. This system get very interesting results in audio cylinder (both wax and amberol), but it needs several hours for scanning. Summarizing, it can be used for saving selected records, not for a mass saving.","refs":[{"start":3,"end":6,"marker":"bibr","target":"#b6"}]}]},{"title":"Audio Data Extraction: Photos of GHOSTS (PoG)","paragraphs":[{"text":"Photos of Grooves and HOles, Supporting Tracks Separation (Photos of GHO-STS or simply PoG) [11] is the system proposed in this work; it is distinguished by its following features:","refs":[{"start":92,"end":96,"marker":"bibr","target":"#b10"}]},{"text":"is able to recognize different rpm and to perform tracks separation automatically; -does not require human intervention; -works with low-cost hardware; -is robust with respect to dust and scratches; -outputs de-noised and de-wowed audio, by means of novel restoration algorithms.","refs":[]},{"text":"The user can choose to apply an equalization curve among the hundreds stored in the system, each one with appropriated references (date, company, roll-off, turnover).","refs":[]},{"text":"The software automatically finds the disc centre and radius from the scanned data, using instruments developed in the consolidated literature on iris detection [11], for groove rectification and for tracks separation. Starting from the light intensity curve of the pixels in the scanned image, the groove is modeled and the audio samples are obtained [2]. The complete process is depicted in Fig. 1.","refs":[{"start":160,"end":164,"marker":"bibr","target":"#b10"},{"start":351,"end":354,"marker":"bibr","target":"#b0"},{"start":397,"end":398,"marker":"figure","target":null}]}]},{"title":"Fig. 1. Photos of GHOSTS schema","paragraphs":[{"text":"In particular, the system includes:","refs":[]},{"text":"1. An innovative de-noise algorithm in a frequency domain [2] based on the use of a suppression rule, which considers the psychoacoustics masking effect. The spreading thresholds which present the original signal x(n) are not known a priori and are to be calculated. This estimation can be obtained by applying a noise reduction STSA standard technique leading to an estimate of x(n)in the frequency domain; the relative masking thresholds m k , defined as the non negative threshold under which the listener does not perceive an additional noise, can be calculated by using an appropriate psychoacoustic model. The obtained masking effect is incorporated into one of the EMSR technique [2], taking into consideration the masking thresholds m k for each k frequency of the STFT transform. Then is created a cost function depending on m k : its minimization gives the suppression rule for the noise reduction. This cost function can be a particularization of the mean square deviation to include the masking thresholds, under which the cost of an error is equal to zero. 2. Unlike the methods listed in Sec. 2, 225 different equalization curves, which cover almost all the electric recordings, since 1925.","refs":[{"start":58,"end":61,"marker":"bibr","target":"#b0"},{"start":687,"end":690,"marker":"bibr","target":"#b0"}]},{"text":"3. The design and the realization of ad-hoc prototype of a customized (very) low-cost scanner device; it is equipped with a rotating lamp carriage in order to position every sector with the optimal alignment relative to the lamp (coaxially incident light). In this way we improved (from experimental results: more than 20%) the accuracy of the groove tracking step.","refs":[]},{"text":"PoG may form the basis of a strategy for: a) large scale A/D transfer of mechanical recordings, retaining maximal information (2D or 3D model of the grooves) about the native carrier; b) small scale A/D transfer processes, where there are not sufficient resources (trained personnel and/or high-end equipments) for a traditional transfer by means of turntables and converters; c) the active preservation of carriers with heavy degradation (breakage, flaking, exudation).","refs":[]}]},{"title":"Experimental Results","paragraphs":[{"text":"In this section we present our experimental results of applying the above described technique related to audio data extraction. We conducted a series of experiments with real usage data from different international audio archives. A number of examples generated by the method described in this paper is available at: avires.dimi.uniud.it/tmp/DL/Experimental_Results.html As case study, we selected the 1929 double-sided 78 rpm 10\" shellac disc Victor V-12067-A (BVE 53944-2) and focused our attention on the song La signorina sfinciusa (The funny girl).","refs":[]},{"text":"The performers are Leonardo Dia (voice), Alfredo Cibelli (mandolin), plus unknown (two guitars). New York, July, 24th, 1929. 3'20\".","refs":[]},{"text":"Since it is a immigration song, dedicated to a poor market (made by the Italian people emigrated in the United States of America), the audio quality of the recording is below to the standard of that age. The considered 78 rpm is largely damaged: both sides have scratches. Moreover, some areas are particularly dark: we hypothesized that this corruption has been caused by some washes (made before the disc was acquired by the audio archive of one of the author of this paper) in which chemical aggressive substances have been used. The corruptions cause evident distortions if the disc is played by means a stylus.","refs":[]},{"text":"The audio signal was extracted in two ways:","refs":[]},{"text":"1. By means of the Rek-O-Kut-Rodine 3 turntable; the A/D transfer was carried out with RME Fireface 400 at 44.1 kHz, 16 bit; no equalization curve has been applied. 2. Using PoG system; the image was taken at 4800 dpi, 8 bit grayscale, without digital correction.","refs":[]},{"text":"The clicks were removed in the video-domain, applying a filter directly in the still image of the disc surface. A Median filter is performed (usually employed for reducing the effect of motion on an image). A selection including the click is drawn: then the filter searches for pixels of similar brightness, discarding pixels that differ too much from adjacent pixels, and replaces the center pixel with the median brightness value of the searched pixels. Finally, the hiss was reduced by means a de-noise algorithm in a frequency domain based on the use of a suppression rule, which considers the psychoacoustics masking effect (Sect. 3). Then, the signal was resampled at 44.1 kHz. Fig. 2 shows the waveforms (time domain: it can be noticed the click removal by EKF in the bottom figure) of both signals, where it is evident the de-hiss carried out by the de-noise process.","refs":[{"start":689,"end":690,"marker":"figure","target":null}]},{"text":"In audio frequency range there aren't artifact caused by PoG; moreover, it can be noticed the SNR enhancement obtained by means of de-noised algorithm (see Fig. 3).","refs":[{"start":161,"end":162,"marker":"figure","target":null}]}]},{"title":"Conclusion and Future Work","paragraphs":[{"text":"The system discussed in this work, PoG, proposes a new approach for extracting audio signal from complex source material. The methodology is not invasive and innovative; the audio signal is reconstructed using a still image of a disc surface; we focused our discussion on the shellac phonographic discs, showing as PoG guarantees good performances also when the discs have heavy corruptions and supports different formats (rpm, diameter, channels number) without to change the equipment setup. In addition, it is important to highlight that, using PoG, the contextual information 3 (matrix and catalogue numbers, recording year, authors' and performers' name, etc.) are included in the photographic documents (can be read in in the label and/or in the mirror of the disc), unlike occurs in audio file (mp3, BWF, etc.), where the this information is subjectively added by the user.","refs":[{"start":580,"end":581,"marker":null,"target":"#foot_3"}]},{"text":"Our aim is to study innovative models for preserving and sharing audio documents in the context of Web 2.0/3.0. This paper represents a first step in this direction; starting from PoG, future works will focus on:","refs":[]},{"text":"we are carrying out a deep analysis and comparison among the different tools (see Section 2) and PoG; -three regions of the disc contain the audio information: the groove surface paths, the groove walls and the groove bottom. PoG calculates the audio signal by measurement of the path of the groove. Unfortunately this interface is often damaged by scratches and bumps, which can give rise to unreliable information. The audio signal can also be determined from the vertical and horizontal path on the bottom of the groove, but it is not very well defined because each pressing has a different shape and the bottom of the groove often contains dirt. In this sense, we believe that the only source of reliable information is on the slope of the walls groove, which is not easy to measure. Our idea is to enhance PoG using the interferometry techniques as well as an optical fibre that follows the groove of the disc: the reflected light (injected into the fiber by a laser) is transmitted by a lens to an X-Y position detector. Analyzing the data measured both from the interferometer and from the position detector of optical fiber will be potentially able to model the slope of the walls groove. -we are designing a new tools (codenamed Photos of GHOSTS 3D ) able to produce a 3D model of the groove, using the same techniques discussed in the last point. In this way, we will be potentially able to listen the photos of wax (and Amberol) cylinders as well as discs with vertical modulation; -we are currently actively working for a first release of a social network prototype, in which PoG will be used as a new tool for sharing and preserving audio documents.","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Typologies of analogue mechanical carriers","rows":[["Carrier","Period","Composition","Stocks"],["cylinder -recordable","1886-1950s Wax","300,000"],["cylinder -replicated","1902-1929","Wax and Nitrocellulose with","1,500,000"],["","","plaster (\"Blue Amberol\")",""],["coarse groove disc -repli-","1887-1960","Mineral powders bound by","10,000,000"],["cated","","organic binder (\"shellac\")",""],["coarse and microgroove discs","1930-1950s Acetate or nitrate cellulose","3,000,000"],["-recordable (\"instantaneous","","coating on aluminum (or",""],["discs\")","","glass, steel, card)",""],["microgroove disc (\"vinyl\") -","1948-","Polyvinyl chloride -polyac-","30,000,000"],["replicated","","etate co-polymer",""]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"In the music field, an open issue is represented by the creation of innovative tools for acquisition, preservation and sharing of information. The strong difficulties in preserving the original carriers, together dedicated equipments able to read any (often obsolete) format, encouraged the analog/digital (A/D) transfer of audio contents in order to make them available in digital libraries. Unfortunately, the A/D transfer is often an invasive process.","refs":[]},{"text":"This work proposes an innovative and not-invasive approach to audio extraction from complex source material, such as shellac phonographic discs: PoG (Photos Of Ghosts) is a new system, able to reconstruct the audio signal from a still image of a disc surface. It is automatic, needs of low-cost hardware, recognizes different rpm and performs an automatic separation of the tracks; also it is robust with respect to dust and scratches.","refs":[]}]}}