{"bibliography":{"title":"MOVIO: A Toolkit for Creating Curated Digital Exhibitions","authors":[{"person_name":{"surname":"Minelli","first_name":"Sam"},"affiliations":[{"department":"GruppoMeta","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Natale","first_name":"Maria"},"affiliations":[{"department":"Istituto Centrale per il Catalogo Unico delle biblioteche italiane (ICCU)","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Ongaro","first_name":"Paolo"},"affiliations":[{"department":"GruppoMeta","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Piccininno","first_name":"Marzia"},"affiliations":[{"department":"Istituto Centrale per il Catalogo Unico delle biblioteche italiane (ICCU)","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Saccoccio","first_name":"Rubino"},"affiliations":[{"department":"GruppoMeta","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Ugoletti","first_name":"Daniele"},"affiliations":[{"department":"GruppoMeta","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Teresa","first_name":"Natale"},"affiliations":[],"email":"mariateresa.natale@gmail.com"}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.006","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Movio","Thematic paths","Digital exhibition","Glams","Museum toolkit","Curator","Ontology builder","Virtual exhibitions","Storytelling","Semantic content management systems","Athenaplus"],"citations":{"b0":{"title":"Mostre virtuali online: linee guida per la realizzazione, Versione 1.0","authors":[],"date":{"year":"2011","month":"08","day":null},"ids":null,"target":"http://www.indicate-project.eu/getFile.php?id=412","publisher":"MIBAC","journal":null,"series":null,"scope":null},"b1":{"title":"Museum Edition","authors":[],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":"http://www.nmc.org/pdf/2010-Horizon-Museum.pdf","publisher":"The Horizon Report","journal":null,"series":null,"scope":null},"b2":{"title":"The Horizon Report","authors":[],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":"http://www.nmc.org/pdf/2010-Horizon-Report.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Analysis of the consultation launched by the Green Paper on \"Unlocking the potential of cultural and creative industries","authors":[],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://www.europarl.europa.eu/registre/docs_autres_institutions/commission_europeenne/sec/2011/0399/COM_SEC%282011%290399_EN.pdf","publisher":"European Commission","journal":null,"series":null,"scope":{"volume":399,"pages":null}},"b4":{"title":"MOVIO website","authors":[],"date":null,"ids":null,"target":"http://www.movio.beniculturali.it/","publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"MOVIO wiki","authors":[],"date":null,"ids":null,"target":"http://wiki.athenaplus.eu/index.php/Main_Page","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"The MIT Licence","authors":[],"date":null,"ids":null,"target":"http://opensource.org/licenses/mit-license.php","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Users, educators, tourist guides, are asked to answer to new needs of students and visitors, helping them to navigate safely and generate satisfaction from the fruition of Cultural Heritage (CH) everywhere and from any device without getting lost in the abundance of non qualitative cultural knowledge made available on-line. The new generation of smart-phones and tablets offer new paradigms of fruition of CH goods: These devices provide a wide range of applications and functions, enabling 'communication', knowledge creation and fruition. New social skills are emerging, users create new forms of content through narration, they share knowledge, they follow emerging experts, they express what they like/dislike. Cultural institutions too express the need of new communication and collaboration paradigms and instruments. A collection of digital items such as images, videos, documents, does not constitute a digital exhibition: only when the items are carefully selected to illustrate a topic, and are tied together forming a narrative or a logical itinerary, they constitute an exhibition. Online digital exhibitions, independently of the degree of sophistication of the technology used, can be put together in such a way that they can provide alternative or extending denser experiences to the real event, which can involve the user in a process of discovery, knowledge acquisition, and learning of the cultural goods preserved in museums or outside in the territory or finally completely digital. In 2011, MiBACT edited the guidelines for realising digital exhibitions, a handbook successfully translated in English and even in Arabic. Consequently, thanks to a funding of Fondazione Telecom Italia, ICCU coordinated the development of an open-source tool called MOVIO, which allow cultural institutions to edit and publish digital exhibitions and to tell stories. The tool supports multilingualism in the back and front-end. The curator may edit the contents using different tools integrated in the software: amongst other, a media archive, an ontology builder, a storyteller, different types of galleries, images with hotspots, maps, timeline etc.","refs":[]},{"text":"During the AthenaPlus project (www.athenaplus.eu), a European funded project coordinated by ICCU and composed by 40 cultural partners including museums, libraries and archives from 21 Member States countries MOVIO will be further developed in order to include tools to facilitate the reuse of content in the field of education and tourism. It will also include a Europeana API, which will be the base to allow digital curators to enrich content.","refs":[]}]},{"title":"From the state of the art to the MOVIO project","paragraphs":[{"text":"In 2011, ICCU, in collaboration with the Istituto centrale per gli archivi and the Osservatorio tecnologico per i beni e le attività culturali, published the guidelines for the creation of digital exhibitions on-line. This book collected contributions from a working group of experts from museums, libraries, archives, institutions and other cultural organizations. The guidelines analysed the state of the art of digital exhibitions made available on-line, and pointed out best practices and methodologies of a new way of narrating cultural content exploiting the opportunities of the new media and the Internet. After three years from the publication of the guidelines, the user demand for a new approach of publication of cultural content is still unattended in a satisfactory way. As a consequence, ICCU supported the set-up of a project addressing the recommendations written in the above mentioned handbook: a platform enabling all institutions, independently from their nature (public or private) to create and publish easily cultural narrations with personalized paths (for experts and non experts) and providing access to local cultural resources, let it be well known works of art or 'unexplored'. The project has been supported by Fondazione Telecom Italia with the focus of the valorisation of 'invisible' cultural heritage: MOVIO has been one of the seven winners of the competition funded by the foundation. The clear needs of museum curators was going to be addressed through a toolkit enabling internal personnel, with no IT skills, to create a digital exhibition safeguarding the exhibition logics and semantics and moreover enabling the emerging of collections and knowledge. The goal was to allow this toolkit to be freely accessible and interoperable and we decided to open it to the communities of developers by using the open source model. We expect that in particular small institutions (including museums, archives, libraries, archaeological areas, etc.), which typically have no resources to manage on-line valorisation models, to take advantage of this platform. The exhibitions are often the only occasion to reach the end users (schools, researchers, and general public) but still, the traditional exhibitions can only expose a small part of their collections, which remains hidden and unexplored. The think thank of MOVIO was aware that this toolkit should be innovative but also enabling the museums to do the digitization and cataloguing of their archives: we supposed that MOVIO should be an instrument supporting and integrating daily work, and as such we aimed to create a platform which should solve other issues than just publishing. Or better, we supposed that institutions would need first a media archive, to be able then to publish their collections.","refs":[]},{"text":"In 2011, CulturaItalia and OTEBAC examined 4,000 interviews on an heterogeneous sample of population and evidenced that 70% of them were interested to look for information about museums and exhibitions through the Internet and among them 68,2% would prefer to look such information on websites managed by public and institutional subjects; over 2,800 answers, 82.5% would access digital exhibitions for personal amusement, 24.1% for work, 31.5% for study and research. In 2010 the Marcus Institute for Digital Education in the Arts (MIDEA) published the Horizon Report, the museum edition, which described the technologies, which could best support the museums activities in the near and long term future. Clearly the report put into evidence the mobile applications, the social and community interaction, the augmented reality, the natural interaction, the semantic web, the 'big' and open data and the applications using localized information. The educational edition published in the same year, addressed the technologies which best supported education and research and school activities for learning. All scenarios present a growing use of digital and mobile technologies lead by a massive and exponential growth of content on-line (images, text, video) made accessible in an ubiquitous way for leisure, work and study. Finally, another fundamental reference for our project is the Analysis of the consultation launched by the Green Paper on \"Unlocking the potential of cultural and creative industries\" published in 2011 by EC, which faced the policy and economical implications for the cultural industry where more than 5 million persons are employed in the 27 member states. The cultural contents are crucial for the growth of the information society feeding indirect other connected markets (such as telecommunications, consumer electronics etc.) and all creative industries.","refs":[]}]},{"title":"Digital exhibitions and thematic paths","paragraphs":[{"text":"Before describing the MOVIO toolkit and how to build a project, we recall the definition of 'digital exhibition' (DE) and 'thematic path' (TP) provided by the previously mentioned guidelines. An online virtual/digital exhibition is a hypermedia collection accessible via the web, and made up of digital items, which are:","refs":[]},{"text":"• Linked together by a common threat, an inter-disciplinary topic, a concept, an idea, an anniversary, a special event, or a physical person. • Displayed in 2D or 3D.","refs":[]},{"text":"• Occasionally memorised in distributed networks.","refs":[]},{"text":"• Made accessible through the potential provided by modern technology, thanks to a system architecture designed to provide user-centred, absorbing experiences. • Dynamic products that can offer services and be updated periodically.","refs":[]},{"text":"DE can be generated through real events (i.e. an exhibition inside a museum) or be digital and be completely virtual. DE can extend the real exhibitions attracting larger number of visitors, enriching and strengthening their experience by means of images, audio narrations, music and video tracks, 3D animations and models, augmented reality interactivity, hyperlinked texts, combined multimedia objects. More content can be offered to a more demanding public whose need is not just raw massive data, which overwhelm the commune user, but a guided navigation through 'thematic paths' and authoritative content. The TP are an expression of the DE and curators can use TP to create: • Autonomous products with an independent (from the real exhibition) and evolving exploitation model.","refs":[]},{"text":"• Enhanced itineraries connected to new instruments (such as geographical maps, dynamic timelines, external resources in respect to the museum's in house collections). • Instruments to create new and connect knowledge while improving learning.","refs":[]},{"text":"TP aggregate content items about a topic and provide an interpretation perspective to the digital visitor who can then go deeper in detail and follow the path, discovering more details both for personal interest and for study or research. The advantage is the fact that TP provide a light way to the knowledge discovery, independently from the original collocation of the objects (which may be sparse) and combining many types of information (multimedia documents, video, quotes, references, articles, etc.).","refs":[]}]},{"title":"The MOVIO toolkit vision","paragraphs":[{"text":"Museum curators need dedicated tools enabling them to innovate their communication workflow, to create new projects and improve their workflow. MOVIO is a toolkit designed specifically for curators, offering as example the following added value characteristics:","refs":[]},{"text":"• It is an Open Source solution (allows museums to modify autonomously the source code, allows the community of developers to expand and personalize the platform, enables the reuse and community participation to the code update and maintenance). • The user can access the MOVIO pages through any device (PC, tablet, smartphone -there also exists a dedicated mobile application called MOVIO APP). • All the realized DE will be accessible through a dedicated DE library called MOVIO-HUB.","refs":[]},{"text":"• The MOVIO Content Management System (and its extensions) will be provided with on-line tutorials, handbooks and full documentation.","refs":[]},{"text":"The end users will access personalized DE as curators will be able to create different TP for different communities of users, from students and general public to teachers, researchers and professionals. All these user communities can access different levels of the cultural content (from easy and generic to professional and technical) going more in detail on any topic generated by the curators who can decide, and be creative. As an instrument addressed to a large and heterogeneous community, MOVIO has been implemented following rigorous accessibility standards (such as W3C, HTML5), interoperability with other existing cultural web sites and with the goal to be used and managed by subjects with no IT skills. These important characteristics have been planned and realized after a long collaboration of the project team with the Italian MiBACT: MOVIO is the new born from past collaboration projects after the wide adoption by museums and institutions in Italy of the \"Museo&Web CMS\", which is an open source CMS platform supporting on-line cultural sites publishing.","refs":[]},{"text":"At the start of the MOVIO project a team of domain experts worked on the experimentation, refining the user requirements, testing ongoing functionalities and a community of real users (curators) created DE on local collections. This process guaranteed a real productive chain of scientific experts, users, developers converging to a stable, simple and multifunctional application platform. While the development is continuing several DE have been already completed and published while many others are in progress also at European level.","refs":[]}]},{"title":"MOVIO is a Semantic Content Management System","paragraphs":[{"text":"The curators need a Content Management System in order to publish any form of structured narrations, a media archive where they can collect and manage their multimedia content files. This is a prerequisite. MOVIO's first module is a native CMS which can be populated with content collections and from which the curators will easily search and select images, video, documents, etc. MOVIO provides at the moment a limited set of functionalities but it has been structured to incorporate easily further new functionalities and plug-ins. We imagine that the more curators will use MOVIO, the more new functionalities will be requested and implemented: MOVIO is unique not for its functionalities but for its semantic based approach and as such it is called 'Semantic Content Management System' (SCMS). In fact, MOVIO is the first platform offering to end-users the opportunity to build their ontologies and use them immediately without the need of IT expertise: the Ontology Builder allows in a simple way, to create Entities and Relations, which can be visually represented by a graph where the nodes are Entities and the edges connecting them are the Relations. The domain ontologies connect content entities having semantic correlations.","refs":[]},{"text":"We are aware that speaking about ontologies, entities and relations may frighten a wide category of users, that is why we need not describing them the architecture nor the mechanics of MOVIO: in a very short time curators get confidence of it by using it and they are no more thinking about a complex semantic infrastructure.","refs":[]},{"text":"MOVIO can be easily installed even if it is a server side platform, and we are targeting to further simplify the setup by creating remote installation procedures.","refs":[]},{"text":"SCMS MOVIO integrates third parties Open Source components and libraries to enrich its functionalities. At the end of the experimental phase, we will release the MOVIO software under a MIT license: any developer will be allowed to use, modify, reuse under the only limitation that the changed source code too will be released under the same license. As such, MOVIO licence is GPL compatible: any GPL software can use MIT licensed code and still remain GPL.","refs":[]},{"text":"The back-end of MOVIO is the area dedicated to populate the media archive and through it to create the pages and the narration to be published on-line. Some of the activities offered are: • Choose the language for the media which you are going to add to the media archive.","refs":[]},{"text":"• Manage multilingualism of the collections, graphical templates, media archive, user profiles and users.","refs":[]},{"text":"• Provision of a \"page content management\": the user can manage directly the menu of the DE and the association to the different modules of the platform and existing page types. • Modify and personalize the page types.","refs":[]},{"text":"• Manage interoperability and community functions.","refs":[]},{"text":"• Optimize the meta-tags for SEO.","refs":[]},{"text":"The SCMS can be used by the curator to create multilayer DE, from a general view to a more focused and narrow narration and specialized descriptions. The editorial structure can be imagined like the roots of a tree: while going deeper the roots widen their correlations. Leaving a model where the curators used a linear corridor of narration, now TP can be created instead, correlating content items and personalizing the content fruition.","refs":[]},{"text":"As already said, the SCMS includes innovative pagetypes and functionalities. Among them we describe here the Ontology Builder and the Storyteller.","refs":[]},{"text":"The Ontology Builder is the tool for managing the conceptual map of the contents to be published, creating relations among the Entities (to which the curator may associate documents, images and other media). The Relations between Entities are expressed by verbs: this guarantees the correctness of the logical path connecting them. The curator will draw by hand a draft conceptual map of Entities and Relations in the semantic domain of the DE. As soon as the conceptual map has been defined, the curator will start to use MOVIO creating the relations first and the entities later. The final result of the map can be visualized by the curator (from the back-end) and by the end user from the front-end. The user can access the list of the contents represented by an Entity, simply by clicking on it. Each content item can then be navigated in terms of description and eventually be played (for videos). The curator creates cards and descriptions thanks to the Module Builder that allows the curator to create a personalized metadata schema describing the exhibition and include textual description, photographic galleries, visual media play, etc.","refs":[]},{"text":"The Storyteller is an instrument to narrate stories. Three are the main ingredients of the storytelling: the story (in DE we use digital media contents); the author/storyteller (in the case of DE this role is performed by the curator); the public (who will read, listen and, interact socially commenting, etc.). As such, the MOVIO SCMS is the most adequate instrument for having a digital continuation of the storytelling tradition with the added value of public direct involvement. To best follow the storytelling process, we decided to design a vertical sequence template, which presents on the narration line texts, video, images, etc. In-depth contents will be linked by means of the Ontology Builder and as same as in Blogs, each narration item has a permalink to be quoted or shared as a single relevant piece of knowledge. Each DE has typically a descriptive form to be filled (similar to the card which describes the real exhibition), including an identification reference, a title, an author (the curator). The card describing the DE is useful both for the curator and for the end user who will access soon to a 'library of DE'. This is the future evolution of MOVIO: MOVIO-HUB will collect all DE and offer them to the users on a virtual hub. We created the card template following the guidelines provided by a working group active in the European funded projects Linked Heritage and AthenaPlus.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"In March 2014, the first phase of the MOVIO project was finalized. Since then ICCU and OTEBAC activated a series of training courses and tutorials to teach to national institutions and museums on how to use MOVIO and create DE. The first phase objectives were:","refs":[]},{"text":"• Implementation of open source software enabling cultural institutions to create virtual digital exhibitions and thematic paths using existing digital assets and valorising the cultural collections they owned; implementation of an accessible set of tools easy to use with no IT skills by curators and cultural professional users. • The creation of a set of initial digital exhibitions and stories, which could stimulate other cultural subjects to do the same. • Stimulate the creation of a new generation of digital and interconnected cultural objects.","refs":[]},{"text":"• Giving access to \"invisible\" cultural objects and their communication on-line to attract social and user interaction. • Opening the opportunity to MOVIO as a marketing instrument providing better access to cultural goods and become an attractor to tourists into the museums. • Offer to software developers a new open source platform they can improve, and expand for their customers.","refs":[]},{"text":"The MOVIO project is currently under improvement as part of the European funded project AthenaPlus, coordinated by ICCU. AthenaPlus (Access to cultural heritage networks for Europeana) -http://www.athenaplus.eu -is a CIP best Practice network started in March 2013 and ending in August 2015. The consortium is composed by 40 partners from 21 Member States countries. The principal objectives of the AthenaPlus project are to: contribute more than 3.6 millions metadata records to Europeana, from both the public and private sectors, focusing mainly on museums content, with key cultural stakeholders (ministries and responsible government agencies, libraries, archives, leading research centres, SMEs); Improve search, retrieval and re-use of Europeana's content, bettering multilingual terminology management, SKOS export and publication tool/API for Content Providers; Experiment with enriched metadata their re-use adapted for users with different needs (tourists, schools, scholars) by means of tools, such as MOVIO, that support the development of virtual exhibitions, tourist and didactic applications, to be integrated into Europeana repositories and the repositories of national aggregators or individual Content Providers. During these activities MOVIO will be upgraded with new functionalities for the educational and tourism domains including specific APIs enabling the interoperability with the Europeana library.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"In 2011, the Italian Ministry for Cultural Heritage and Tourism (MiBACT) published a guideline reference book analysing the state of the art and best practices of digital exhibitions made available on-line and offered a handbook successfully translated in English and even in Arabic. To satisfy the needs expressed by museum curators (but not limiting to them) GruppoMeta has implemented the MOVIO platform under the coordination of ICCU: MOVIO is a semantic CMS which provides tools to support the development of virtual/digital exhibitions, touristic and didactic applications. MOVIO supports the creation of a media archive and 'non-scaring' ontology builder for a storytelling approach and it allows cultural content publishing (it includes the creation of visit paths, up to mapping, time-line, galleries and social tools). The MOVIO open source SCMS platform is an easy and ready to use toolkit to build online and mobile virtual/digital exhibitions and narrations. It has begun to be experimented by several Italian institutions and several European partners from the AthenaPlus consortium.","refs":[]}]}}