{"bibliography":{"title":"Learning to Cite: Transfer Learning for Digital Archives","authors":[{"person_name":{"surname":"Dosso","first_name":"Dennis"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"dosso@dei.unipd.it"},{"person_name":{"surname":"Setti","first_name":"Guido"},"affiliations":[{"department":"Department of Mathematics","institution":"University of Padua","laboratory":null}],"email":null},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"silvello@dei.unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-11226-4_8","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"Task Group on Data Citation Standards and Practices, Out of Cite, Out of Mind: The Current State of Practice, Policy, and Technology for the Citation of Data","authors":[],"date":{"year":"2013","month":"09","day":null},"ids":null,"target":null,"publisher":"CODATA-ICSTI","journal":null,"series":null,"scope":{"volume":12,"pages":null}},"b1":{"title":"Automating data citation: the eagle-i experience","authors":[{"person_name":{"surname":"Alawini","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Chen","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Davidson","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Portilho Da Silva","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":"IEEE Computer Society","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":169,"to_page":178}}},"b2":{"title":"Why data citation is a computational problem","authors":[{"person_name":{"surname":"Buneman","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Davidson","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Frew","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Commun. ACM (CACM)","series":null,"scope":{"volume":59,"pages":{"from_page":50,"to_page":57}}},"b3":{"title":"A rule-based citation system for structured and evolving datasets","authors":[{"person_name":{"surname":"Buneman","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IEEE Data Eng. Bull","series":null,"scope":{"volume":33,"pages":{"from_page":33,"to_page":41}}},"b4":{"title":"Data Citation Synthesis Group: Joint Declaration of Data Citation Principles. FORCE11","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"A survey on transfer learning","authors":[{"person_name":{"surname":"Pan","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Yang","first_name":"Q"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IEEE Trans. Knowl. Data Eng","series":null,"scope":{"volume":22,"pages":{"from_page":1345,"to_page":1359}}},"b6":{"title":"A methodology for citing linked open data subsets","authors":[{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":{"DOI":"10.1045/january2015-silvello","arXiv":null},"target":"https://doi.org/10.1045/january2015-silvello","publisher":null,"journal":"D-Lib Magazine","series":null,"scope":{"volume":21,"pages":null}},"b7":{"title":"Learning to cite framework: how to automatically construct citations for hierarchical data","authors":[{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Am. Soc. Inf. Sci. Technol. (JASIST)","series":null,"scope":{"volume":68,"pages":{"from_page":1505,"to_page":1524}}},"b8":{"title":"Theory and practice of data citation","authors":[{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Am. Soc. Inf. Sci. Technol. (JASIST)","series":null,"scope":{"volume":69,"pages":{"from_page":6,"to_page":20}}},"b9":{"title":"Accreditation and attribution in data sharing","authors":[{"person_name":{"surname":"Thorisson","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Nat. Biotechnol","series":null,"scope":{"volume":27,"pages":{"from_page":984,"to_page":985}}},"b10":{"title":"Data citation: giving credit where credit is due","authors":[{"person_name":{"surname":"Wu","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Alawini","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Davidson","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":{"DOI":"10.1145/3183713","arXiv":null},"target":"https://doi.org/10.1145/3183713","publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":99,"to_page":114}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Scientific research relies more and more on data for conducting advanced analysis and support discoveries and empirical findings. Nowadays, scientific datasets constitute the backbone of the system of the sciences and are critical factors for conducting high-quality research. Hence, open and shared datasets constitute first-class objects of the scientific process and need to be retrieved, accessed and cited as traditional scientific articles are. Moreover, the creation, curation, and preservation of scientific datasets require a great deal of investment and humaneffort that need to be recognized and assessed by the scientific community [9].","refs":[{"start":644,"end":647,"marker":"bibr","target":"#b8"}]},{"text":"For these reasons, there is a strong demand [1,5] to give databases the same scholarly status of traditional references. Recently, data citation has been defined as a computation problem [3], where the main issues to be tackled are: (i) the unique and persistent identification of a dataset or a data subset; (ii) the temporal persistence of the data as well as of the data citations; and, (iii) the automatic creation of text snippets (references) citing data subsets.","refs":[{"start":44,"end":47,"marker":"bibr","target":"#b0"},{"start":47,"end":49,"marker":"bibr","target":"#b4"},{"start":187,"end":190,"marker":"bibr","target":"#b2"}]},{"text":"In this work, we focus on the automatic creation of text snippets for citing datasets with a variable granularity. This problem has been tackled with rule-based/deterministic approaches from a relational [11], hierarchical [4] and graph [2,7] database perspective or with a machine learning approach -i.e. the Learning to Cite (LtC) approach -for XML [8]. Pros and cons of these two approaches are specular ones to the other. The LtC approach has the main advantage of not requiring expert intervention to define citation policies and rules required by rule-based systems; on the other hand, the citations produced are not \"exact\" as those produced by rule-based systems.","refs":[{"start":204,"end":208,"marker":"bibr","target":"#b10"},{"start":223,"end":226,"marker":"bibr","target":"#b3"},{"start":237,"end":240,"marker":"bibr","target":"#b1"},{"start":240,"end":242,"marker":"bibr","target":"#b6"},{"start":351,"end":354,"marker":"bibr","target":"#b7"}]},{"text":"In [8], we introduced the LtC approach and we tested it on digital archives (i.e. XML Encoded Archival Description (EAD) files). We decided to testbed the LtC approach on this domain because archives usually lack resources and present a high data heterogeneity also within the same archive; these aspects make the LtC approach particularly valuable in the archival context. In [8] we showed that the LtC approach allows us to produce entirely accurate citations with small training sets, thus requiring minimum effort to database administrators and domain experts.","refs":[{"start":3,"end":6,"marker":"bibr","target":"#b7"},{"start":377,"end":380,"marker":"bibr","target":"#b7"}]},{"text":"In this work, we move one step ahead by studying if \"it is possible to learn a citation model on an archive A and apply it to an unseen archive B\". The goal is to learn a citation model on an archive where there are enough economic and human resources to build a training set and maintain a citation model (e.g. the LoC archive) and to apply it to other -possibly a broad spectrum -archives with lower resources.","refs":[]},{"text":"Hence, in this work, we study the problem of transfer learning from an archive to another by using the LtC approach presented in [8] as a baseline. We conduct two experiments: (i) we train a citation model on a uniform and consistent training set (i.e. EAD files coming from a single archive) and we create citations for EAD files coming from five different heterogeneous archives; and, (ii) we train a citation model on a training set composed of the union of five heterogeneous archives and we create citations for a single archive not present in the training set. These two tests define a task harder than a traditional transfer learning task because the training and the test sets we consider are entirely disjointed. We show that the LtC approach has the potential to be applied in a transfer learning scenario, even though there is a performance drop concerning a classic learning scenario where training and test sets are sampled from the same archival collection.","refs":[{"start":129,"end":132,"marker":"bibr","target":"#b7"}]},{"text":"The rest of paper is organized as follows: in Sect. 2 we briefly describe how data citation applies to the archival domain and summarize the main approaches to data citation. In Sect. 3 we describe at a high-level the LtC approach and explain how we model transfer learning for data citation. In Sect. 4 we define the experimental setup, describe the datasets and the experiments we conduct and in Sect. 5 we present the results of the evaluation. Finally, in Sect. 6 we draw some conclusions and outline future work.","refs":[]}]},{"title":"Related Work","paragraphs":[]},{"title":"Digital Archives","paragraphs":[{"text":"Archives are composed of unique records where the original order of the documents is preserved because the context and the order in which the documents are held are as valuable as their content. Archival documents are interlinked and their relationships are required to understand their informative content. Therefore, archives explicitly model and preserve the provenance of their records by means of a hierarchical method, which maintains the context in which they have been created and their relationships.","refs":[]},{"text":"Archival descriptions are encoded by means of the Encoded Archival Description (EAD) which is an XML description of a whole archive; EAD files resemble the description of the archival material and provide a means to represent the internal logic of an archive.","refs":[]},{"text":"The EAD files represent a good test-bed for the LtC approach because they are deep files not easy to navigate and understand for the users, there is a wide variability in the use of tags that makes it difficult to set up citation rules across files and every node in an EAD file is a potential citable unit.","refs":[]}]},{"title":"Data Citation Approaches","paragraphs":[{"text":"A recent and detailed overview of the theory and practice of data citation can be found in [9]. It has been highlighted that the manual creation of citation snippets is a barrier towards an effective and pervasive data citation practice as well as a source of inconsistencies and fragmentation in the citations [10]. Indeed, especially for big, complex and evolving datasets, users may not have the necessary knowledge to create complete and consistent snippets.","refs":[{"start":91,"end":94,"marker":"bibr","target":"#b8"},{"start":311,"end":315,"marker":"bibr","target":"#b9"}]},{"text":"Recently, some solutions to tackle the problem of automatically creating citation snippets have been proposed. There are two main approaches: (i) rule-based and, (ii) machine-learning based.","refs":[]},{"text":"Within the first approach, one of the first methods has been proposed by [4]. This method requires that the nodes corresponding to citable units are identified and tagged with a rule that is then used to generate a citation. This method was extended by [3] which defined a view-based citation method for hierarchical data. The idea is to define logical views over an XML dataset, where each view is associated to a citation rule, which if evaluated generates the required citation snippet according to a predefined style. This approach has been further formalized and extended also for the relational databases in [11]. In the same vein by exploiting database views, [2] proposed a system for citing single RDF resources by using a dataset on the medical domain as use-case.","refs":[{"start":73,"end":76,"marker":"bibr","target":"#b3"},{"start":253,"end":256,"marker":"bibr","target":"#b2"},{"start":614,"end":618,"marker":"bibr","target":"#b10"},{"start":667,"end":670,"marker":"bibr","target":"#b1"}]},{"text":"The machine-based approach has been proposed for the first time by [8] with the Learning to Cite (LtC) framework that we present below.","refs":[{"start":67,"end":70,"marker":"bibr","target":"#b7"}]}]},{"title":"Creation of Data Citations Based on Machine Learning","paragraphs":[]},{"title":"Learning to Cite","paragraphs":[{"text":"The aim of the LtC approach is to automatically create a model that can produce human-and machine-readable citation from XML files (EAD files for our use-case) without manual interventions of the data curators and without any modification to the data to be cited.","refs":[]},{"text":"The LtC framework is composed of six main blocks as shown in Fig. 1: the training data, the learner, the citation model, the citation systems, the test data and the output reference. Fig. 1. The building blocks of the \"Learning to Cite\" framework [8].","refs":[{"start":66,"end":67,"marker":"figure","target":null},{"start":188,"end":189,"marker":"figure","target":null},{"start":247,"end":250,"marker":"bibr","target":"#b7"}]},{"text":"The training set is composed of a collection C of XML files. Given two sets T = {t 1 , t 2 , . . . , t n } of XML trees and a set H = {H 1 , H 2 , . . . , H m } of humanreadable citations, the learner component takes as training data a set of pairs <t i , H i >. In particular, each citation H i ∈ H is associated to one and only one XML tree t i ∈ T , while each tree has at least one associated citation (but potentially more than one).","refs":[]},{"text":"From the training data the learner produces a citation model able to create human-readable citations. In particular, the test data are a set of pairs <p t , t t > where t t is a XML tree with a citable unit referenced by the XPath p t . The citation system parses the XPath p t and creates a human-readable citation for the user exploiting the data inside the XML.","refs":[]},{"text":"In particular, for the validation phase, the system can use a function to evaluate the effectiveness of the citation system and tune the parameters. These functions are precision, recall and fscore. Let MC k = {p 1 , p 2 , . . . , p n } be a machine readable citation generated by the system for the element e k = < p k , t k >. {p 1 , p 2 , . . . , p n } are the paths composing the citation. Let GT C k = {p 1 , p 2 , . . . , p m } be the groundtruth machine-readable citation for the same element, i.e. the set of paths that correctly form the citation for e k . Then we can define:","refs":[]},{"text":"Precision is the ratio between the total number of correct paths in the generated citation with the total number of generated paths, while recall is the ratio between the total number of generated correct paths and the total number of correct paths. Both are in the [0, 1] interval, just like the fscore, which is a synthesis measure.","refs":[]},{"text":"The framework uses one of these function in a k-fold validation strategy to find the best parameters for the system.","refs":[]}]},{"title":"Transfer Learning","paragraphs":[{"text":"As defined in [6], given a source domain D S with a learning task T S and a target domain D T with a learning task T T , transfer learning aims to help improve the learning of the target predictive function f T (•) in D T using the knowledge in D S and T S , where D S = D T or T S = T T .","refs":[{"start":14,"end":17,"marker":"bibr","target":"#b5"}]},{"text":"In order to apply transfer learning to the LtC approach, it is necessary to define the domains and task at hand: Thus, we can use the knowledge coming from the source domain and source task to learn the predictive function f T (•), which corresponds to a citation model for the target collection. In the case we are considering, source and target domain are different, and so are source and target tasks.","refs":[]}]},{"title":"Experimental Setup","paragraphs":[]},{"title":"Experimental Collections","paragraphs":[{"text":"The first experimental collection we consider is based on the Library of Congress (LoC)1 EAD files and it has been defined in [8]; it consists of training, validation and test set. The training and validation sets are composed of XML tree and human-readable citation pairs. The validation set is obtained with k-fold cross validation from the training set. The test set is made of XML tree and machinereadable citation pairs. The human-and machine-readable citations were all built manually. The full LoC collection is composed of 2,083 files. In order to build the training and validation set, 25 EAD files were randomly selected, and from each of these files 4 citable units were extracted. For each citable unit, a human-readable and machine-readable citation was manually created to be used to train the citation system and to build the ground-truth to be used for validation purposes respectively. The test set was built by following a similar procedure. In this case, a ground-truth machine-readable citation was manually built for every randomly sampled citable unit. A new collection of EAD files is created in order to test Transfer Learning. Five different and heterogeneous source archives are selected:","refs":[{"start":87,"end":88,"marker":null,"target":"#foot_0"},{"start":126,"end":129,"marker":"bibr","target":"#b7"}]},{"text":"1. University of Chicago Library finding aids (chicago); 2. University of Maryland Libraries finding aids (MdU); 3. Nationaal Archief, Den Haag (NL-HaNA); 4. Syracuse University finding aids (syracuse); 5. WorldCat aggregate collection aids (worldcat). This is a very heterogeneous collection of digital archives from all across the United States.","refs":[]},{"text":"10 citable units are randomly selected from each of these collections, creating a new collection of 50 citable units from different sources. This new collection is called EAD various in the rest of the paper.","refs":[]},{"text":"We conduct two experiments. In the first one, the source collection C S is the LoC collection and the target task is to produce a set of citations for the target collection C T which is the EAD various collection. The EAD various collection is only used as test set, hence a model f T (•) cannot be directly built. f S (•) will be used in order to learn the target predictive function f T (•) for the target task T T . The second experiment reverses experiment one since we train on EAD various and test on LoC.","refs":[]},{"text":"For each experiment, the citation model is built using the training and validation sets of the source collection and a 5-fold cross-validation is used to choose the best parameters of the model, with the f-score as optimization measure. The whole training and test procedure are repeated with different training sizes -i.e. the number of citable units contained in the training set -ranging from 20 to 80 with step 10. The citation model is then tested against the target collection and the procedure is repeated 5 times for each training size. The final measures presented are the average over the results of the five repetitions.","refs":[]}]},{"title":"Evaluation","paragraphs":[{"text":"In the first experiment, we trained a citation model on the uniform LoC collection and we tested both on the LoC (classic learning procedure) and the EAD-various (transfer learning) test set.","refs":[]},{"text":"In Table 1 we can see the precision, recall, and f-score obtained by the LtC approach with different training set sizes over the two considered test collections. As expected, the citation model produces generally better citations for the LoC collection, while for the EAD various collection the performances are usually halved. It is particularly interesting how a training set size of 20 immediately obtains acceptable values in all three measures. This is true for both the collections. This is consistent with the results presented in [8].","refs":[{"start":9,"end":10,"marker":"table","target":"#tab_0"},{"start":538,"end":541,"marker":"bibr","target":"#b7"}]},{"text":"We conduct an ANOVA statistical test to check if the performance difference between LoC and EAD various are statistically significant. Figure 2a shows that the difference between the evaluation measure of the LoC collection and the EAD various collection are statistically significant and not due to chance. This means that the citation model built using the LoC is missing some knowledge regarding the target EAD various collection.","refs":[{"start":142,"end":144,"marker":"figure","target":"#fig_3"}]},{"text":"Given that the performances of the citation model are worse for the EAD various collection, we performed the Tukey's HSD test to check if the model is statistically different over the 5 subsets of citation units comprising the EAD various collection. The results, presented in Fig. 2b, shows that the citation model built with the LoC collection training data (using 50 citation units) behaves with no significant difference with regard to f-score on the 5 sub-collections (the same result is obtained with precision and recall).  The second experiment builds the citation model with the EAD various collection and tests it on the LoC collection. The aim of this experiment is to discover if one of the five sub-collections of EAD various is more informative","refs":[{"start":282,"end":284,"marker":"figure","target":"#fig_3"}]}]},{"title":"Final Remarks","paragraphs":[{"text":"The transfer learning experiments we conducted highlight that different digital archives employ the EAD standard differently and use the tags in a heterogeneous way. This aspect impacts the LtC approach which behaves very well within the same archive, but fairly less when we try to apply the same model on a heterogeneous collection.","refs":[]},{"text":"We see that the impact of a single sub-collection in the training set is marginal even though some collections bring key contributions that help to improve the citation model -see the role of the highly heterogeneous \"worldcat\" sub-collection in the second experiment. On the one hand, this means that the LtC framework performs at best when trained on the collection where it will be applied. On the other hand, the framework adapts well to heterogeneous collections provided that the test set not to be composed of EAD files coming from archives not considered in the training set. Finally, we confirm that the LtC approach does not require big the training sets as it was shown for a homogeneous setting in [8].","refs":[{"start":710,"end":713,"marker":"bibr","target":"#b7"}]},{"text":"Future work will investigate the role of expert users in a reinforcement learning setting, where the citations produced by the system are corrected and revised by experts. We plan to dynamically change the citation model when a user modifies a citation in order to add a new learning layer to the system.","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Experiment 1: From homogeneous to heterogeneous. Precision, recall and f-score values obtained in the two test collections with f-score as optimization measure.","rows":[["Training set size Precision","Recall","f-score"],["","LoC","EAD various LoC","EAD various LoC","EAD various"],["20","0.8819 0.5289","0.8232 0.4188","0.8441 0.4584"],["30","0.9034 0.5283","0.8089 0.4101","0.8465 0.4525"],["40","0.8748 0.5282","0.8312 0.4254","0.8447 0.4623"],["50","0.9239 0.5277","0.8045 0.4043","0.8531 0.4488"],["60","0.9333 0.5414","0.7723 0.3955","0.8366 0.4474"],["70","0.9012 0.5284","0.8106 0.4131","0.8462 0.4547"],["80","0.9152 0.5281","0.8055 0.4065","0.8506 0.4503"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"We consider the problem of automatically creating citations for digital archives. We focus on the learning to cite framework that allows us to create citations without users or experts in the loop. In this work, we study the possibility of learning a citation model on one archive and then applying the model to another archive that has never been seen before by the system.","refs":[]}]}}