{"bibliography":{"title":"Data Curation in Cultural Heritage Institutions: Two Case Studies","authors":[{"person_name":{"surname":"Kempf","first_name":"Klaus"},"affiliations":[{"department":null,"institution":"Bayerische Staaatsbibliothek Munich","laboratory":null}],"email":"klauskempf@gmx.de"},{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"annamaria.tammaro@unipr.it"},{"person_name":{"surname":"Casati","first_name":"Stefano"},"affiliations":[{"department":null,"institution":"Museum Galileo Digital Library Florence Italy","laboratory":null}],"email":"s.casati@museogalileo.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Bayerische staatsbibliothek","Museum galileo digital library","Data curation"],"citations":{"b0":{"title":"La Biblioteca digitale del Museo Galileo, Biblioteche oggi","authors":[{"person_name":{"surname":"Casati","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2015","month":"02","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":45,"to_page":51}}},"b1":{"title":"Online la nuova versione della Galileo//thek@","authors":[{"person_name":{"surname":"Casati","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Rolfo","first_name":"I"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Galilaeana: journal of Galilean studies, A","series":null,"scope":{"volume":13,"pages":{"from_page":181,"to_page":186}}},"b2":{"title":"La Biblioteca digitale del Museo Galileo e il progetto GLAM","authors":[{"person_name":{"surname":"Casati","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Rotoli","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":33,"to_page":36}}},"b3":{"title":"Le collezioni digitali tematiche del Museo Galileo: esperienze e nuove prospettive , in: Storie d'autore, storie di persone : fondi speciali tra conservazione e valorizzazione, a cura di F. Ghersetti","authors":[{"person_name":{"surname":"Casati","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Pocci","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":null,"publisher":"AIB","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":273,"to_page":280}}},"b4":{"title":"Redazione e uso di mappe strutturali: un esempio di cooperazione fra biblioteche digitali: la biblioteca digitale del Museo Galileo e la Biblioteca europea di informazione e cultura","authors":[{"person_name":{"surname":"Casati","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Butini","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Viazzi","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Digitalia","series":null,"scope":{"volume":null,"pages":{"from_page":51,"to_page":63}}},"b5":{"title":"Data Curation: How and Why. A Showcase with Re-use Scenarios","authors":[{"person_name":{"surname":"Gerth","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Sieverling","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Trognitz","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":{"DOI":"10.14434/sdh.v1i2.23235","arXiv":null},"target":"https://doi.org/10.14434/sdh.v1i2.23235","publisher":null,"journal":"Studies in Digital Heritage","series":null,"scope":{"volume":1,"pages":{"from_page":182,"to_page":193}}},"b6":{"title":"Data curation oder (Retro-)Digitalisierung ist mehr als die Produktion digitaler Daten","authors":[{"person_name":{"surname":"Kempf","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Das offene Bibliotheksjournal","series":null,"scope":{"volume":4,"pages":null}},"b7":{"title":"Curated content come un aspetto centrale della politica delle raccolte nell'epoca digitale","authors":[{"person_name":{"surname":"Kempf","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":"Editrice Bibliografica","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":140,"to_page":149}}},"b8":{"title":"Big Data Curation in 20th International Conference on Management of Data (COMAD)","authors":[{"person_name":{"surname":"Miller","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2014","month":"12","day":"17"},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"In recent decades, several projects have been carried out to digitize the cultural heritage owned by archives, libraries and museums (LAM) that highlight the importance of data curation standards and good practices. In the present recovery phase after the pandemic, where digitization projects are financed to extend democratic access to cultural heritage, it is very useful to examine the developments of the data curation practices carried out so far by LAM and to consider the approaches that have been adopted, what are their theoretical frameworks and where there are gaps.","refs":[]},{"text":"Rather than merely presenting the technical challenges, we intend to analyze organizational and social challenges not as separate considerations, but as integral parts of the structure of the whole. For this purpose we examine two case studies: the case of Bayerische Staatsbibliothek (BSB) and the case of Galileo Museum Digital Library (MGDL). The two case studies were chosen because they represent two pioneering digital library experiences that have adopted different models of digitization: the mass digitization of the cultural heritage of the BSB and the MGDL digitization of a specialized collection distributed in different libraries. The aim pursued by the two case studies was similar: to provide general access to scholars to hardly visible collections or to meet the needs of a specific research program.","refs":[]},{"text":"The Bayerische Staatsbibliothek in Munich is the central library of the Free State of Bavaria and one of the most important universal libraries in Europe. The BSB was a pioneer in mass digitization, starting a collaboration with Google Book at the end of the 90s and at the same time opening an internal digitization center called Munich DigitiZation Center (MDZ) to manage the entire workflow from production to preservation.","refs":[]},{"text":"The Digital Library of the Museo Galileo was born in 2004 as a specialized library for the history of science. The MGDL was one of the first digital library projects carried out in Italy with the contribution of the Ministry of Cultural Heritage, it integrates various archives of texts, images, 3D objects from the Galileo Museum and other partner libraries. The Digital Library of the Galileo Museum has set up an internal center for supporting the phases of creation, management and preservation of digital content.","refs":[]},{"text":"The paper aims to summarize several current and emerging trends in data curation in heritage institutions, with a strong emphasis on the use of technologies, as tools capable of exhibiting, acquiring and transforming digital representation on multiple levels, along with organizational and social implications.","refs":[]}]},{"title":"Data curation","paragraphs":[{"text":"Data curation includes \"all the processes required for principled and controlled data creation, maintenance and management, along with the ability to add value to data.\" (see Wikipedia and [9]) Data curation is a broad term to indicate processes and activities related to the organization and integration of data collected from various sources, their enrichment as well as their publication and presentation so that their value is maintained over time and remains available for reuse and preservation. In the modern era of big data, the curation of data has become more prominent, particularly for software processing high volume and complex data systems. In science, data curation may indicate the process of research data management and extraction of important information from scientific texts, following FAIR principles.","refs":[{"start":189,"end":192,"marker":"bibr","target":"#b8"}]},{"text":"In cultural heritage institutions, the transition from predominantly analogue to predominantly digital acquisitions requires significant changes in thinking and practices [6].","refs":[{"start":171,"end":174,"marker":"bibr","target":"#b5"}]},{"text":"Organising cultural heritage institutions in the digital environment is addressed in four lines of data curation activities:","refs":[]},{"text":"• Access: discovery/data retrieval; • Workflow: maintenance and improvement of the quality of data; • Data representation: addition of value to data; • Re-use: re-use of data including preservation.","refs":[]}]},{"title":"Access","paragraphs":[{"text":"Data curation allows and improves the accessibility and traceability of data. For example, it offers researchers the possibility of integrated research tools through different and heterogeneous data sets, using semantic web technologies. It also allows enrichment of the user interface by improving presentation and display techniques.","refs":[]}]},{"title":"Case studies: BSB","paragraphs":[{"text":"The BSB is following the principle that the quality of access and of data retrieval is fundamentally determined at the stage of producing objects / digital content in the best quality and by adding a complete set of metadata. At the Bayerische Staatsbibliothek, for example, to enhance the visibility and accessibility of digital assets, metadata and/or object data itself aren!t only visible and accessible via the local OPAC, but they are integrated into regional, national and global catalogs and various portals such as:","refs":[]},{"text":"In addition, the BSB participates with the data/metadata of its digitised copyright free holdings on a nationwide network of so called specialised platforms for the single disciplines of science (\"Fachinformationsdienste\"). Another possibility of access is the creation and offer of online / virtual exhibitions.","refs":[]},{"text":"The Museum Galileo Digital Library [1] allows free consultation of the content, except of course for the publications covered by copyright, which can only be consulted from the locations of the Library or remotely, by issuing authorization and relative password. The Digital Library also offers a free lowresolution download service. Some digital collections are also available at portals:","refs":[{"start":35,"end":38,"marker":"bibr","target":"#b0"}]},{"text":"Internet Culturale6 The reading system is characterized by a dual navigation mode that allows the reader to \"browse\" the text or to use a structured index. For some works, the structured index provides links to related resources for in-depth study of the topics. The index constitutes an added value to the publication and, for the cases of stripped works, it is composed automatically. In the interface of the digital library there are other operating keys that also allow the display and searches of documents in textual form. To improve the readability of the text, a zoom can be activated; in addition, a gallery of illustrations can be browsed.","refs":[{"start":18,"end":19,"marker":null,"target":"#foot_5"}]}]},{"title":"Workflow","paragraphs":[{"text":"The workflow, according to the OAIS model, includes all activities and tools from the initial creation of the digital object to the final presentation on the portal or on the digital library platform. The workflow in data curation is iterative and automated: each digital object that is digitized follows an automated workflow with a reduction in time and costs. The system that controls the workflow, or Digital Asset Management System, allows to realize the entire production process with a modular system that can extract data from different service providers. One important aspect of the workflow concerns the quality of the data and its enrichment, to facilitate the reuse.","refs":[]}]},{"title":"Case studies: BSB","paragraphs":[{"text":"The Bayerische Staatsbibliothek has a data curation policy which includes resource management for optimizing employee employment. Considering the large number of digital objects (over 2 million volumes) and above all the necessary migration of numerous sub-collections, which until now have more or less individual software solutions, an improvement in efficiency can only be achieved with standardization and strictly flow-oriented quality control of possibly all work steps in digital production. Each original is scanned once with the best possible quality and high quality and high resolution scanning requires permanent and systematic quality control with the use of the \"Metamorfoze\"7 tool.","refs":[{"start":689,"end":690,"marker":null,"target":"#foot_6"}]}]},{"title":"Mgdl","paragraphs":[{"text":"The Digital Library Management System is a web application developed in house by the Museum Galileo Digital Library for using on the Intranet and managing all stages of the workflow process, from image acquisition to publication in the TECA Digitale. The Digital TECA is an application for the use of digital resources. The STORAGE component is the most critical system in terms of reliability and sustainability.","refs":[]},{"text":"The workflow adopted for Galileo Digital Library requires the collaboration between computer scientists, systems engineers and librarians who design the service in a participatory approach with scholars and researchers. This collaboration has an impact on the acquisition policy, where more attention is paid to qualitative content than to 'quantity' (i.e for selection of object, specific training needs).","refs":[]}]},{"title":"Data representation","paragraphs":[{"text":"Digitization is about the digital representation of cultural heritage objects. It is necessary to model the data packages, i.e. not only texts and images, but different types of objects such as 3D models. It is possible to add value to digital objects, for example through in-depth indexing and incorporation of semantic structured data as Linked Open Data (LODs), and also by creating new contexts and developing new original services. Interoperability makes it necessary to harmonize different conceptual models for particular types of digital objects and at different levels of granularity.","refs":[]}]},{"title":"Case studies:","paragraphs":[]},{"title":"Bsb","paragraphs":[{"text":"To realize the potential of access and representation of information, Bayerische Staatsbibliothek adds a set of metadata as complete as possible (technical-administrative metadata, bibliographicstructural metadata, including a persistent identifier) and uses authority control services where and when ever available. The quality of the volumes scanned by Google is corrected and improved and permanent corrections are made on digital images and / or metadata. Electronic summaries (ToCs) are created and new collection contexts generated (Examples: German Reichstag Minutes + GND ADB / NDB) An essential aspect of data curation is the inclusion of a quality policy and continuous quality control during the production of digital images: the resolution and sharpness of the image, as well as the color management, are essential parameters.","refs":[]},{"text":"In this context, not only the reproduction technique available internally (scanners and digital cameras) is constantly being renewed. In addition to this, other quality assurance measures are taken. One of them is the systematic use of Metamorfoze.","refs":[]}]},{"title":"Mgdl","paragraphs":[{"text":"The Galileo Digital Library is a new generation thematic digital library, which collects texts, images, documents, bibliographic references, chronological repertories, lexicons, thematic indexes, catalogs of objects and experiments, research aids, etc., on every aspect of Galileo's life, cultural activity and fortune. MGDL consists of two systems: Galileo's personal library and Galileo//thek@8 .","refs":[{"start":395,"end":396,"marker":null,"target":"#foot_7"}]},{"text":"Other systems are used for integrating collection of digital resources, such as Sinapsi 9 , for accessing the Leonardo's Library, the Iconographic Collection Portraits of the members of the Georgofili Academy and Bibliotheca Perspectivae (in progress).","refs":[{"start":88,"end":89,"marker":null,"target":"#foot_8"}]},{"text":"Galileo Digital Library has also created many digital born resources, increased by the Multimedia Laboratory and \"Wiki projects\" [3]. A part of the Cumulative Database of MGDL, entitled \"Galileo Museum database: tools, books, photographs, documents\" has been selected for conversion into LOD (and therefore into RDF -Resource Description Framework) [1]. The project MINERV@10 added a dataset of MGDL to Datahub (Open Knowledge Foundation) and to OpenData (Regione Toscana), following the principles of Linked Open Data.","refs":[{"start":129,"end":132,"marker":"bibr","target":"#b2"},{"start":349,"end":352,"marker":"bibr","target":"#b0"},{"start":373,"end":375,"marker":null,"target":"#foot_9"}]}]},{"title":"Re-use","paragraphs":[{"text":"Data curation is essential for the preservation of digital data. Other features include helping in detecting errors, aggregating documentation, ensuring data reusability, and in some cases even adding additional features and files. Reuse is based on the design and evaluation of the interdisciplinary research approach of the human-computer interfaces.","refs":[]},{"text":"Case studies:","refs":[]}]},{"title":"Bsb","paragraphs":[{"text":"The Bayerische Staatsbibliothek makes available new services (like ever gratis) such as \"Data for scientific research\" (Daten für die Forschung / DaFo) and provides for the main part of its (historical copyright free) digitized holdings using IIIF standard11 .","refs":[{"start":256,"end":258,"marker":null,"target":"#foot_10"}]}]},{"title":"Mgdl","paragraphs":[{"text":"The Galileo Digital Library put great attention to interoperability and preservation but this aspect requires further research. Two projects with WIKI and Google are working for the reuse of digital objects [3].","refs":[{"start":207,"end":210,"marker":"bibr","target":"#b2"}]}]},{"title":"Conclusion","paragraphs":[{"text":"Digitization is an important step towards digital transformation and has a huge impact on the organization of cultural heritage institutions and their traditional procedures. In conclusion, we can highlight the following issues on which more research is needed:","refs":[]},{"text":"• Data curation is an ongoing -or rather a never-ending process with always new challengesdue to (changing) technologies, costs and changing -even growing -user needs.","refs":[]}]},{"title":"•","paragraphs":[{"text":"To realize the full potential of access to the digital library, the challenge is to get to know users better and to be able to create a participatory approach and transdisciplinary collaboration.","refs":[]}]},{"title":"•","paragraphs":[{"text":"An essential part of re-use problem solutions is the collaboration not only between data holding institutions, but also the close interaction with the users.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The research analyzes the data curation practices carried out by two digital libraries: the digital library of the Bayerische Statsbibliothek and the digital library of the Museo Galileo. Four lines of data curation activities are analyzed: Access, Workflow, Data representation, Reuse. Some considerations on data curation and the problems that digital libraries need to improve are highlighted.","refs":[]}]}}