{"bibliography":{"title":"Dei Remi Facemmo Ali: \"Improper\" Use of a Course Management System to Build a Digital Library and an Institutional Open Archive","authors":[{"person_name":{"surname":"Antonelli","first_name":"Lucia"},"affiliations":[{"department":"Biblioteca della Direzione Centrale per le Autonomie. Albo nazionale dei Segretari comunali e provinciali -Ministero dell'Interno","institution":null,"laboratory":null}],"email":"lucia.antonelli@interno.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital library","Institutional documents archive","Moodle","Official publications"],"citations":{"b0":{"title":"Open Access: l'accesso aperto alla letteratura scientifica","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Pubblicazioni online della pubblica amministrazione e accesso aperto: stato dell'arte di una casa divisa","authors":[{"person_name":{"surname":"Antonelli","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"AIDA Informazioni","series":null,"scope":{"volume":26,"pages":{"from_page":131,"to_page":144}}},"b2":{"title":"Open Access and Institutional Repositories","authors":[{"person_name":{"surname":"Anderson","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Behavioral and Social Sciences Librarian","series":null,"scope":{"volume":23,"pages":{"from_page":97,"to_page":101}}},"b3":{"title":"L'informazione del settore pubblico per una cittadinanza consapevole","authors":[{"person_name":{"surname":"Ballestra","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":{"DOI":"10.2426/aibstudi-13012","arXiv":null},"target":"https://doi.org/10.2426/aibstudi-13012","publisher":null,"journal":"AIB Studi","series":null,"scope":{"volume":61,"pages":{"from_page":141,"to_page":149}}},"b4":{"title":"Documenti e dati pubblici sul web: guida all'informazione di fonte pubblica in rete","authors":[{"person_name":{"surname":"Cavaleri","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Venturini","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Institutional repositories: content and culture in an open access environment","authors":[{"person_name":{"surname":"Jones","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Documentazione di fonte pubblica. Le biblioteche come servizio per gli amministratori locali, Roma","authors":[{"person_name":{"surname":"Faloci","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":"Associazione Italiana Biblioteche","journal":null,"series":null,"scope":null},"b7":{"title":"A very brief introduction to Open Access","authors":[{"person_name":{"surname":"Suber","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2004","month":"12","day":"29"},"ids":null,"target":"http://www.earlham.edu/~peters/fos/brief.htm","publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"Le biblioteche istituzionali fra isolamento e nuove opportunità","authors":[{"person_name":{"surname":"Venturini","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":{"DOI":"10.1446/9178","arXiv":null},"target":null,"publisher":null,"journal":"Economia della Cultura","series":null,"scope":{"volume":13,"pages":{"from_page":329,"to_page":334}}},"b9":{"title":"L'editoria pubblica in rete tra autonomia e controllo: dal feudalesimo alla 'federazione'?","authors":[{"person_name":{"surname":"Venturini","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":{"DOI":"10.2426/aibstudi-13012","arXiv":null},"target":"https://doi.org/10.2426/aibstudi-13012","publisher":null,"journal":"AIB Studi","series":null,"scope":{"volume":58,"pages":{"from_page":225,"to_page":239}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The Library of the National Register of Municipal Clerks of the Central Directorate for the Autonomies of the Ministry of Interior has been providing its remote users with two digital resources: the Institutional Documents Archive and the Digital Library, both implemented through the Course Management System (CMS) Moodle.","refs":[]},{"text":"Using a CMS for an Institutional Documents Archive or for a Digital Library may seem inappropriate, since there are some specific open source s/w for such stuff. Moreover, it may seem inadequate to define them as \"open access repositories\", especially as regards the Institutional Documents Archive, which lacks some distinctive elements typical of the Open Archives. However, the choice to use or, rather, \"exploit\" Moodle was motivated by several factors:","refs":[]},{"text":"• the immediate availability of an instrument already in use by the institution and well known to users; • the possibility to offer additional documentation within the same virtual environment of the online courses; • the lack of funds available to continue to use the s/w D-space, previously adopted by the library for the management of the former Institutional Open Archive and the Disciplinary Archive (in use from 2007 to 2012). Therefore, between 2014 and 2015, the Institutional Documents Archive was created and released online: it consists of a documents repository freely accessible online that contains the documentation produced by the National Register of Municipal Clerks as part of its activities. Moreover, at the end of 2018 also the Digital Library was released online, allowing direct and free access to a selection of online publications produced by institutions and public bodies.","refs":[]}]},{"title":"The tool: Moodle activity \"database\"","paragraphs":[{"text":"At the very beginning, the choice to use the features of a Course Management System to create an institutional repository of documents and a digital library was not intentional, at all. In fact, the idea happened by chance and in a perfect serendipity spirit. Thanks to the collaboration between the library and the e-learning section of the institution, an almost random discovery of a function called \"database\" caught the attention and intrigued to such an extent that it has led to a deeper knowledge of its characteristics and potential features. All this, combined with the need to find a new tool to make available to users the documentation that was previously managed through D-Space (unfortunately abandoned for lack of funds), led to an attempt to experience an \"unusual use\" of Moodle.","refs":[]},{"text":"In order to make the right decision, a preliminary and not easy reflection was made concerning the opportunity or not to adopt this tool, because there were implications related to the weak respect of the political and technical aspects of a proper Open Access repository. Even though the Moodle activity called \"database\" didn't fully comply with all the Open Access requirements and principles, especially in terms of standards, protocols for metadata harvesting and persistence of identifiers, in the end it was decided to go ahead with an attempt, since the aim of responding to the information needs of users prevailed over everything. However, choosing not to use this tool would have compromised the provision of important services to library users.","refs":[]},{"text":"After a long and accurate analysis of the Moodle activity called \"database\" and a subsequent testing phase, the result was a positive assessment, according to which the benefits were considered to outweigh the inevitable defects that such an instrument entailed. Thus, the Moodle activity \"database\" is properly a tool oriented to teachers and students that allows users to create, view and search for records on a specific topic. The structure of these records may include text, images, files in different formats, hypertext links and other types of fields. Thanks to these features, it was clear that the Moodle activity \"database\" would allow a good level of scalability and adaptability and that it would not be difficult to adapt it to the purpose of the library, providing for appropriate changes and interventions. So, being aware of the limitations of the tool, it was decided to go ahead and create the first database to help users in the search and retrieve documents often required and largely needed: bibliographies, reports, newsletters, normative collections, jurisprudential dossiers, handouts and lecture presentations, and more.","refs":[]}]},{"title":"Database settings","paragraphs":[{"text":"Once it was verified that it was possible a high level of customization of the database according to the information needs of users and after identifying the main types of documents to be included in the Documents Archive, it was necessary to set the database with respect to roles, access modes and other elements connected.","refs":[]},{"text":"First, it was decided that the archive would be managed only by the library, because self-archiving by authors or teachers or others was not easily compatible with the procedures and policies of the institution. Regarding access mode, it was planned that it would be entirely free for everyone: institutional students, library users, scholars, researchers or local administrators. For this reason it was planned that the web link to consult the database should be easily accessible and available both from the home page of the institutional site and from the homepage of the e-learning platform of the National Register of Municipal and Provincial Secretaries. In this way, access to the database would have been allowed both to users accredited to the platform (students of institutional courses) and to external users. As a result, in order to consult the documents (all in PDF format), from the beginning and still today, it is not necessary to have specific credentials or to type any passwords to access the database.","refs":[]},{"text":"All these choices and procedures have been followed for the realization of the Institutional Documents Archive and, subsequently, have been adapted in the design, setting and realization of the Digital Library. The freely online access mode was planned and realized for both databases too.","refs":[]}]},{"title":"Building of the databases","paragraphs":[{"text":"Once database foundations had been set, the structuring phase was the next. Although the structures and some fields of the two databases are different, the procedure in the construction was the same. Identification of fields has been executed, as far as possible, in accordance with some basic elements of the Dublin Core metadata standard: title, subject, creator, publisher, date, type, format. Additional elements have been added, based on the information needs of the users, as well as the general objectives of the two databases, such as: title of the course, location of the course, notes. For each element name, type and related attributes have been established. After the choice of the field structure, the next step involved the design and setting of display models: the management of insertion and modification of records, the template of simple search and advanced search, the display of search results (list and details).","refs":[]},{"text":"For each database, after finishing all the steps related to the setup and building, the cataloguing phase has been finally started, and it continues still at the present.","refs":[]}]},{"title":"The Documents Archive 2","paragraphs":[{"text":"The Institutional Documents Archive1 of the National Register of Municipal Clerks of the Central Directorate for the Autonomies of the Ministry of Interior has been released between 2014 and 2015; it is a documents repository encompassed within the virtual environment of Moodle and contains teaching materials for institutional courses, studies, research, bibliographies, normative dossiers and other type of materials produced.","refs":[{"start":35,"end":36,"marker":null,"target":"#foot_0"}]},{"text":"The repository is constantly updated and currently archives more than 500 documents. The subjects covered by the documents listed in the repository concern the management and legislation of local authorities, local public services and other topics related, in particular, to the activities and role of the municipal clerks.","refs":[]},{"text":"The system allows a simple and an advanced search and the home page presents the documents according to an inverse chronological order. The simple search, presented by default, allows searching for words of the title, author or subject, publisher and more. Advanced search allows combining multiple parameters and presents several filters according to specific and selected criteria.","refs":[]},{"text":"From the very beginning the Documents Archive, has been widely consulted by users, both those registered on the e-learning platform and those not accredited, since, as previously mentioned, the repository is freely accessible on the web. Over the past four years, an annual average of about 14,000 accesses to the repository has been recorded, with a monthly average of about 1,200 accesses.","refs":[]},{"text":"The Documents Archive consultation is very intuitive and the display of the results is simple and clear (Figure 1). Maybe this is the greatest strength of the repository, in addition to its periodic and steady update. However, there are some negative aspects: the system didn't allow the creation of an authority file for authors and subjects and, moreover, the mapping with the basic elements of the DC standard is not complete.","refs":[{"start":112,"end":113,"marker":"figure","target":"#fig_0"}]},{"text":"In a balance between positive and negative aspects, even though this Documents Archive can't be defined a proper \"open archive\" for the reasons stated above, it can be said that it performs similar functions with regard to documents searching and retrieving and in terms of its usage advantage; moreover, its effectiveness is undeniable and the massive access by users confirms its validity.","refs":[]},{"text":"Besides, it is worth emphasizing here another aspect that relates to database management. The collaboration and synergy between the library and the institution to which it belongs have proved to be fundamental strengths for feeding and updating the Documents Archive: close and constant cooperation, which has become more and more established over the years, includes activities that concern not only the online dissemination of institutional documents, but also involves interventions of library staff regarding the care of digital content. First of all, and as far as what has been achieved until today, the formatting of the materials before their publication. Secondly, the library aims to adapt the documents to the accessibility requirements of the current digital administration code and the transparency principles of Italian Public Administrations. The Digital Library2 of the National Register of Municipal Clerks of the Central Directorate for the Autonomies of the Ministry of Interior has been released in 2018; it allows direct access, through hypertext links, to monographs, reports, articles, reports, essays, studies and research produced and published by institutions and public bodies and freely made available online in electronic format.","refs":[{"start":877,"end":878,"marker":null,"target":"#foot_1"}]},{"text":"Also this database is constantly updated and, currently, contains more than 200 documents catalogued. The subjects covered by the documents listed in the Digital Library concern the same topics as the ones used for the Documents Archive, the research criteria and the templates are similar too.","refs":[]},{"text":"An important element of the Digital Library is the search and selection of documents that feed the database. In this sense, the Digital Library enriches the bibliographic resources of the library by expanding the range of services, making official documents in the topics of interest available to users. All the documents cataloged come from updated, official and selected resources, according to the quality of their content, the level of updating, the value and authority of the institution, correspondence with issues and topics of interest to users. In particular, almost all the documents selected and catalogued in the Digital Library come from public administrations; moreover, there are also some open access works produced by commercial publishers. In short, documents are selected only when available freely online. The list of resources from which documents are selected is constantly monitored and periodically updated. It has been chosen not to upload the documents in the Digital Library, but to make them available through hypertext links, both in compliance with the current legislation on copyright, both to avoid weighing down the Moodle system and make the search and retrieval of documents faster. The negative aspect of the use of links is the persistence on the web, which is often not guaranteed; for this reason, periodically a monitoring of the documents links is carried out to verify that they are always active and, if necessary, correct them.","refs":[]},{"text":"The Digital Library is less used than the Documents Archive but it is still widely consulted by library users: over the past four years, an annual average of about 5,300 accesses to the repository has been recorded, with a monthly average of about 450 accesses. The consultation is very intuitive and the display of the results is simple and clear (Figure 2 and Figure 3).  ","refs":[{"start":356,"end":357,"marker":"figure","target":"#fig_1"},{"start":369,"end":370,"marker":"figure","target":"#fig_2"}]}]},{"title":"Conclusion","paragraphs":[{"text":"The actions undertaken in the construction of the Digital Library and the Institutional Documents Archive are aimed at enhancing the institutional and official publications which, in a broader perspective at national level, is part of what is called Public Source Documentation, namely the set of information, data and documents produced by public institutions in the exercise of their various activities. Examples of Public Source Documentation are: normative acts, resolutions, directives and ministerial circulars, but also reports, studies, research, journals, guidelines, teaching materials, statistical collections, bulletins, dossiers. The beneficiaries of public documentation are citizens and institutions, and the tool through which public institutions currently make it available to the community is the web.","refs":[]},{"text":"As regards to the dissemination and online provision of institutional documents, both that produced in-house and that published by other institutions too, the Library of the National Register of Municipal Clerks of the Central Directorate for the Autonomies of the Ministry of Interior has preferred to use the two databases described here rather than a simple list of publications presented in a simple web page. The choice to build the two databases avoided following a line unfortunately very often found on public administration sites, where generic web pages called \"publications\" collect and list, especially chronologically, some official documents published in electronic format: it is clear that this method is certainly ineffective and avoidable. The adoption of the two databases described, although built within a system that is not specifically dedicated, has allowed a strong and structured organization of institutional documents, ensuring a more effective retrieval compared to common online search engines.","refs":[]},{"text":"In this sense, therefore, Dante's quotation to \"turn the wings into oars\" (Inferno, XXVI, v. 125) helps to understand how difficult and risky it was to adapt an \"improper\" tool to the needs of library users. Therefore, since the result achieved is evidently effective, although not perfect and not in line with the dictates of the policies of Open Access, it does not seem inappropriate to say that the choice made was right. Thanks to the mediation of the library, users can easily search and retrieve official documents of interest. Besides, in a broader perspective, the two databases have created the conditions to make the principles of open government more tangible for citizens.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The paper describes how and why the Library of the National Register of Municipal Clerks of the Central Directorate for the Autonomies of the Ministry of Interior has realized two databases within the Course Management System (CMS) Moodle: the Institutional Documents Archive and the Digital library, currently both available freely online. Even if a CMS is by no means the ideal tool to create this type of resources, the choice to use Moodle was made both because a system already in use by the institution for online courses and also because there were no funds available to adopt a specific s/w to implement the two repositories. The experiment of building the two databases, even if they don't fully respect the assumption of Open Access policies, has led to results more effective than expected and has adequately met the information needs of users.","refs":[]}]}}