{"bibliography":{"title":"Digital Cultural Heritage Projects: Opportunities and Future Challenges","authors":[{"person_name":{"surname":"Caffo","first_name":"Rossella"},"affiliations":[{"department":"Union Catalogue of Italian Libraries and Bibliographic Information (ICCU)","institution":null,"laboratory":null}],"email":"rosa.caffo@beniculturali.it"}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.003","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Internet culturale","Access to cultural heritage resources","Culturaitalia","Digital cultural heritage (dch)"],"citations":{},"sections":[{"title":"Internet Culturale: the Portal of the Italian Libraries","paragraphs":[{"text":"The Central Institute for the Union Catalogue of Italian Libraries and Bibliographic Information (ICCU) 1 is an Institute of the Italian Ministry of Cultural Heritage, Activities and Tourism (MiBACT). ICCU manages the National Library Service and union catalogue of over 5,000 libraries, and is responsible for providing the standard rules and regulations for cataloguing all types of materials ranging from manuscripts to multimedia documents. ICCU has extensive experience in digitization standards and guidelines, and collaboration for integrated access to cultural heritage resources; in fact, on behalf of the MiBACT, it coordinates major digital cultural heritage projects at the national level, like Internet Culturale, a project that developed an integrated access portal to the digital resources of Italian libraries, and prestigious Italian cultural institutions, and CulturaItalia, the national cultural portal that functions as the national content aggregator for Europeana 2 .","refs":[]},{"text":"Internet Culturale (IC) 3 has been online since 2005 and promotes knowledge, valorization, and availability of the heritage of the Italian libraries and cultural and research institutions and it offers digital and multimedia resources provided by the participating institutions to deepen specific topics, from literature to science, art, and music. Thanks to IC, the user can search and browse both bibliographic information and digital collections. The portal is a virtual location for searching bibliographic information and digital copies of all the types of material made available by the participating digital libraries. Users can navigate the site using filters, create their own personal library in the members' area, save their searches and send search results via email. IC offers integrated access to the various catalogue databases, such as the National Library Service (SBN -Servizio bibliotecario nazionale, with 12.5 million bibliographic records), along with specialized databases, such as the Census of manuscripts in Italian libraries (Censimento dei manoscritti delle biblioteche italiane -Manus with 250,000 records), the National Census of 16th Century Italian Books (Edit16 with 67,000 records), historical catalogues (215 historical catalogues from 35 libraries) of about 6,600,000 records, multimedia content like virtual exhibitions, 3D itineraries, cultural routes and digital collections. The collections -about 60 of which are already online -make up the Digital Library, with an index of 1 million records and over 10 million associated digital files. This archive is extremely rich in images, text and audio files. The latter are made available by the Central Institute for Sound and Audiovisual Heritage (Istituto centrale per i beni sonori e gli audiovisivi), which makes 30-second samples available free of charge. The Digital Library contains 111 digital collections with:","refs":[]},{"text":"• periodicals: 469,600 • cartography: 29,600 maps • manuscripts: 30,700 • handwritten and printed music scores: 20,000 • sound recordings: 129,500 • pictures: 110,800 • printed texts: 113,400.","refs":[]},{"text":"One of the most prestigious collections in the digital library is the Plutei collection made available by Florence's Biblioteca Medicea Laurenziana, comprising manuscripts from the Medici family's private collection along with texts in Latin and Greek. The collection on geography and cartography, by Venice's Biblioteca Marciana, encompassing works by Corelli, Piranesi and Vasi is also important.","refs":[]},{"text":"There is a special selection of materials in the music sector: the digital collections include musical manuscripts from the most valuable Neapolitan collections, including numerous autographs from the library of the San Pietro a Majella conservatory in Naples; musical manuscripts from the library of the Luigi Cherubini conservatory in Florence, the Girolamini Library in Naples, the library of the Roman Philharmonic Academy, the multi-media library of the Fondazione Accademia Nazionale di Santa Cecilia, and the library of the Fondazione Rossini in Pesaro; miniature choir books from the library of the Abbey of Montecassino; Ars nova fragments from the International Museum of Music in Bologna; miniature music books from Bologna's Archiginnasio; miniature books of San Domenico held in the Biblioteca Augusta of Perugia; 17th century books on dances at the Court of Savoy from Turin's National Library; collections of Gaetano Donizetti's manuscripts from the Mai Civic Library and from the Donizetti Museum in Bergamo; a collection of musical manuscripts by Vivaldi, Benedetto Marcello, Domenico Scarlatti, and Alessandro Stradella; and still more manuscripts and autographs by Italian musicians, especially Verdi and Puccini, held in Italian state libraries and other institutions, such as Ricordi & Company's prestigious Ricordi Archive, which has made available over 8,000 images of sheet music, preparatory sketches, fashion plates, graphic material, stage and performer photographs, letters, and various other documents thanks to an agreement with MiBACT. Parma's Casa della Musica and the International Centre for Music Periodicals (CIRPeM -Centro internazionale periodici musicali) created the digital version of their extensive collection of Italian musical periodicals. Additionally, the Municipality of Parma has helped to research musical life in Parma and its ties to Giuseppe Verdi. In Lucca, a good degree of synergy was established between many of the city's institutions and MiBACT: the State Library, the Luigi Boccherini Music Institute, the State Archive, the Municipal Archive, and the National Committee for Celebrating Puccini joined together to launch digital collection projects dedicated to Giacomo Puccini and musical life in Lucca.","refs":[]},{"text":"\"Explore\" provides five main access points to the IC contents:","refs":[]},{"text":"• digital collections -informative reports on the digital collections and access to the content • itineraries -these merge cultural content with historical, geographical, and scientific content on institutions, documents and digital objects • virtual exhibitions -online exhibitions of equivalent real exhibitions organized by libraries and cultural institutions • 3D itineraries -literary, artistic, scientific and musical events available in 3D","refs":[]},{"text":"• authors and literary works -monographs on Italian writers, scientists and musicians and their works.","refs":[]},{"text":"These contents are also searchable in the \"Themes\" section because all of them, including the internal parts of the digital resources, are indexed according to the Dewey principles. The themes are: graphic materials, photography, handwritten and printed music scores, sound recording. ICCU developed a software package, the so called MagTeca, for the management of digital collections. It is an open system for the storage and dedicated to long-term preservation. It supports the metadata harvesting to Internet Culturale through the OAI-PMH protocol.","refs":[]}]},{"title":"CulturaItalia: the National Content Aggregator","paragraphs":[{"text":"ICCU manages the Portal of Italian Culture, named CulturaItalia 4 , which is the national aggregator that describes digital resources and physical resources pertaining to the whole cultural heritage domain using a specifically conceived Application Profile based on Dublin Core (PICO AP) (see Fig. 1). CulturaItalia presents two different type of content:","refs":[{"start":298,"end":299,"marker":"figure","target":"#fig_0"}]},{"text":"• Metadata which gather and organize the information arriving from the various providers participating in CulturaItalia. At present the portal aggregate more than 2.4 million metadata items. • Editorial articles to bring out the metadata and the digital resources harvested and to describe the content providers; but also news items to inform the users of cultural event and activities.","refs":[]},{"text":"The main goals are to promote the various aspects of Italian culture (e.g. heritage, landscape, cinema, music, literature), to give end users an integrated point of access to Italian cultural heritage, to increase the digitization of cultural contents and to contribute to the building process of Europeana by a national and cross-domain aggregator. CulturaItalia promotes digital resources interoperability, adopting a cross-domain application profile (PICO AP), based on the Dublin Core Metadata Initiative technical guidelines. Internet Culturale is interoperable with CulturaItalia, through an OAI-PMH data provider that gives all the metadata in PICO format to the national aggregator. In this way the resources coming from the libraries are sent to Europeana thanks to CulturaItalia.","refs":[]}]},{"title":"Museum&Web and MOVIO","paragraphs":[{"text":"\"Museo&Web\" is an open source CMS (Content Management System) 5 , produced and funded by MiBACT and coordinated by ICCU, especially devoted to cultural institutions (e.g. museums, libraries, archives) that want to build a website. The importance of this CMS, characterized by modules especially planned for cultural institutions, is that it is designed with the contributions of the cultural institutions participating in the enrichment of the platform by expressing their needs. The diffusion of the kit (which also includes a series of guidelines on how to design websites of cultural institutions) contributes to increasing awareness among the stakeholders of cultural institutions dealing with communication and web publishing on accessibility, usability and quality of cultural websites in general. More than 250 Italian institutions have already built their websites with Museo&Web. It has an integrated OAI-PMH repository with a PICO format that allows the interoperability of the content with CulturaItalia and through it with Europeana. A few hours of training are enough to learn how it runs and how to use it.","refs":[]},{"text":"For cultural institutions ICCU created a new application to develop virtual exhibitions online which was made possible thanks to the MOVIO project 6 co-funded by Fondazione Telecom Italia. Through it, cultural institutions are able to highlight masterpieces of their collections, as well as less known or \"not visible\" works of art. MOVIO developed a tool kit that consists of an open source CMS for the creation of online virtual exhibitions, the equivalent version for mobiles (iPhone, Android for smartphones and iPad), the version of App for popular mobile platforms (iMovio) and online tutorials and trainings.","refs":[]}]},{"title":"Linked Open Data Projects","paragraphs":[{"text":"An important activity carried out by ICCU is publishing Linked Open Data coming from cultural institutions. The first result is the pilot project \"dati.culturaitalia.it\" 7 which started in 2012 to build up a Linked Open Data (LOD) service that is progressively making available open data-sets from CulturaItalia. A first release of the service has been available on-line since 2013 as a section of CulturaItalia dedicated to LOD. It presently makes available as LOD the PICO Thesaurus, adopted by the portal for facilitating the browsing of a variety of resources in its domain, and metadata from the partners. All data are licensed under CC0 1.0 -Universal Public Domain Dedication. More data-sets will continue to be published as LOD as soon as they are delivered under an open license, in agreement with the policies and guidelines recommended by ICCU as maintainer of CulturaItalia and according to the Europeana Data Exchange Agreement (DEA) 8 . The sub-portal dati.culturaitalia.it publishes open cultural data both through a SPARQL endpoint and through an OAI Provider.","refs":[]},{"text":"ICCU started a study for the definition of a data model for publishing OPAC SBN data in Linked Open Data. The study is based on four main steps: Analysis of a basic methodology for creating open linked data from the bibliographic data according to the international standards and cataloguing rules in SBN; drawing the logic scheme relating to bibliographic content, attribution of descriptive, semantic, management metadata; selection of a first set of bibliographic records and export them from OPAC SBN in UNIMARC format; development of namespaces to accommodate UNIMARC element sets and value vocabularies following the FRBR family of models. Once this phase is completed the operational phase will begin, which includes: data conversion into RDF (Resource Description Framework) encoding syntactic basis of the Semantic Web and linked data; developing an interface that allows libraries to connect to the SBN Index, and derive triples that constitute entities of their interest (work, expression), converted to standard formats, and afterwards usable within their catalogue; creation of links to data sets of international open linked data projects: VIAF, Europeana, DBPedia; publication of data in RDF/XML with different modes: with appropriate access URI and URL, through interfaces, SRU, OAI SPARQL Endpoint definition of EP-SPARQL search function for published datasets consultation validation, ensuring the respect of the formats required by the semantic web, and multiple tests on the data set functionality in a manner consistent with the principles and purposes of the semantic web.","refs":[]}]},{"title":"European Projects","paragraphs":[{"text":"ICCU is engaged in European projects relevant to the digitization of cultural heritage resources. It coordinates projects that provide digital cultural content to Europeana, such as Athena, Athena Plus, Linked Heritage, Indicate, DC-Net, DCH-RP and participates in projects such as Europeana Collections 1914-18, Europeana 14-18, Europeana Photography, Europeana Sounds, Europeana Awareness, Partage Plus, Ambriosia.","refs":[]},{"text":"AthenaPlus is building on the successful experience developed by the previous ATHENA, which delivered to Europeana more than 4 million records, mainly from museums, and is currently managing a similar project (called Linked Heritage), which already contributes to Europeana. The best practice network created by AthenaPlus 9 (40 partners from 21 Member States countries, 2 Associate countries and 1 International Observer) is in a strategic position to address this challenge, due to its high institutional value (hundreds of European institutions are involved or associated with the project), the large amount of content made available to Europeana, the powerful services for institutions to be created by the project and the new services for specific communities of users and members of the general public.","refs":[]},{"text":"The principal objectives of the AthenaPlus project are to: • contribute more than 3.6 million metadata records to Europeana focusing mainly on museums content, involving key cultural stakeholders (ministries and responsible government agencies, libraries, archives, leading research centers, SMEs); • improve search, retrieval and re-use of Europeana content; bettering multilingual terminology management, SKOS export and publication tool/API for Content Providers; • experiment with enriched metadata and their re-use adapted for users with different needs (e.g. tourists, scholars) by means of tools that support the development of virtual exhibitions, tourist and teaching applications, to be integrated into Europeana repositories and repositories of national aggregators or individual Content Providers. The AthenaPlus content comes from more than 500 cultural institutions (more than 80% museums). The task of establishing a dialogue and a relationship between the cultural sector, the research sector and the einfrastructures in Europe is a challenging job because they are differently organized from country to country. For this reason, some European Ministries of Culture, governmental agencies and cultural institutions that have been cooperating in the last ten years in the field of digitization of cultural heritage and online access under the leadership of MiBACT, decided to launch a new approach to the DCH sector in order to bring it on the \"wave\" of the e-Infrastructures. The launch of this dialogue was firstly realized with the DC-NET project and then renewed with INDICATE and DCH-RP projects that investigated political and technical domains concerning the relation between the DCH sector and e-Infrastructures.","refs":[]},{"text":"E-Infrastructures offer many benefits to the DCH community, such as stable technical platforms, federated authentication and authorization infrastructure, cost-effective data storage and superior processing power. While the use of e-Infrastructures in the DCH sector has increased in recent years, many cultural bodies remain unaware of the services provided by existing e-Infrastructures at the national and international level and their potential for new services. It is important that the DCH sector effectively exploits their potential in order to maximize the use of resources in the future, increasing the productive efficiency of the services and reducing costs.","refs":[]},{"text":"Digital Cultural Heritage Network (DC-NET): 2009-2011, ERA-NET, involved ministries and national institutes from Italy, Belgium, Estonia, France, Greece, Hungary, Slovenia and Sweden in the coordination of digital CH research programs; DC-NET was extended to Mediterranean partner countries in the INDICATE project (2010)(2011)(2012).","refs":[{"start":315,"end":321,"marker":"bibr","target":null},{"start":321,"end":327,"marker":"bibr","target":null},{"start":327,"end":333,"marker":"bibr","target":null}]},{"text":"Digital Cultural Heritage -Roadmap for Preservation (DCH-RP) is a coordination action supported by the European Commission under the e-Infrastructure Capacities Programme of the Seventh Framework Programme for Research (FP7). The project, lasting two years, aims at developing a Roadmap to implement a preservation infrastructure for digital cultural heritage as a part of a more general vision towards an Open Science Infrastructure for DCH in 2020. The main aims of the project are:","refs":[]},{"text":"• establishing coordination strategy among DCH and e-infrastructure organizations;","refs":[]},{"text":"• definition of a Roadmap + practical tools which would help the monitoring of activities;","refs":[]},{"text":"• developing the Registry of services and tools used by the stakeholder community;","refs":[]},{"text":"• running of concrete Proofs of concept for the actual use of grid and clouds to store cultural digital resources.","refs":[]}]},{"title":"The Italian Presidency of EU","paragraphs":[{"text":"During the Italian Presidency of the Council of the European Union, MiBACT has launched a policy on digitization and online access to cultural heritage as a strong opportunity to foster creative industries and job creation throughout the reuse of digital resources. For this reason the Presidency supports the development of Europeana as a unique access point to European cultural heritage, and the national aggregators that play a fundamental role in ensuring core quality content to the European portal. The Presidency -in line with the vision of the Joint Programme Initiative for Cultural Heritage -aims at pursuing the harmonization of national research programs in the field of tangible, intangible, and digital cultural heritage through the involvement of all stakeholders: researchers, cultural heritage experts and e-infrastructure providers. The goal is to develop an integrated data and service platform in the cultural heritage field that allows the interoperability between various national systems for the management, access, and preservation of digital cultural heritage. To present and discuss the policy on digital cultural heritage, ICCU is organizing two international conferences in Rome:","refs":[]},{"text":"• 2 October 2014: AthenaPlus International Conference with the collaboration of the Europeana Foundation, on \"The reuse of digital cultural content in education, tourism and leisure: an opportunity for cultural institutions and creative industries, an investment for the future\"; • 13-14 November 2014: an International Conference organized in collaboration with the European Commission and ARIADNE Project 13 on \"e-Infrastructure and research infrastructure for DCH to discuss an e-infrastructure composed of services dedicated to DCH\".","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"national level by the Central Institute for the Union Catalogue of Italian Libraries and Bibliographic Information (ICCU), which is an institute of the Italian Ministry of Cultural Heritage, Activities and Tourism (MiBACT).","refs":[]}]}}