{"bibliography":{"title":"Populating Narratives Using Wikidata Events: An Initial Experiment","authors":[{"person_name":{"surname":"Metilli","first_name":"Daniele"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A","institution":"Faedo\" -CNR","laboratory":null}],"email":"daniele.metilli@isti.cnr.it"},{"person_name":{"surname":"Bartalesi","first_name":"Valentina"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A","institution":"Faedo\" -CNR","laboratory":null}],"email":"valentina.bartalesi@isti.cnr.it"},{"person_name":{"surname":"Meghini","first_name":"Carlo"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A","institution":"Faedo\" -CNR","laboratory":null}],"email":"carlo.meghini@isti.cnr.it"},{"person_name":{"surname":"Aloia","first_name":"Nicola"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A","institution":"Faedo\" -CNR","laboratory":null}],"email":"nicola.aloia@isti.cnr.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-11226-4_13","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Ontology","Narratives","Semantic web","Wikidata"],"citations":{"b0":{"title":"An ontology for narratives","authors":[{"person_name":{"surname":"Bartalesi","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"A conceptualisation of narratives and its expression in the CRM","authors":[{"person_name":{"surname":"Bartalesi","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Meghini","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Metilli","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Int. J. Metadata Semant. Ontol","series":null,"scope":{"volume":12,"pages":{"from_page":35,"to_page":46}}},"b2":{"title":"Linked data: the story so far","authors":[{"person_name":{"surname":"Bizer","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Heath","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Berners-Lee","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"IGI Global","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":205,"to_page":227}}},"b3":{"title":"The CIDOC Conceptual Reference Module: an ontological approach to semantic interoperability of metadata","authors":[{"person_name":{"surname":"Doerr","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"AI Mag","series":null,"scope":{"volume":24,"pages":{"from_page":75,"to_page":75}}},"b4":{"title":"Introducing Wikidata to the linked data web","authors":[{"person_name":{"surname":"Erxleben","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Günther","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Krötzsch","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Mendez","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Vrandečić","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-319-11964-9_4","arXiv":null},"target":"https://doi.org/10.1007/978-3-319-11964-9","publisher":"Springer","journal":null,"series":null,"scope":{"volume":8796,"pages":{"from_page":50,"to_page":65}}},"b5":{"title":"Linked data quality of DBpedia, Freebase, OpenCyc, Wikidata, and YAGO","authors":[{"person_name":{"surname":"Färber","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Bartscherer","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Menne","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Rettinger","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Semant. Web","series":null,"scope":{"volume":9,"pages":{"from_page":1,"to_page":53}}},"b6":{"title":"DBpedia-a large-scale, multilingual knowledge base extracted from wikipedia","authors":[{"person_name":{"surname":"Lehmann","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Semant. Web","series":null,"scope":{"volume":6,"pages":{"from_page":167,"to_page":195}}},"b7":{"title":"Entity linking with a knowledge base: issues, techniques, and solutions","authors":[{"person_name":{"surname":"Shen","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Wang","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Han","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IEEE Trans. Knowl. Data Eng","series":null,"scope":{"volume":27,"pages":{"from_page":443,"to_page":460}}},"b8":{"title":"YAGO: a core of semantic knowledge","authors":[{"person_name":{"surname":"Suchanek","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Kasneci","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Weikum","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":697,"to_page":706}}},"b9":{"title":"Wikidata: a free collaborative knowledgebase","authors":[{"person_name":{"surname":"Vrandečić","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Krötzsch","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Commun. ACM","series":null,"scope":{"volume":57,"pages":{"from_page":78,"to_page":85}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Currently, Digital Libraries (DLs) offer search functionalities that respond to a user's web-like query with a list of digital objects based only on their metadata descriptors. We believe that DLs should be able to provide narratives to their users in addition to lists of objects. We intend narratives as sequences of events defined by a narrator, endowed with factual aspects (who, what, where, when) and semantic relations. Narratives would allow DLs to provide more sophisticated information services to their users, going beyond the current state.","refs":[]},{"text":"In order to introduce narratives in DLs, we developed an ontology to formally represent narratives [2], based on the CIDOC CRM standard [4]. Subsequently, we built a semi-automated Narrative Building and Visualising Tool (NBVT) 1 , which allows the user to construct a narrative as a sequence of events. The tool has been used to construct four narratives2 about different subjects: the life of Florentine poet Dante Alighieri, the life of Austrian painter Gustav Klimt, the history of the giant squid, and the history of climate change.","refs":[{"start":99,"end":102,"marker":"bibr","target":"#b1"},{"start":136,"end":139,"marker":"bibr","target":"#b3"},{"start":355,"end":356,"marker":null,"target":"#foot_0"}]},{"text":"While building the narrative in NBVT, the user can add to each event some entities (e.g. people, places, objects) related to the subject of the narrative. These entities can be automatically imported from the Wikidata3 knowledge base. Wikidata is a collaborative project hosted by the Wikimedia Foundation [10]. Containing more than 50 million entities, it is one of the largest generalpurpose knowledge bases. In order to facilitate the user's work when building a narrative, we developed a mapping between our ontology and the Wikidata ontology which can be applied to import entities and events into our tool [1].","refs":[{"start":217,"end":218,"marker":null,"target":"#foot_1"},{"start":306,"end":310,"marker":"bibr","target":"#b9"},{"start":612,"end":615,"marker":"bibr","target":"#b0"}]},{"text":"Unfortunately, the number of events (instances of the class Q1190554 Occurrence) contained in the knowledge base is relatively low, because Wikidata's ontology is not event-based. The knowledge about events is present in Wikidata, but it is generally represented in an implicit way. For instance, the birth of the Florentine poet Dante Alighieri is not represented as an event \"Birth of Dante Alighieri\", but instead the knowledge base contains a statement of the form \"Dante Alighieri place of birth Florence\" which directly links the poet to the city he was born in.","refs":[]},{"text":"To solve this issue, we have decided to extract the events implicitly contained in the knowledge base, generating a graph that we call the Wikidata Event Graph (WEG). This graph can then be used to import events into NBVT in order to populate our ontology for narratives.","refs":[]},{"text":"In the following, we present the generation of a subset of the WEG focused on events about people's lives, and an initial experiment to verify how much the events contained in it can improve the narrative building process. Section 2 describes our reasons for choosing Wikidata as reference knowledge base. Section 3 describes the extraction of the event graph from Wikidata. Section 4 describes the initial experiment about the narrative of Dante's life, and its results. Finally, Sect. 5 reports our conclusions and future works.","refs":[]}]},{"title":"Wikidata as Reference Knowledge Base","paragraphs":[{"text":"In our formal representation, a narrative consists of three main elements: (i) fabula, i.e. the sequence of events in chronological order, (ii) narration(s), i.e. one or more texts that express the narrative, and (iii) reference function that connects the narrations to the fabula, allowing the derivation of the plot. In the fabula, each event is endowed with entities such as people, places, and physical objects. When representing such events and entities through Semantic Web technologies, it is good practice to re-use IRIs (Internationalized Resource Identifiers) from existing knowledge bases, when possible [3].","refs":[{"start":615,"end":618,"marker":"bibr","target":"#b2"}]},{"text":"In order to import existing IRIs into our ontology and our tool, we investigated three of the most popular knowledge bases: Wikidata, DBpedia [7], and YAGO [9]. A recent study has compared the quality of these knowledge bases4 according to various metrics [6]. The results of this study highlight that Wikidata is the top-rated knowledge base on the average of the considered metrics, with especially high scores on trustworthiness, consistency, timeliness, relevancy, and licensing. On the basis of these results and of an analysis we performed, we chose Wikidata as reference knowledge base, for the following reasons:","refs":[{"start":142,"end":145,"marker":"bibr","target":"#b6"},{"start":156,"end":159,"marker":"bibr","target":"#b8"},{"start":225,"end":226,"marker":null,"target":"#foot_2"},{"start":256,"end":259,"marker":"bibr","target":null}]},{"text":"-it contains the largest number of entities (currently more than 50 million) when compared to the other knowledge bases; -it is compatible with Semantic Web technologies such as RDF(S), OWL, and SPARQL [5]; -it is fully multilingual, with more than 39% of the entities having labels in multiple languages; -it aims to collect not just statements about entities, but also the primary sources behind those statements (referenced statements are currently more than 75% of the total); -it is fully integrated into Wikipedia and other Wikimedia projects, such as Wikimedia Commons, from which we can easily import non-structured data such as text and images; -it adopts a Creative Commons Zero5 license, equivalent to the public domain, making it easier to re-use the knowledge contained in it.","refs":[{"start":202,"end":205,"marker":"bibr","target":"#b4"},{"start":688,"end":689,"marker":null,"target":"#foot_3"}]},{"text":"Notice that Wikidata also has a significant potential downside when compared to the other knowledge bases, i.e. its open and collaborative nature, similar to that of Wikipedia. The users of Wikidata can freely add and edit knowledge, including the class hierarchy, thus altering the ontology in unpredictable ways. However, both humans and bots frequently check the ontology for errors that can be due to users' mistakes or deliberate acts of \"vandalism\", and correct them.","refs":[]}]},{"title":"The Wikidata Event Graph","paragraphs":[{"text":"Ideally, a suitable knowledge base for our purposes should contain: (i) historical entities such as people, places, and physical objects (ii) historical events connecting those entities. However, in most existing knowledge bases, including Wikidata, events are often represented in an implicit way. For instance, the knowledge base currently contains 4.52 million entities about people, but only 6,360 events of type \"death\", because most people's deaths are expressed implicitly through properties such as P570 date of death.","refs":[]},{"text":"Many historical events, such as World War II, are represented explicitly in Wikidata, but they make up just 3% of the total number of entities. This is still a significant number overall (1.92 million)6 , but it is not enough for our purposes because in our ontology all events are represented explicitly. Indeed, in the four narratives (see footnote 2) that were developed using our tool, the percentage of events that could be directly matched to Wikidata was less than 2%. This is significantly less than the percentage of related entities that could be found in Wikidata (69%).","refs":[{"start":201,"end":202,"marker":null,"target":"#foot_4"}]},{"text":"In our view, the solution to this problem is the generation of what we call the Wikidata Event Graph (WEG), i.e. the Wikidata graph augmented with an explicit representation of all events implicitly expressed in it. Generating this graph would allow us to reference the events from our ontology and import them into our tool, offering the user a much more complete coverage of historical events.","refs":[]},{"text":"In order to extract the WEG, we analysed all Wikidata properties7 and compiled a list of the ones that, in our opinion, express implicit events. For instance, the property P570 date of death expresses an event of type \"death\".","refs":[{"start":64,"end":65,"marker":null,"target":"#foot_5"}]},{"text":"We developed and implemented an algorithm that allows recognizing Wikidata properties that do not express events. From the current total of 5,234 properties, the algorithm removed several properties based on the following criteria:","refs":[]},{"text":"1. the type of the property, i.e. meta-properties, properties that connect entities to other Wikimedia projects, obsoleted and deprecated properties, properties classified as \"Wikidata property for an identifier\", which simply link a Wikidata entity to an identifier in another knowledge base (for instance, the property P214 VIAF ID connecting an individual to its representation in the Virtual International Authority File8 ); 2. the datatype of the property's range literal, i.e. Web pages (datatype URL), numerical quantities (datatype Quantity), geographical features (datatypes GeoShape and GlobeCoordinate), media (datatype CommonsMedia), external IDs (datatype ExternalId), tabular data (datatype TabularData), and Wikidata properties (datatype WikibaseProperty).","refs":[{"start":424,"end":425,"marker":null,"target":"#foot_6"}]},{"text":"At the end of this process, we obtained a list of about 1,000 candidate properties that could potentially express implicit events. Most of these (265) were applied to works, 158 were applied to people, 119 were applied to organisations, and the remaining ones were applied to other types of entities. In order to implement a case study, we decided to focus on the 158 properties about people. This would allow us to use as test case one of the narratives that had been previously constructed with our tool, i.e. the one about the life of Dante Alighieri9 . ","refs":[{"start":553,"end":554,"marker":null,"target":"#foot_7"}]}]},{"title":"An Initial Experiment","paragraphs":[{"text":"To perform our initial experiment, we ordered the list of 158 Wikidata properties obtained in the previous step by usage in the knowledge base. Among the most used, we selected the first 50 that clearly expressed events about a person's life. The list of 50 properties we considered is reported in Table 1.","refs":[{"start":304,"end":305,"marker":"table","target":"#tab_0"}]},{"text":"We developed a software that, through the Wikidata Query Service 10 , automatically extracts all events that were expressed implicitly by the properties of Table 1 from the Wikidata graph. As expected, the number of birth events is the most numerous (4.52 million), since every person has a birth. The second most numerous type of event is occupation (3.31 million), followed by death (1.65 million). The total number of events contained in the subset of the WEG that we generated is 11.71 million, thereby increasing the number of Wikidata events that can be linked from our tool by more than 600%.","refs":[{"start":162,"end":163,"marker":"table","target":"#tab_0"}]},{"text":"The software removes duplicate events, i.e. identical events that can be extracted more than once through multiple properties, by applying the following criteria implemented using rules:","refs":[]},{"text":"1. if two entities are linked by a direct property and also by inverse, e.g. the properties P802 student and P1066 student of, the two events extracted from the properties are merged; 2. if two entities are linked by a symmetric property, e.g. P26 spouse, in both directions, the two resulting events are merged; 3. when two properties express the same event, e.g. if the property P569 date of birth and the property P19 place of birth are applied to the same person, the two resulting events are merged.","refs":[]},{"text":"In the first version (see footnote 10) of the narrative of the life of Dante Alighieri constructed using our tool, only one of 53 events (the Battle of Campaldino) was present in Wikidata as instance of the class Q1190554 Occurrence. After generating the WEG, we identified in it 31 more events that were present in the narrative. Therefore, the percentage of events in the narrative that could be automatically detected in Wikidata has increased from 1.9% (1 event) to 60.4% (32 events).","refs":[]},{"text":"Major events such as the birth of Dante, the writing of the Divine Comedy, and the election of Pope Boniface VIII are all contained in the WEG, despite not being explicitly present in Wikidata as instances of the class Q1190554 Occurrence. Furthermore, the WEG contains 99 more events about Dante's life that are not present in the narrative built using our tool. Many of these are minor events, e.g. the writing of a sonnet, but it can still be useful to propose them to the user during the narrative building process.","refs":[]},{"text":"We consider these results very promising, and anticipate that the coverage can be improved further by including more properties in our study. Furthermore, as more knowledge is added to Wikidata every day, the number of events in the WEG will increase.","refs":[]}]},{"title":"Conclusions and Future Works","paragraphs":[{"text":"In this paper we have presented an initial study on the population of formal narratives through the import of events from the Wikidata knowledge base. We have analysed all Wikidata properties and used a subset of them to generate the Wikidata Event Graph (WEG), i.e. the graph of events that are expressed in an implicit way in the knowledge base.","refs":[]},{"text":"As study, we have taken into account one of the narratives that were built using our Narrative Building and Visualising Tool (NBVT), i.e. the life of Florentine poet Dante Alighieri. For this reason, we have focused on the detection of events about people's lives from Wikidata. Furthermore, we have generated a subset of the WEG containing 11.71 million events related to people's lives, thereby increasing the number of Wikidata events that can be linked from our tool by more than 600%. From this subset of the WEG we have extracted a subgraph of events related to the life of Dante, allowing us to increase the number of events that could be automatically detected in Wikidata from 1.9% (1 event) to 60.4% (32 events).","refs":[]},{"text":"As future work, we plan to take into account other Wikidata properties related not only to people's lives but also to other topics of narratives such as scientific experiments and historical events, and generate a larger subset of the WEG from these properties. In order to perform a preliminary evaluation of our approach, we are also working to automatically extract events from Wikidata related to the other narratives that have been constructed using our tool.","refs":[]},{"text":"Another issue that we aim to study is how to automatically identify events related to the subject of the narrative and propose them to the users for import in their narratives. In addition, we are currently investigating automatic narrative extraction from text. We believe that the WEG will prove very useful in this context, in particular to increase the recall of entity linking algorithms [8] applied to narrative texts.","refs":[{"start":393,"end":396,"marker":"bibr","target":"#b7"}]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Wikidata properties expressing implicit events about people's lives.","rows":[["Event type","Property ID Property name","Number of events"],["Baptism","P1290","godparent","1,840"],["","P1636","date of baptism",""],["Birth","P19","place of birth","4,519,957"],["","P22","father",""],["","P25","mother",""],["","P40","child",""],["","P569","date of birth",""],["Creation","P50","author","546,048"],["","P57","director",""],["","P58","screenwriter",""],["","P61","discoverer or inventor",""],["","P84","architect",""],["","P86","composer",""],["","P87","librettist",""],["","P110","illustrator",""],["","P161","cast member",""],["","P170","creator",""],["","P178","developer",""],["","P800","notable work",""],["Death","P20","place of death","1,651,865"],["","P157","killed by",""],["","P509","cause of death",""],["","P570","date of death",""],["","P1196","manner of death",""],["Education","P69","educated at","763,823"],["","P184","doctoral advisor",""],["","P185","doctoral student",""],["","P512","academic degree",""],["","P802","student",""],["","P812","academic major",""],["","P1066","student of",""],["Election","P726","candidate","25,775"],["","P991","successful candidate",""],["","P3602","candidacy in election",""],["Foundation","P112","founder","22,359"],["Marriage","P26","spouse","94,726"],["Membership P54","member of sports team","712,299"],["","P102","member of political party",""],["","P463","member of",""],["Occupation P6","head of government","3,310,621"],["","P35","head of state",""],["","P39","position held",""],["","P106","occupation",""],["","P108","employer",""],["","P210","party chief representative",""],["","P286","head coach",""],["","P803","professorship",""],["","P1075","rector",""],["Residence","P263","official residence","60,372"],["","P551","residence",""]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"The study presented in this paper is part of our research aimed at improving the search functionalities of current Digital Libraries using formal narratives. Narratives are intended as sequences of events. We present the results of an initial experiment to detect and extract implicit events from the Wikidata knowledge base in order to construct a narrative in a semi-automatic way. Wikidata contains many historical entities, but comparably few events. The reason is that most events in Wikidata are represented in an implicit way, e.g. by listing a date of birth instead of having an event of type \"birth\". For this reason, we decided to generate what we call the Wikidata Event Graph (WEG), i.e. the graph of implicit events found in Wikidata. We performed an initial experiment taking as case study the narrative of the life of Italian poet Dante Alighieri. Only one event of the life of Dante is explicitly represented in Wikidata as instance of the class Q1190554 Occurrence. Using the WEG, we were able to automatically detect 31 more events of Dante's life that were present in Wikidata in an implicit way.","refs":[]}]}}