{"bibliography":{"title":"European Libraries and Their Virtual Users: How the Pandemic Affected Digital Production and Participation","authors":[{"person_name":{"surname":"Tartari","first_name":"Maria"},"affiliations":[{"department":null,"institution":"IULM University","laboratory":null}],"email":null},{"person_name":{"surname":"Giorgio","first_name":"Sara"},"affiliations":[{"department":null,"institution":"ICCU","laboratory":null}],"email":null},{"person_name":{"surname":"Prandoni","first_name":"Claudio"},"affiliations":[{"department":null,"institution":"ICCU","laboratory":null}],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital heritage","National libraries","Digital cultural participation","Social networks"],"citations":{"b0":{"title":"Digital Transformation and the Libraries in Extraordinary Circumstances","authors":[{"person_name":{"surname":"Garcia-Febo","first_name":"L"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"https://blogs.ifla.org/cpdwl/2021/10/05/digital-transformation-and-the-libraries-in-extraordinary-circumstances/","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"The value of mass-digitised cultural heritage content in creative contexts","authors":[{"person_name":{"surname":"Terras","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Coleman","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Drost","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Elsden","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Helgason","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Lechelt","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Osborne","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Paneels","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Pegado","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Schafer","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Smyth","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Thornton","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Speed","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":{"DOI":"10.1177/20539517211006165","arXiv":null},"target":null,"publisher":null,"journal":"Big Data and Society","series":null,"scope":{"volume":8,"pages":null}},"b2":{"title":"Pro, Building Digital Capacity","authors":[],"date":{"year":"2021","month":"04","day":"19"},"ids":null,"target":"https://pro.europeana.eu/page/building-digital-capacity#step-2-defining-digital-transformation","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The aim of the present research paper is to analyse the digital presence and behaviour of the European National Libraries and of their users on the most important social media, namely Facebook and Instagram, in a time window that covers the period before and during the Covid-19 pandemic. We are interested in monitoring the National Libraries quantitative and qualitative level of digital activity in correlation with the forced wave of digitization led by the social-distancing policies and we want to understand if, in the context of the Covid crisis, audiences already characterised by high levels of cultural access and participation further increase their levels of access and, if so, to what extent and in which way, and how this feeds back on the content provision strategies of cultural institutions themselves. This research is conducted in the framework of the inDICEs project that is developing an Open Observatory , that offers tailored participatory space, where institutions will find the tools to exchange expertise on the implementation of digital workflow models, policy and legal recommendations. inDICEs gathers and analyses data in order to detect trends regarding the levels of digital cultural participation of the most used social network sites. The results will be used for delivering For analysing the social media pages of each National Libraries we utilised CrowdTangle, a content discovery and analytics platform designed to provide content creators with the data and insights they need. CrowdTangle Intelligence gives researchers a way to monitor the performance of a social channel over time, as well as to directly benchmark it against other accounts. Long-term performance figures can help publishers detect overall trends and more easily analyse what content is working and what is not. Intelligence allows us to monitor up to 100 social accounts (on any of our platforms including Facebook, Instagram, Twitter and Reddit) and see overall account-level statistics over time with graphs and charts. This tool then allows easy comparison of the accounts next to each other and to export the whole analytics for further use. We here investigated the following metadata: Country; Month of publication; Type of relation between users and CHI as to cultural production impact; Form of content sharing (Photos, Links, Statuses, Facebook Videos, Facebook Live, YouTube Videos, Other Videos, Albums, IG Videos, IGTV).","refs":[]},{"text":"Instagram and Facebook have been chosen as the two most widely used and demographically heterogeneous social platforms; moreover, the latest is the World's most used social platform. Indeed, according to the \"We are social\" report (2021), at the European level, the number of active social media users compared to the total population is between 79 and 72 %. Moreover, both the comparison and the juxtaposition of the two social platforms is meaningful because the percentage of users overlapping (ages 16 to 64) is between 85.5 and 74.8%. The average age of Facebook users is slightly higher. Data has been collected from July 2019 to July 2021, aggregated per month. In the following paragraph, we described the graphs related to the follower growth, the total number and the rate of interaction, and the total views.","refs":[]}]},{"title":"Data Analyses","paragraphs":[]},{"title":"Instagram analysis","paragraphs":[{"text":"Follower Growth (Figure 1) The trend reveals a 105% growth and two different peaks: the first one during spring 2020 and the second one during fall 2020.","refs":[{"start":24,"end":25,"marker":"figure","target":"#fig_0"}]},{"text":"Total Interactions (Figure 2) \"Photo\" is the most important and engaging type of content. The trend shows a big increase in the interactions during 2021, with a peak that begins to mount in the fall 2020, namely during the second lockdown period.","refs":[{"start":27,"end":28,"marker":"figure","target":"#fig_1"}]},{"text":"Interaction rate (Figure 3): The Interaction Rate is calculated by adding up all the interactions on every post from every account in the list (suitably weighted), and then dividing it by the number of posts and by the average size. As the previous graph shows, while content posted increased, the interaction rate diminished over time, revealing a decline in user interest.","refs":[{"start":25,"end":26,"marker":"figure","target":"#fig_2"}]},{"text":"Total views (Figure 4): Videos are the most viewed content, with more than 2 millions views (both videos and IGTV) per only around 500 posts published in two years per category. Also here we can find three different peaks: spring 2020, fall 2020 and winter 2021.    ","refs":[{"start":20,"end":21,"marker":"figure","target":"#fig_3"}]}]},{"title":"Facebook","paragraphs":[{"text":"Follower Growth (Figure 5): Here the time window is slightly reduced if compared with the data available for Instagram. For Libraries, the trend reveals two different peaks: the first one during spring 2020, and the second one during fall 2020. This is probably due to the pandemic-related public health measures (such as lockdowns and \"stay at home\" campaigning). Nevertheless, the growth of followers is still ongoing and this could point out a large, permanent effect on social media users which is of particular interest.","refs":[{"start":24,"end":25,"marker":"figure","target":"#fig_4"}]},{"text":"Total interactions (Figure 6): Total interactions represent the sum of different social media actions, such as likes, comments or reactions to a post. Also from this point of view, the trend reveals three different peaks, namely the spring and fall of 2020 and winter 2021. Photo is by far the most engaging type of content, followed by videos and external links.","refs":[{"start":27,"end":28,"marker":"figure","target":null}]},{"text":"Total Views (Figure 7): The chart represents a simple count of how many times a video is viewed. As we can see, the time series shows three distinct peaks in video views, namely January 2020, May 2020 and September 2020. Interestingly, the first of them, which is also the highest, precedes the pandemic crisis. This pattern cannot therefore merely be attributed to changes in users' choices related to the new situation created by the pandemic.","refs":[{"start":20,"end":21,"marker":"figure","target":"#fig_5"}]},{"text":"Interaction rate (Figure 8): The graph line is pretty erratic for the whole two years. Here also we can find three peaks, namely spring 2020, fall 2020 and winter 2021, mainly referred to Facebook videos and Live streaming.    ","refs":[{"start":25,"end":26,"marker":"figure","target":"#fig_6"}]}]},{"title":"Results","paragraphs":[{"text":"From what we could observe by the data analyses, we can gain two main significant pieces of information. The first main result is that we can observe how the pandemic has accelerated digital content production and interaction of the European National Libraries analysed. The pandemic has led to a substantial extra effort in Instagram digital interaction by Libraries to reach out to their users. Indeed, it is clear how the peaks of interaction correspond to the lockdown periods, and this correlation can be meaningful if we think about the impact of the Covid-19's forced digitization of both content production and access.","refs":[]},{"text":"The second main result is that European National Libraries' social network users do not interact actively with the online cultural content shared by such institutions. Indeed, by relating the follower growth graph and interaction rate graph, we can observe the level of active participation of the European National Libraries' social network users; indeed, if the number of followers grows and the interaction rate remains stable, this means that the new followers interact in ways that do not differ substantially from those of previous users, and therefore engagement campaigns targeting new visitors have worked. In the opposite case, if the number of followers grows and the interaction rate drops, it is plausible to conclude that the new followers are inactive and only the hardcore of already registered and active users continues to really interact. In our samples, despite a constant follower growth, the interaction rate decreases: this may imply a lack of interest from users or a large share of inactive/non-engaged public, which can be related not only to the type of content produced but also to the production practises themselves, that need to become more horizontal and to exploit in a more inclusive and substantial way the potential of the digital platforms. Either way, it reflects the general overproduction of digital content in the pandemic months. Facebook users were probably already engaged and active, which may mean that Libraries, which represent a point of reference for their local communities, maintain a strong relationship with their community also digitally. Compared with Instagram, there is a higher interaction with Facebook users, which could be related to the fact that such users are probably older compared to those of other social media. With much less effort (7.6k Instagram vs 28.4k Facebook total posts) the total growth of Instagram reached 104% compared to 18% of Facebook. We can imagine that the Facebook users were already engaged, or that Instagram is the preferred channel for users to reach out to their National Libraries.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"The analyses conducted in the present article generally show a significant increase in the online activities of the social media pages of the cultural institutions surveyed. In particular, the pandemic and the forced closure of physical activities seem to have been particularly beneficial to the growth of the followers of several institutions that worked on their digital outreach. From this point of view, however, it is not yet clear if in the long term the effect will stay positive or, instead, it will eventually die out. Some signs of a likely continued growth can be seen, but further monitoring is necessary to understand more. It is necessary for the Library sector to better enable people to actively participate in meaningful sense-making virtual processes, to exploit the possibilities that the digital platforms can offer in terms of co-creation processes, digital community empowerment, development of new soft skills and shared knowledge resources. The low rate of active interaction of users with digital cultural content and the still too low level of engagement with cultural institutions can reflect forms of cognitive poverty and deprivation, which often strongly correlate with other socio-economic deficiencies.","refs":[]},{"text":"Since National Libraries and cultural heritage institutions started engaging with large-scale digitization projects, it has become relevant to implement integrated, data-driven digital workflows and strategies in order to make the most out of digital assets [2]. It soon became clear isolated projects with digital collections often result in momentary engagement and require deeper organisational and leadership changes to deliver sustainable impact to target communities. Finally, our findings are relevant as the cultural heritage sector moves into post-COVID-19 online operationalising. As a result, inDICEs, thanks to its research and its Observatory will support cultural institutions in embracing digital transformation [3].","refs":[{"start":258,"end":261,"marker":"bibr","target":"#b1"},{"start":727,"end":730,"marker":"bibr","target":"#b2"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"In the present article, we analyse the digital activity and behaviour of the European National Libraries and of their users on the most important social media, namely Facebook and Instagram, in a time window that covers the period before and during the Covid-19 pandemic. This activity was carried out within the framework of the Horizon 2020 European inDICEs project 1 which aims to support libraries, museums and archives in developing digital strategies to experiment with engagement strategies driven by digital collections. The project is developing an Open Observatory, where GLAM professionals as well as creative industries, policy makers and researchers can find and analyse data on digital heritage accessibility and reuse, and explore case studies on novel value chains. In the article we present a specific use case based on National Libraries, which in the cultural heritage sector are among the most active institutions in digital services policies. Our aim is to understand how the Covid 19 pandemic has impacted the sector. After monitoring the National Libraries quantitative and qualitative level of digital activity in correlation with the forced wave of digitization led by the social-distancing policies, we have given a synthetic overview of the main findings, which regard, on one hand, a significant increase in online activities and followers of the social media pages in correspondence to the lockdown periods; on the other hand, we have observed passive participation of their users, with whom the institutions have shown they are unable to establish an active relationship, missing the chance to exploit the possibilities that the digital platforms can offer in terms of co-creation processes, digital community empowerment, development of new soft skills and shared knowledge resources.","refs":[]}]}}