{"bibliography":{"title":"Digital philology in audio long-term preservation: A multidisciplinary project on experimental music","authors":[{"person_name":{"surname":"Bressan","first_name":"Federica"},"affiliations":[],"email":"federica.bressan@dei.unipd.it"},{"person_name":{"surname":"Canazza","first_name":"Sergio"},"affiliations":[],"email":null}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.010","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Methodology","Sound archive","Digital philology","Preservation"],"citations":{"b0":{"title":"Text Comparison and Digital Creativity -The Production of Presence and Meaning in Digital Text Scholarship","authors":[{"person_name":{"surname":"Van Peursen","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Brill","journal":"Scholarly Communication","series":null,"scope":{"volume":1,"pages":{"from_page":1,"to_page":28}}},"b1":{"title":"The Language of New Media","authors":[{"person_name":{"surname":"Manovich","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":null},"b2":{"title":"IASA-TC 04: Guidelines on the Production and Preservation of Digital Objects","authors":[],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"IASA Technical Committee","journal":null,"series":null,"scope":null},"b3":{"title":"A systemic approach to the preservation of audio documents: Methodology and software tools","authors":[{"person_name":{"surname":"Bressan","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Canazza","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Electrical and Computer Engineering","series":null,"scope":{"volume":null,"pages":{"from_page":21,"to_page":21}}},"b4":{"title":"Authenticity and provenance in long term digital preservation: Modeling and implementation in preservation aware storage","authors":[{"person_name":{"surname":"Factor","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Henis","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Naor","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Rabinovici-Cohen","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Reshef","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Michetti","first_name":"Ronen"},"affiliations":[],"email":null},{"person_name":{"surname":"Guercio","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Pavarotti sings again: A multidisciplinary approach to active preservation of the audio collection at the Arena di Verona","authors":[{"person_name":{"surname":"Bressan","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Canazza","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Rodà","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Bertani","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Fontana","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of New Music Research","series":null,"scope":{"volume":42,"pages":{"from_page":364,"to_page":380}}},"b6":{"title":"REWIND: Simulazione di un'esperienza d'ascolto storicamente fedele di dischi fonografici digitalizzati","authors":[{"person_name":{"surname":"Pretto","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Canazza","first_name":"S"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Computer based technology has been changing the way we perceive reality in many ways, including the ways we access information and build our knowledge of the world. However, the way in which inscriptions are photographed and text corpora are transcribed and encoded, as well as the way in which a sound recording is re-mediated (the process of transferring the acoustic information from a medium onto another medium), \"is crucial for the way in which these research objects will be studied in the future\" 1 . In other words, the digital representation of data (the bit stream) and the organization and presentation of the data (the cultural interfaces 2 ) are not neutral with respect to the final perception that users have of the 'real' or 'original' object, which may often not be available for comparison.","refs":[{"start":505,"end":506,"marker":"bibr","target":"#b0"}]},{"text":"Unlike the field of text encoding, analysis and philology, where a longer tradition provides ascertained references to scholars and researchers, the field of audio documents long-term preservation is relatively new and it lacks a similar background of knowledge and experience. To clarify this point, it is enough to think that audio documents have gained the status of documentary sources only recently, and that it is not uncommon to consider texts and icons as first class sources and sound recordings as second class sources. With the multiplication of digitised and born digital sources/documents, the definition of specific criteria for digital philology has become an urgent matter, both for texts and sound.","refs":[]},{"text":"The philological activity of text comparison goes back to Antiquity: one of the means to compare texts was to present them in parallel columns, as shown in Figure 1(a). For example, Origen's third-century Hexapla presented six versions of the Old Testament (including the Hebrew text, a transliteration of the Hebrew in Greek characters, and four Greek translations) in parallel alignment. What can be the digital equivalent of text comparison for audio? Are we sure what we mean by the term 'text' in audio? Figure 1(b) shows a possible way to compare an audio feature in three different versions of the same recording: are researchers in the area of the humanities trained to read this kind of data presentation? And if we agree that the definition of 'text' should not be limited to the audio signal (such is the authors opinion), how should the complex multimedia digital object (the preservation copy or archive master for preservation) be assembled so that it can make sense to compare it with another created and stored in a different archive?","refs":[{"start":163,"end":164,"marker":"figure","target":"#fig_0"},{"start":516,"end":517,"marker":"figure","target":"#fig_0"}]},{"text":"Sound recordings have proved to be irreplaceable primary sources for disciplines such as linguistics, musicology, ethnomusicology, sociology and many more. The Centro di Sonologia Computazionale (CSC) in Padua has been active in the field of audio preservation and restoration for nearly two decades, building on a strong scientific background in sound synthesis and electronic music since the 1970s. The CSC houses a laboratory with the necessary equipment to create digital preservation copies 3,4 that meet the requirements of accuracy, reliability and authenticity 5,4 . This goal is achieved in good part thanks to original open-source software developed on purpose at the CSC 4 , as well as with the multidisciplinary collaboration that distinguishes the methodology for audio preservation of the CSC. Scholars and even the general public should be aware of the influence that data (re)presentation has on the way information and ultimately the world is perceived, which is why a solid and transparent scientific approach in the re-mediation of audio documents is not optional. \"The creation of digital objects -be it images of inscriptions or manuscripts, electronic versions of ancient corpora, or collections of secondary literature -is a crucial part of humanities research. It is more than just preparation for research [...and it] has to meet the standards of the various disciplines involved\" 1 .","refs":[{"start":496,"end":498,"marker":"bibr","target":"#b2"},{"start":498,"end":499,"marker":"bibr","target":"#b3"},{"start":569,"end":571,"marker":"bibr","target":"#b4"},{"start":571,"end":572,"marker":"bibr","target":"#b3"},{"start":682,"end":683,"marker":"bibr","target":"#b3"}]}]},{"title":"Description of the project","paragraphs":[{"text":"The research project dedicated to the audio collection of the Centro Studi Luciano Berio started in mid-2013 and will have a duration of four years. The economic funding is provided by the Paul Sacher Foundation of Basel (Switzerland), and the entire digitisation process is carried out at the Centro di Sonologia Computazionale (CSC) of the Department of Information Engineering, University of Padua. The importance of the project lies in: (i) the value that the recordings hold for the research community of musicologists and musicians; (ii) the complexity that such an audio collection raises at a scientific-techonological level due to the obsolescence of the media and of the formats. Moreover, there is an additional complexity given by the very nature of the recordings, which include electronic compositions for magnetic tape, and rehearsals or live takes in acoustic scenarios where the distinction between the desired signal and noise is often ambiguous. The expected output of the project is a digital audio col-lection of preservation copies that meet the requirements of accuracy, reliability and authenticity necessary to serve as a valid documentary source for scholarly studies. Without such requirements, any analysis built on that audio data would lead to a fabrication of history. ","refs":[]}]},{"title":"Luciano Berio","paragraphs":[{"text":"Luciano Berio (1925-2003) has been an authoritative exponent of the new generation of the musical avantgarde since the 1950s, experimenting with complex combinations of timbres and with the expressive resources of the female voice. In December 1954, Luciano Berio and Bruno Maderna created the first Italian studio of electronic music at the RAI Milan headquarters, inaugurated the following year as the Studio di Fonologia Musicale. There he was able to experiment with the interaction of acoustic instruments and electronically produced sounds. Berio's musical research is characterised by his attainment of an equilibrium between a keen awareness of tradition and a propensity to experiment with new forms of musical communication, and his commitment to music extended to other activities including conducting, the conception of concert series and the promotion of contemporary music. In 1994 he was appointed \"Cavaliere di gran croce dell'Ordine al merito della Repubblica italiana\", and in 1998 he received the \"Medaglia d'oro ai benemeriti della cultura e dell'arte\". More information is available on the web site of the Centro Studi Luciano Berio 6 .","refs":[]}]},{"title":"The audio collection","paragraphs":[{"text":"The audio collection of the Centro Studi Luciano Berio comprises nearly four hundred open-reel tapes, currently stored at the Centro di Sonologia Computazionale (CSC) of Padua in a controlled environment (temperature, humidity, light exposure). The assessment of the physical condition of the tapes is one of the first steps required by the operative protocol for the preservation of the audio documents defined at the CSC. The priority codes determining the project roadmap and the treatment that is going to be applied to the tapes depend on this assessment, which is carried out with the customary visual/olfactory inspection by trained staff, as well as with specific physicalchemical analyses conducted in collaboration with the Department of Industrial Engineering -chemical sector, University of Padua.","refs":[]},{"text":"A multidisciplinary approach distinguishes the methodology for preservation of the Centro di Sonologia Computazionale, where different fields of expertise are synergistically engaged in the ultimate goal of creating a digital sound archive that meets the requirements of accuracy, reliability and authenticity. In particular, the CSC is conducting innovative experiments to define a scientific methodology for the physical recovery of magnetic tapes suffering from a common condition known as SBS-SSS (Soft Binder Syndrome -Sticky Shed Syndrome) 7 .","refs":[{"start":546,"end":547,"marker":"bibr","target":"#b5"}]}]},{"title":"Implementation and working enviroment","paragraphs":[{"text":"The re-mediation of audio documents is a complex activity (culturally and technologically), and should be carried out in a working environment that is adequately equipped. The CSC features multiple workstations, each dedicated to specific tasks. The main workstation for the digitization of open-reel tapes includes a Studer A810 recorder, a Prism Orpheus AD/DA converter, and Apple desktop machines for the acquisition of audio and video data, and for metadata extraction. The audio signal is sampled at 96 kHz with a resolution of 24 bits. The file format for audio is uncompressed Wave with PCM encoding. A video recording of the re-mediation is also included in the preservation copy: the video is a close-up of the tape sliding on the heads of the recorder, and its purpose is that of documenting eventual physical imperfections that might affect the audio signal and that should by no means be imputed to the remediation equipment. The selected metadata set is extracted using original software developed at the CSC 4 , integrating JHove 8 (a modular tool for analysis and validation of digital objects) and SoX command line utility 9 . All the data documenting the process of re-mediation are stored in a MySQL database designed on purpose at the CSC. The computer-based system that supports the preservation activities include real-time reporting and data sharing for the stakeholders via web applications with restricted access and secured communication. The digitized audio is stored in three different locations, on redundant arrays of independent disks (RAID-5).","refs":[{"start":1022,"end":1023,"marker":"bibr","target":"#b3"}]}]},{"title":"Conclusions","paragraphs":[{"text":"This article has presented the methodology of a multidisciplinary project (2013-2017) aimed at the preservation of the audio collection of the Centro Studi Luciano Berio, coordinated by and carried out at the laboratory for audio preservation and restoration of the Centro di Sonologia Computazionale (CSC) in Padua. In particular, the problem of digital philology applied to audio documents has been addressed, and a multidisciplinary methodology for the preservation of audio documents has been described. The methodology ensures that the digitized audio meets the requirements of accuracy, reliability and authenticity necessary to be considered as a valid documentary source for scholarly studies. In the future, the authors intend to consider the opportunity of designing and integrating retrieval facilities on the archive of digitized audio. During the first year of project, they have already developed an interactive web-based application 10 and two apps for Android tablet that present a virtuailzation of the historical replay equipment, providing the final users with a philological interface to access the recordings with the same controls, gestures and typical disturbances of the original setting.","refs":[{"start":948,"end":950,"marker":"bibr","target":"#b6"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper presents the methodology of a multidisciplinary project aimed at the preservation of the audio collection of the Centro Studi Luciano Berio, coordinated by and carried out at the laboratory for audio preservation and restoration of the Centro di Sonologia Computazionale (CSC) in Padua. The expected output of the project is a digital audio collection of preservation copies that meet the requirements of accuracy, reliability and authenticity necessary to serve as a valid documentary source for scholarly studies. The paper addresses the problem of digital philology applied to audio documents, and provides salient information about the implementation of the digitization process.","refs":[]}]}}