{"bibliography":{"title":"<e-codices. Virtual Manuscript Library of Switzerland>: a case analysis of good practices for building a virtual library and reunifying dispersed handwritten collections","authors":[{"person_name":{"surname":"Cusimano","first_name":"Fabio"},"affiliations":[{"department":"Officina di Studi Medievali","institution":null,"laboratory":null}],"email":"f.cusimano@officinastudimedievali.it"}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.020","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Tei-p5","Encoding","Xml","Digitization","Metadata"],"citations":{"b0":{"title":"Libri e manoscritti da biblioteche ticinesi nelle biblioteche digitali e-codices ed e-rara","authors":[{"person_name":{"surname":"Reusser","first_name":"Bernasconi"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Archivio Storico Ticinese","series":null,"scope":{"volume":151,"pages":{"from_page":156,"to_page":159}}},"b1":{"title":"Le nuove tecnologie per la ricerca umanistica: banche dati, repertori bibliografici, \"biblioteche digitali\" e \"cataloghi aperti dei manoscritti","authors":[{"person_name":{"surname":"Cusimano","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Mediaeval Sophia","series":null,"scope":{"volume":8,"pages":{"from_page":141,"to_page":154}}},"b2":{"title":"Virtual reunification as the future of 'codices dispersi': Practices and standards developed by e-codices -Virtual Manuscript Library of Switzerland","authors":[{"person_name":{"surname":"Austenfeld","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IFLA Journal","series":null,"scope":{"volume":36,"pages":{"from_page":145,"to_page":154}}},"b3":{"title":"Interoperabilità. Verso un modello aperto","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Biblioteche oggi","series":null,"scope":{"volume":6,"pages":{"from_page":55,"to_page":58}}},"b4":{"title":"Digital Libraries in the New Millennium","authors":[{"person_name":{"surname":"Zillur","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Bangladesh Journal of Library and Information Science","series":null,"scope":{"volume":2,"pages":{"from_page":103,"to_page":111}}},"b5":{"title":"La biblioteca digitale: definizioni, ingredienti e problematiche","authors":[{"person_name":{"surname":"Ridi","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Bollettino AIB","series":null,"scope":{"volume":44,"pages":{"from_page":273,"to_page":344}}},"b6":{"title":"Metadocuments supporting digital library information discovery","authors":[{"person_name":{"surname":"Karadkar","first_name":"U"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal on Digital Libraries","series":null,"scope":{"volume":4,"pages":{"from_page":25,"to_page":30}}},"b7":{"title":"Towards a digital library theory: a formal digital library ontology","authors":[{"person_name":{"surname":"Gonçalves","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Fox","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Watson","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal on Digital Libraries","series":null,"scope":{"volume":8,"pages":{"from_page":91,"to_page":114}}},"b8":{"title":"August Bibliothek: manoscritti e XML","authors":[{"person_name":{"surname":"Barbero","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Herzog","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Biblioteche oggi","series":null,"scope":{"volume":1,"pages":{"from_page":64,"to_page":66}}},"b9":{"title":"La codifica dei testi: un'introduzione","authors":[{"person_name":{"surname":"Pierazzo","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"Carocci","journal":null,"series":null,"scope":null},"b10":{"title":"Il manuale TEI Lite. Introduzione alla codifica elettronica dei testi letterari","authors":[{"person_name":{"surname":"Ciotti","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Burnard","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Sperberg-Mcqueen","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"Sylvestre Bonnard","journal":null,"series":null,"scope":null},"b11":{"title":"XML. Guida di riferimento","authors":[{"person_name":{"surname":"Harold","first_name":"Rusty"},"affiliations":[],"email":null},{"person_name":{"surname":"Means","first_name":"Scott"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":"Apogeo","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":3,"to_page":4}}},"b12":{"title":"TEI P5 Guidelines for Electronic Text Encoding and Interchange by the TEI Consortium. Originally edited by Sperberg-McQueen CM and Burnard L for the ACH-ALLC-ACL Text Encoding Initiative","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"Text Encoding Initiative Consortium","authors":[{"person_name":{"surname":"Burnard","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Bauman","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2013","month":"01","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":2,"pages":null}},"b14":{"title":"Historical research in archives: user methodology and supporting tools","authors":[{"person_name":{"surname":"Elena","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal on Digital Libraries","series":null,"scope":{"volume":11,"pages":{"from_page":25,"to_page":36}}},"b15":{"title":"Informatics fon Historians: Tools for Medieval Document XML Markup, and their Impact on the History-Sciences","authors":[{"person_name":{"surname":"Burkard","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Vogeler","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Gruner","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Universal Computer Science","series":null,"scope":{"volume":14,"pages":{"from_page":193,"to_page":210}}},"b16":{"title":"La codificación XML/TEI de textos medievales","authors":[{"person_name":{"surname":"Rueda","first_name":"Fradejas"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Memorabilia","series":null,"scope":{"volume":12,"pages":{"from_page":219,"to_page":247}}},"b17":{"title":"Metadati o catalogazione? Una falsa alternativa","authors":[{"person_name":{"surname":"Gorman","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Biblioteche oggi","series":null,"scope":{"volume":5,"pages":{"from_page":14,"to_page":14}}}},"sections":[{"title":"Main features of the project <e-codices -Virtual manuscript library of Switzerland>","paragraphs":[{"text":"<e-codices -Virtual manuscript library of Switzerland> is a project developed by the Institute for Medieval Studies of the University of Freiburg and directed by Professor Christoph Flüeler. It is part of the digital collections coordinated by <e-lib.ch> 1 , the \"Swiss electronic library\", which also includes <e-manuscripta.ch>, a portal devote to handwritten sources digitized by Swiss libraries and archives, and <e-rara.ch>, a portal devotes to digital reproductions of Swiss publications spanning from the 15th to the 19th century.","refs":[{"start":255,"end":256,"marker":"bibr","target":"#b0"}]},{"text":"The <e-codices> project has many strong points: from the graphical point of view, the website presents a well designed GUI (graphic user interface) and simple graphics that are easy to use; it is able to provide users (manuscript scholars, librarians and general public) with updates and information on the objectives and progress of the project itself and sub-projects (thanks to a newsletter and an RSS feed), as well as providing access to its digitized manuscripts; furthermore, all contents are available in four languages (English, French, German and Italian).","refs":[]},{"text":"In terms of the possibility of searching for data and information pertaining to the digitized samples, the <e-codices> website allows free access (it does not require registration on the portal) to 1145 digitized manuscripts from 46 different libraries (data updated to September 10, 2014): use of files and metadata is permitted in compliance with the Creative Commons License, which permits the use of individual images for non-commercial purposes in the areas of education and research.","refs":[]},{"text":"Moreover, although the project's main focus is the creation of a Swiss virtual library collecting and allowing access to all medieval and selected early modern manuscripts in Switzerland, the digital archive also includes three Swiss manuscripts stored in Austria and Germany, as well as three parts of two other Swiss manuscripts which are conserved in France, Russia and in the USA; <e-codices> acts as an \"aggregator\" of digital specimens, performing their digitization directly so as to grant access to these sources beyond the libraries which house the precious originals. We can find a confirmation of the special features of <e-codices> as a \"virtual library\" in what Riccardo Ridi states: \"la biblioteca virtuale è qualcosa di connesso in qualche modo alle risorse informative digitali, ma difficilmente identificabile in modo più preciso, tanto da essere compatibile con un ampio ventaglio di significati. La biblioteca digitale costituisce al tempo stesso un caso particolare di biblioteca virtuale (tanto che talvolta i due termini vengono impropriamente utilizzati come sinonimi) e il caso limite di biblioteca ibrida in cui documenti analogici e procedure e servizi manuali siano ridotti a zero.\" 6 In terms of the opportunity 2 (which, sadly, is often merely nominal) both for a digital library and for a virtual library to represent a space in which the scholarly community may not only conduct individual research, but also share information and ideas, the <e-codices> portal has also created a tool which Latin Paleography and Codicology scholars, as well librarians as anyone interested in the subject, will certainly appreciate and find highly useful: the Annotation tool, developed upon a request by researchers and libraries. This tool (which requires prior log-in through the individual manuscript summary page) enables scholars to collaboratively add to the information available for each manuscript, giving rise to a collaborative process enhancing the bibliographical references and annotations pertaining to an entire manuscript, its binding, a single page or range of pages. <e-codices> encourages collaboration with researchers in the field of manuscript scholarship by requesting that users suggest their desiderata, manuscripts that are important to their research for possible digitization and inclusion on the <e-codices> website: in this way it could be possible to write a new scholarly description, or edit or expand an existing description, or could also involve a digitization-based research project that demonstrates the advantages of making manuscript resources digitally available online.","refs":[{"start":1210,"end":1211,"marker":"bibr","target":"#b5"}]},{"text":"Thanks to the <e-codices> virtual library, manuscripts from historic collections (as, for example, the prestigious collection of the historical library of St. Gallen, with over 500 digitized manuscripts) are virtually reunified 3 for access via Internet and researchers are given a new tool for studying manuscripts: the <e-codices> virtual library 3 provides unified record lists for dispersed Swiss collections and immediate Internet access to high-quality digital reproductions, linking scholarly descriptions to all works available in the virtual library, to supply a full range of searchable bibliographic information.","refs":[{"start":228,"end":229,"marker":"bibr","target":"#b2"}]},{"text":"The reference to \"good practices\" in the title of this paper, therefore, derives from a number of factors which, combined, have contributed to the creation of an effective project: from the high quality of the digital copies 3 to their easy access through a functional online visualization tool; from the graphic interface design to the portal's metadata \"population\" which, along with the manuscript summaries contributed by users, ensure accessibility, traceability and interoperability 4,5,6 of the data.","refs":[{"start":225,"end":226,"marker":"bibr","target":"#b2"},{"start":489,"end":491,"marker":"bibr","target":"#b3"},{"start":491,"end":493,"marker":"bibr","target":"#b4"},{"start":493,"end":494,"marker":"bibr","target":"#b5"}]}]},{"title":"The crucial function of descriptive metadata","paragraphs":[{"text":"The most specific feature of <e-codices> is its focus on the assignment of metadata 7,8,9 to digital contents, interoperability, and compliance with the XML TEI-P5 encoding system. In terms of the particular features and technical and functional properties which should characterize a digital library, the added value of the <e-codices> project lies in its ability to put content interoperability into practice, and to guarantee access to information through a number of channels (also from mobile devices), also enabling the performance of targeted searches aimed at specific descriptive categories.","refs":[{"start":84,"end":86,"marker":"bibr","target":"#b6"},{"start":86,"end":88,"marker":"bibr","target":"#b7"},{"start":88,"end":89,"marker":"bibr","target":"#b8"}]},{"text":"In this context a key-role is played by the value of XML and, simultaneously, of the features of TEI-P5. A particularly important segment of TEI-P5 Guidelines is Chapter 10, focusing on Manuscript description, to which the authors of <e-codices> have referred in encoding 10,11,12,13,14,15 the descriptions of manuscripts. This specific module has been developed for the description of medieval handwritten sources in compliance with European cataloguing procedures; however, based on the metalanguage XML, it is easily adaptable for other specific uses (its very adaptability is one of the main reasons of the success of XML); the encoding of information linked to handwritten primary sources cannot prescind from the original bibliographical sources. Finally, another objective of this method aims to reclaim information contained in existing catalogues.","refs":[{"start":272,"end":275,"marker":"bibr","target":"#b9"},{"start":275,"end":278,"marker":"bibr","target":"#b10"},{"start":278,"end":281,"marker":"bibr","target":"#b11"},{"start":281,"end":284,"marker":"bibr","target":"#b12"},{"start":284,"end":287,"marker":"bibr","target":"#b14"},{"start":287,"end":289,"marker":"bibr","target":"#b15"}]}]},{"title":"The TEI-P5 tags used in <e-codices>","paragraphs":[{"text":"Metadata include information on shelf marks, titles, dates, short characterizations and detailed scholarly descriptions, to build a full manuscript package for presentation on the website.","refs":[]},{"text":"According to Chapter 10 of the TEI-P5 Guidelines, focused on Manuscript description, the entire tag set issued by the TEI Consortium was adopted by the <e-codices> staff for the development of manuscripts' descriptions.","refs":[]},{"text":"All these tags can make the retrieval of different types of data relating to manuscripts possible, thanks to the specialization of the tag set: the scholarly manuscript descriptions can be searched either using \"Full Text\" or using specific access points (Author, Manuscript title, Text title, Place of origin, Incipit, Explicit and Decoration). The \"Search function\" supports wildcards (*), logical operators (and, or, not) and fuzzy search (~).","refs":[]},{"text":"In this connection, every description has been compiled in accordance with the \"grammar\" and \"syntax\" of XML and TEI-P5 electronic text encoding guidelines 16 and contains these key-tags: <msDesc> (manuscript description), which contains a description of a single manuscript; <msIdentifier> (manuscript identifier), which contains the information required to identify the manuscript being described; <msContents> (manuscript contents), which describes the intellectual content of a manuscript or manuscript part; <physDesc> (physical description), which contains a full physical description of a manuscript or manuscript part; <history>, which groups elements describing the full history of a manuscript or manuscript part; <additional>, which groups additional information, combining bibliographic information about a manuscript, or surrogate copies of it with curatorial or administrative information; <msPart> (manuscript part), which contains information about an originally distinct manuscript or part of a manuscript, now forming part of a composite manuscript. Some of these tags employed in the TEI-P5 scheme for encoding information contained in manuscript descriptions may be associated with tags from the Dublin Core 17 standard, which features specific descriptive categories for the description of bibliographical sources.","refs":[{"start":156,"end":158,"marker":"bibr","target":"#b16"}]}]},{"title":"Conclusion","paragraphs":[{"text":"In my opinion, the <e-codices -Virtual Manuscript Library of Switzerland> project represents a useful opportunity for manuscript scholars and librarians to contribute (in a collaborative way) to the growth of research on the fields of Latin Paleograpahy and Codicology: the digitization and codify with XML TEI-P5 standard makes possible the \"virtual reunification\" 3 of medieval and early modern dispersed manuscripts from Swiss libraries, and provides \"an immediate Internet access to digital copies of works\" 3 , according to Anne Marie Austenfeld. Today, also for humanities research, digital repositories, digital libraries and virtual libraries are among the most common tools for disseminating digital object collections of cultural, educational, and other kinds of content over the Web: in this context the <e-codices> project, with all its characteristics, is state-of-the-art.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This essay will focus on a case study of good practices in the field of projection and circulation of digital contents for humanistic research, starting from handwritten sources: the <e-codices -Virtual Manuscript Library of Switzerland> project. As is stated in the <e-codices> website, \"the goal of the <e-codices> project is to provide access to all medieval and selected early modern manuscripts of Switzerland via a virtual library\", virtually reunifying dispersed handwritten collections. This goal was made possible thanks to the TEI-P5 standard, which \"enables the exchange of metadata with other digitization projects, meta-search engines, and portal sites\".","refs":[]}]}}