{"bibliography":{"title":"A Discovery Hub for Diamond Open Access publishing","authors":[{"person_name":{"surname":"Bardi","first_name":"Alessia"},"affiliations":[{"department":"Institute of Information Science and Technologies","institution":"National Research Council","laboratory":null}],"email":"alessia.bardi@isti.cnr.it"},{"person_name":{"surname":"Bargheer","first_name":"Margo"},"affiliations":[{"department":null,"institution":"University of Goettingen","laboratory":null}],"email":"bargheer@sub.uni-goettingen.de"},{"person_name":{"surname":"Manghi","first_name":"Paolo"},"affiliations":[{"department":"Institute of Information Science and Technologies","institution":"National Research Council","laboratory":null},{"department":null,"institution":"OpenAIRE AMKE","laboratory":null}],"email":"paolo.manghi@openaire.eu"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Scholarly communication","Institutional publishing","Open access 1. introduction","Open science"],"citations":{"b0":{"title":"Improving and coordinating technical infrastructure for institutional open access publishing across Europe","authors":[],"date":{"year":"2022","month":"12","day":null},"ids":null,"target":"https://ec.europa.eu/info/funding-tenders/opportunities/portal/screen/opportunities/topic-details/horizon-infra-2022-eosc-01-02","publisher":"European Commission Horizon Europe","journal":null,"series":null,"scope":null},"b1":{"title":"Action Plan for Diamond Open Access","authors":[{"person_name":{"surname":"Ancion","first_name":"Zoé"},"affiliations":[],"email":null},{"person_name":{"surname":"Borrell-Damián","first_name":"Lidia"},"affiliations":[],"email":null},{"person_name":{"surname":"Mounier","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Pierre","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Rooryck","first_name":"Johan"},"affiliations":[],"email":null},{"person_name":{"surname":"Saenen","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Bregt","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2022","month":null,"day":null},"ids":{"DOI":"10.5281/zenodo.6282403","arXiv":null},"target":"https://doi.org/10.5281/zenodo.6282403","publisher":null,"journal":"Zenodo","series":null,"scope":null},"b2":{"title":"Landscape study of small journal publishers for the Knowledge Exchange Task & Finish Group for \"Small Publishers and the Transition to Open Access","authors":[{"person_name":{"surname":"Stephen","first_name":"Dr"},"affiliations":[],"email":null},{"person_name":{"surname":"Dimity","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Stahlschmidt","first_name":"Dr"},"affiliations":[],"email":null},{"person_name":{"surname":"Stephan","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2022","month":null,"day":null},"ids":{"DOI":"10.5281/zenodo.7258049","arXiv":null},"target":"https://doi.org/10.5281/zenodo.7258049","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"","authors":[{"person_name":{"surname":"Bosman","first_name":"Jeroen"},"affiliations":[],"email":null},{"person_name":{"surname":"Frantsvåg","first_name":"Jan"},"affiliations":[],"email":null},{"person_name":{"surname":"Erik","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Kramer","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Bianca","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Langlais","first_name":"Pierre-Carl"},"affiliations":[],"email":null},{"person_name":{"surname":"Proudman","first_name":"Vanessa"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":{"DOI":"10.5281/zenodo.4558704","arXiv":null},"target":"https://doi.org/10.5281/zenodo.4558704","publisher":null,"journal":"OA Diamond Journals Study. Part 1: Findings","series":null,"scope":null},"b4":{"title":"","authors":[{"person_name":{"surname":"Becerril","first_name":"Arianna"},"affiliations":[],"email":null},{"person_name":{"surname":"Bosman","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Jeroen","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Bjørnshauge","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Lars","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Frantsvåg","first_name":"Jan"},"affiliations":[],"email":null},{"person_name":{"surname":"Erik","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Kramer","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Bianca","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Langlais","first_name":"Pierre-Carl"},"affiliations":[],"email":null},{"person_name":{"surname":"Mounier","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Pierre","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Proudman","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Vanessa","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Redhead","first_name":"Claire"},"affiliations":[],"email":null},{"person_name":{"surname":"Torny","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Didier","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":{"DOI":"10.5281/zenodo.4562790","arXiv":null},"target":"https://doi.org/10.5281/zenodo.4562790","publisher":null,"journal":"OA Diamond Journals Study. Part 2: Recommendations","series":null,"scope":null}},"sections":[{"title":"Related projects, initiatives and open challenges","paragraphs":[{"text":"Latin America has a strong and long experience in policies and technical implementation of Green and Diamond Open Access routes. Particularly relevant for the CRAFT-OA project is Redalyc3 , a network of non-commercial academy-owned Open Access scholarly and scientific journals. Founded in 2003, Redalyc evolved into a Diamond open access journal indexing service. Redalyc's technical approach serves several use cases. As an indexing service, it improves the visibility and recognition of non-English content, which is hindered by the bias of the dominant commercial scientific information infrastructures toward English language and Global North journals, such as Web of Science and SCOPUS. As a technology provider, Redalyc supports publishers at adopting digital technology to increase their level of technical maturity and their sustainability. One main aspect is, for example, the adoption of JATS XML (Journal Article Tag Suite eXtensible Markup Language), a standard on which services for the article editing and exporting are based, simplifying the processes for article submission and inclusion in the Redalyc indexing system. In addition, thanks to the adoption of standards, Redalyc can provide additional services, such as visualising usage metrics, linking content, and increasing the discoverability and reach of journals and their content. These shared services bring journals to a level of technical maturity they could not achieve on their own. The use of JATS XML is a prerequisite for this model. While JATS XML is an established way to achieve machine readability and contextualise the information contained in journals and their subsets (the articles in their various types such as editorials, reviews, or research articles), its adoption in smaller open access journals outside of Redalyc is still underdeveloped.","refs":[{"start":186,"end":187,"marker":null,"target":"#foot_1"}]},{"text":"Many journal publishers struggle on a technical level and rather dedicate their scarce resources to author management and content production instead of moving to full XML production and delivery of JATS XML. For these journals, direct entry into a collection such as Redalyc is not possible, which means that they are not able to leave the typical dilemma of small content providers: due to technical immaturity, they lack visibility and recognition, and due to the lack of recognition, they cannot strive and innovate to achieve technical maturity (see f.i. [3] p.11). In support of such publishers, Redalyc set up AmeliCA 4 , an initiative to strengthen editorial teams of journals in consolidation and increase their visibility with a dedicated indexing service.","refs":[{"start":559,"end":562,"marker":"bibr","target":"#b2"},{"start":624,"end":625,"marker":null,"target":"#foot_2"}]},{"text":"Full visibility and recognition of publications is usually achieved by their presence in the acknowledged aggregators of science such as the Directory of Open Access Journals (DOAJ) 5 , Scopus6 , Web of Science (WoS)7 or disciplinary indexes like PubMed8 . These function as a proxy for recognition and acknowledgement of authors, their publications, and their publication channels. Most of the medium and large commercial OA publishers are technically and organisationally capable of ensuring eligibility for these aggregators, especially since they usually can on previous events of registering new journals, due to their size as a publisher. Smaller institutional publishers often struggle due to their limited human and technological resources. [3] For journals to fully realise their technical capacity, they must be able to adopt communityrecognized and workable quality standards. Particularly in areas outside the anglophone STEM9 disciplines, standardised and general descriptions of the quality of content, processes, and platforms are rather scarce. This lack of standardisation, while a positive expression of cultural, linguistic, and disciplinary diversity and depth, is a disadvantage in organisational and technical terms.","refs":[{"start":182,"end":183,"marker":null,"target":"#foot_3"},{"start":192,"end":193,"marker":null,"target":"#foot_4"},{"start":216,"end":217,"marker":null,"target":"#foot_5"},{"start":253,"end":254,"marker":null,"target":"#foot_6"},{"start":749,"end":752,"marker":"bibr","target":"#b2"},{"start":937,"end":938,"marker":null,"target":"#foot_7"}]},{"text":"The recently launched DIAMAS10 project serves as a non-technical predecessor project to CRAFT-OA and aims to develop clear quality standards that are incorporated into the EQSIP (European Quality Standard for Institutional Open Access Publishing) model. The DIAMAS project consortium consists of several institutional publishing service providers (IPSPs) and established aggregators and infrastructure providers in the field of institutional publishing. The EQSIP model will reflect the capacities of this specific community and provide a clear path in which direction the development should go, also in a technical sense. The findings and results of the DIAMAS project will be incorporated into requirements engineering of CRAFT-OA's Diamond Discovery Hub (DDH). With this embedding in the community, DDH will significantly contribute to addressing several of the challenges mentioned above (see also [2], [4] and [5]).","refs":[{"start":28,"end":30,"marker":null,"target":"#foot_8"},{"start":902,"end":905,"marker":"bibr","target":"#b1"},{"start":907,"end":910,"marker":"bibr","target":"#b3"},{"start":915,"end":918,"marker":"bibr","target":"#b4"}]},{"text":"Another contact of relevance for CRAFT-OA is the European Open Science Cloud (EOSC). The EOSC is conceived as an environment to support European science, easing the access to research services, tools, infrastructures, and research products. CRAFT-OA will contribute to the vision of the EOSC by onboarding the services of the IPSPs and IPTPs of its network in the EOSC Marketplace and service catalogue and including the Open Access articles they publish into the EOSC Research Product Catalogue.","refs":[]}]},{"title":"The Diamond Discovery Hub","paragraphs":[{"text":"The network of interoperable Institutional Publishing Service Providers (IPSP) and Technology Providers (IPTP) that CRAFT-OA will set up will find in the Diamond Discovery Hub (DDH) a central service through which the visibility, discoverability and recognition of their services and the articles they publish is multiplied. Open Access (OA) publishing can serve as a strong facilitator as it rests on a set of practices thanks to which research publications in a technical sense are accessible freely without barriers. However, free access doesn't equal full machine-readability and it does not necessarily make those publications fully discoverable or result in recognition. Thanks to the CRAFT-OA network, IPSPs and IPTPs will operate economy-of-scale when adding functionalities to content and indexing of content providers (journals). For example, enriching metadata with funder information or matching publications to the Sustainable Development Goals of the UN to emphasise the social benefit of scholarly content only makes sense if the data collections are large enough to justify efforts and reach robust results.","refs":[]},{"text":"The DDH will centrally address technical challenges as described in Section 2 to improve the visibility, discoverability and recognition of institutional Diamond OA publishers by:","refs":[]},{"text":"• Creating a registry of diamond open access publishing platforms and services; • Validating metadata with regards to standards and best practices to ensure high-quality metadata for FAIR research publications;","refs":[]}]},{"title":"•","paragraphs":[{"text":"Integrating with the OpenAIRE Graph11 and the European Open Science Cloud (EOSC); • Providing the technical tools for the inclusion of journals and journals' articles in large aggregators (e.g. DOAJ, WoS, SCOPUS, but also in international data aggregations to emphasise visibility of institutional Diamond Open Access publishing).","refs":[{"start":35,"end":37,"marker":null,"target":"#foot_9"}]},{"text":"The DDH will be developed and implemented with approved OpenAIRE technology and workflows to safeguard long-term sustainability and interoperability with the OpenAIRE Graph and the EOSC. The high-level architecture of the DDH is depicted in Figure 1. IPSPs and IPTPs will register their services to the CRAFT-OA registry. The implementation of the registry will be based on the OpenAIRE PROVIDE service12 and will connect to EOSC so that the services will also be visible and discoverable via the EOSC Service Catalogue. Providers will be able to validate if their services meet the minimal technical requirements for metadata dissemination (as they will be defined by the CRAFT-OA project based on the outputs of the DIAMAS project, standards such as the EQSIP mentioned in Section 2 and best practices from the IPSP community). Upon successful validation, OpenAIRE will aggregate the metadata records they expose, which contain descriptions of the research publications, possibly with links to research data, protocols, software or other types of research products. OpenAIRE will include the records in its research graph and in the EOSC Research Product Catalogue. Records will also feed to the DDH Indexing Layer, which serves the DDH Search & Browse UI, and the DDH Export Layer, which is in charge of exporting the metadata records according to the protocols, formats, and level of quality as requested by the other large aggregators like DOAJ and WoS.","refs":[{"start":248,"end":249,"marker":"figure","target":"#fig_0"},{"start":402,"end":404,"marker":null,"target":"#foot_10"}]}]},{"title":"Conclusion","paragraphs":[{"text":"The landscape of Diamond Open Access publishing includes a large number of small institutional publishers that lack resources and expertise to address technical challenges and achieve the best possible level of visibility, discoverability and recognition solely on their own. With community-approved shared services they can reach a virtual economy-of-scale, allowing them to technically perform on a level that usually only larger and commercial units in scholarly publishing can achieve","refs":[]},{"text":"The CRAFT-OA project sets out to fulfil the mission as expressed in the INFRA-2022 EOSC call of the European Commission's framework programme Horizon Europe, to build a community of institutional publishers and supporting it with technical tools and services that is prone for integration into the larger mission of the European Science Cloud, the EOSC.","refs":[]},{"text":"The project will realise the described Diamond Discovery Hub to aggregate data on IPSPs and their content and integrate them in a way to foster interoperability with other curated data aggregation in scholarly publishing. It draws on the successful model of the aggregation service Redalyc and, building on existing services of open infrastructures like OpenAIRE and EOSC, the hub will centrally implement functionalities for the integration of institutional publishers and the articles they publish in the wider scholarly communication ecosystem.","refs":[]}]}],"tables":{"tab_0":{"heading":"•","description":"Build communities of practice to foster overall infrastructure improvement • Increase visibility, discoverability and recognition for Diamond OA publishing • Integrate Diamond OA publishing with EOSC and other large-scale data aggregators. CRAFT-OA's 23 consortium partners from 14 European countries are all engaged in institutional publishing and its infrastructures, and committed to sustaining and developing capacities in the field.Many CRAFT-OA partners are leading organisations at national and European levels in terms of open publishing and represent internationally visible centres of expertise in Open Science and FAIR implementation, with strong connections to EOSC. Within 36 months, CRAFT-OA will deliver technical and community tools, training events, training materials, information, and services for the Diamond OA institutional publishing environment.","rows":[]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"Open Access (OA) publishing is the set of practices thanks to which research publications are accessible freely without barriers. With Diamond Open Access, authors can publish free of charge as the institutional sector with universities, research institutions or libraries provide the necessary technological infrastructure. However, the Diamond OA landscape continues to be fragmented, is often underfunded, and is not always technically proficient enough to develop its full potential for science and society. The CRAFT-OA project, started in January 2023, aims to consolidate the Diamond OA publishing landscape both from the technical and organisational point of views. In this paper we describe the context and architecture of the Diamond Discovery Hub that will be released by the project to increase visibility, discoverability and recognition of Diamond OA institutional publishers and their content. The Diamond Discovery Hub will facilitate the integration with the wider scholarly communication ecosystem and the European Open Science Cloud to enlarge visibility, discoverability and reach of open access publications as part of the emerging Open Science paradigm.","refs":[]}]}}