{"bibliography":{"title":"Put the hands on! For a movable, interactive, pop-up, bibliographic database","authors":[{"person_name":{"surname":"Castellucci","first_name":"Paola"},"affiliations":[{"department":null,"institution":"University La Sapienza","laboratory":null}],"email":"paola.castellucci@uniroma1.it"},{"person_name":{"surname":"Crupi","first_name":"Gianfranco"},"affiliations":[{"department":null,"institution":"University La Sapienza","laboratory":null}],"email":"gianfranco.crupi@uniroma1.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Animated books","Pop-up books","Tactility","Interaction","Mobile books","Interactive books"],"citations":{"b0":{"title":"Apriti libro! Meccanismi, figure, tridimensionalità in libri animati dal XVI al XX secolo. Essegi","authors":[{"person_name":{"surname":"Franchi","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"1998","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Libri mobili: istruzioni per l'uso","authors":[{"person_name":{"surname":"Sestini","first_name":"V"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":"POP-APP","journal":null,"series":null,"scope":null},"b2":{"title":"Fondazione Tancredi di Barolo","authors":[],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":171,"to_page":178}}},"b3":{"title":"Mirabili visioni\": from movable books to movable texts","authors":[{"person_name":{"surname":"Crupi","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"JLIS.IT»","series":null,"scope":{"volume":7,"pages":{"from_page":25,"to_page":87}}},"b4":{"title":"Volvelles of knowledge. Origin and development of an instrument of scientific imagination (13th-17th centuries)","authors":[{"person_name":{"surname":"Crupi","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"JLIS.IT","series":null,"scope":{"volume":10,"pages":{"from_page":1,"to_page":27}}},"b5":{"title":"Apianus e le volvelle del cielo","authors":[{"person_name":{"surname":"Crupi","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Paratesto","series":null,"scope":{"volume":15,"pages":null}},"b6":{"title":"Paper Bodies. A Catalogue of Anatomical Fugitive Sheets","authors":[{"person_name":{"surname":"Carlino","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1999","month":null,"day":null},"ids":null,"target":null,"publisher":"Wellcome Institute for the History of Medicine","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1538,"to_page":1687}}},"b7":{"title":"Punch and Judy, Guignol, Gioppino & C. nei libri animati tra Otto e Novecento","authors":[{"person_name":{"surname":"Vagliani","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":27,"pages":null}},"b8":{"title":"Imago \"mobilis\" librorum. I libri animati antichi, in Imago librorum","authors":[{"person_name":{"surname":"Crupi","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":24,"to_page":26}}},"b9":{"title":"Introduzione di Frédéric Barbier","authors":[{"person_name":{"surname":"Di","first_name":"Edoardo"},"affiliations":[],"email":null},{"person_name":{"surname":"Barbieri","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":null,"target":null,"publisher":"Firenze Olschki","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":427,"to_page":444}}},"b10":{"title":"Carte del nuovo mondo: banche dati e Open Access","authors":[{"person_name":{"surname":"Castellucci","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":"Il mulino","journal":null,"series":null,"scope":null},"b11":{"title":"Organismo vivente'. La biblioteca nell'opera di Ettore Fabietti","authors":[{"person_name":{"surname":"Domenico","first_name":"Di"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":"AIB","journal":null,"series":null,"scope":null},"b12":{"title":"Movements of rotation and revolution Hypertext in the Seventies","authors":[{"person_name":{"surname":"Castellucci","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2022","month":"04","day":null},"ids":null,"target":null,"publisher":null,"journal":"JIB","series":null,"scope":{"volume":1,"pages":{"from_page":121,"to_page":131}}},"b13":{"title":"Le non cose. Come abbiamo smesso di vivere il reale","authors":[{"person_name":{"surname":"Han","first_name":"Byung-Chul"},"affiliations":[],"email":null}],"date":{"year":"2022","month":null,"day":null},"ids":null,"target":null,"publisher":"Torino Einaudi","journal":null,"series":null,"scope":null},"b14":{"title":"Water to the Thirsty. Reflections on the Ethical Mission of Libraries and Open Access","authors":[{"person_name":{"surname":"Fontanin","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Castellucci","first_name":"P"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b15":{"title":"IRCDL 2019","authors":[],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":"IRCDL Springer","journal":null,"series":null,"scope":{"volume":988,"pages":{"from_page":61,"to_page":71}}},"b16":{"title":"Interactive Books. Playful Media before Pop-Ups","authors":[{"person_name":{"surname":"Reid-Walsh","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":"Routledge","journal":null,"series":null,"scope":null},"b17":{"title":"La forma bizzarra dei libri","authors":[{"person_name":{"surname":"Albani","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":23,"pages":null}},"b18":{"title":"Suzanne Briet nostra contemporanea","authors":[{"person_name":{"surname":"Castellucci","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Mori","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2022","month":null,"day":null},"ids":null,"target":null,"publisher":"Mimesis","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction. A necessary interaction","paragraphs":[{"text":"Animated or mobile, interactive, animated, pop-up, books are those artefacts, created for very different purposes (didactic, mnemonic, playful, divinatory, etc.), which contain mechanical or paratextual paper devices, which require and solicit the reader's interaction. Volvelle and flaps were the 3D mobile devices most widely found in scientific books between the 16th and 17th centuries. Volvelles, i.e. rotating discs, membranous or made of paper, shaped and superimposed, and fixed to the underlying page with one or more pins, which allowed the free and independent rotation of each disc around its own axis. Volvelles were mainly used for astronomical books and calendars. Flaps of paper or parchment, on the other hand, were designed and employed to cover and then reveal one or more underlying images, mainly used in anatomical books. [1] It should also be considered that in many cases these books also came with instructions. It does not matter if it was sometimes only a few sentences: it is still significant that such books required, like a machine, or a modern computer, some sort of instruction manual in order to run the 'programme'. [2] Given the beauty and the epistemological importance of these very special books, many research projects have been undertaken over the past 20 years. Public and private institutions have carried out an intense activity of recovery and valorisation of movable books, resulting in interesting bibliographic exhibitions, books and scientific articles. Recently, for instance, the International Centre on Interactive Books and the journal JIB were set up in Italy. [3] A current research project is presented here, launched in March 2022, and involving three main partners: 1) The Tancredi di Barolo Foundation, promoter of the Centre and main body for the collection and preservation of these precious books, and the Musli Museum. 2) A group of humanistic scholars from various disciplinary areas and different critical approaches, therefore able to study the phenomenon from different perspectives (History of the Book; Cultural Studies; Bibliography; LIS; Philosophy of Science; Art History, etc.). 3) Computer scientists, again, belonging to different disciplinary, critical and interpretative approaches (DL, IR, AI, machine learning, onthologies, etc).","refs":[{"start":844,"end":847,"marker":"bibr","target":"#b0"},{"start":1151,"end":1154,"marker":"bibr","target":"#b1"},{"start":1615,"end":1618,"marker":"bibr","target":null}]},{"text":"The aim is to create an aggregator of international bibliographic resources from opacs, databases, antiquarian and sales catalogs, private collectors' libraries etc., with an organized set of metadata and information of different types, sorted according to criteria that allow the information itself to be entered, processed, maintained and searched, both in its simplest elementary forms and in more complex aggregated forms. 'Rereading' mobile books through the interpretative approach of Computer Science will offer the possibility of further enhancing the enjoyment of these delicate hybrid objects.","refs":[]},{"text":"The research project is currently underway to identify, describe and index the specimens owned by the Tancredi di Barolo Foundation. Once this necessary initial reconnaissance has been completed, a bibliographic database will be designed. The identification of the type and number of record fields to describe this peculiar universe of objects will be fundamental at this stage. And it is precisely at this moment that computer scientists, humanists (coming into contact with restorers, museum conservators, collectors) will have to work interactively. Computer scientists will learn from humanists and vice versa. As mobile, animated books teach us, we need to get our hands on them, to access knowledge. And it must be done together, interactively, so that knowledge continues to be produced and reproduced. And again, it is necessary to move, to be animated, and to present humanist projects at computer conferences and computer projects at humanist conferences: only then can new ideas pop up.","refs":[]}]},{"title":"A very special universe of 'objects': animated, interactive, mobile, pop-up books","paragraphs":[{"text":"The earliest and most significant testimonies of animated, interactive, mobile, pop-up, books are the works of the English Benedictine monk Matthew Paris (c. 1200 -1259) and the Catalan-speaking Majorcan philosopher Ramon Lull (1232/33 -1315). They used volvelles and/or flaps. This is the case, for example, of the 'Catoptrum microcosmicum' (1619) by J. Remmelin; the 'Astronomicum Caesareum' (1540) by P. Apianus; the 'Cosmographicus liber' (1524) by P. Apianus. [4] The scientific interest in this documentary and publishing typology is relatively recent, so much so that the first monographs dedicated to the history of animated books, date back only to 1978 and 1979. Moreover, the international bibliography on the subject is predominantly in English-speaking area, although there are some entries and contributions by Italian scholars.","refs":[{"start":465,"end":468,"marker":"bibr","target":"#b3"}]},{"text":"Antique animated books propose a mode of visual, tactile, mobile exploration, in which the reader is called upon to interact, moving on multiple sensory levels and simulating experiences that, precisely by virtue of this activity, are deeply fixed in the memory, according to a cognitive pathway that Bruno Munari would reiterate and modulate with his own 'unreadable' books and his method. The interactivity, which justifies the definitions of animated or movable or pop-up books for this type of artefacts and publishing products, is mainly manifested by the reader's movement of certain elements of the writing support. In these borderline documentary objects, interactivity becomes a physical, multi-sensorial as well as intellectual experience for the reader, transforming the book itself into a semiotic and communicative space, which enriches the semantic value of the text. [5] [6] Beginning in the late Middle Ages and throughout the Renaissance and 17th century, the use of these mechanical devices was thus part of a widespread material culture that pursued the acquisition of new knowledge through what scholar Pamela Smith has called 'the epistemology of handwork'; in other words, practical and direct observation, physically involving the observer in the interaction with phenomena and objects of nature, would mark, especially from the 16th century onwards, a radical change in the methodology of scientific investigation. Eyes are not enough, hands are needed to experience the workings of scientific knowledge, and the book became the instrument that directly related the world this side to the world beyond. It goes without saying that once the artifice had been found, it could be used, as in fact it was, in a multiplicity of applications and uses (from cryptography to rhetoric, from medicine to astrology), and volvelle and flap became for more than a century a popular and indispensable complement to treatises on the art of navigation and astronomy manuals, a didactic aid that succeeded in conveying technical information in an interactive format. [7] Prominent in the early centuries of printing were treatises on mnemonics and rhetoric, architecture, volumes on astronomy (such as that of Petrus Apianus), calendars (such as the 15th-century Regiomontanus with its system of rotating disks that made it possible to calculate the phases of the moon), so-called 'fortune books' for fortune-telling, and anatomy books (whose movable parts, when raised, showed the invisible stratigraphy of the human body).","refs":[{"start":882,"end":889,"marker":"bibr","target":null},{"start":2074,"end":2077,"marker":"bibr","target":"#b6"}]},{"text":"From the very beginning of their long history (and it is an ancient history that begins -according to our knowledge -around the middle of the 13th century), mechanical paper devices have in fact been multimedia knowledge communication devices, which transcended the limits of textuality in the strict sense and activated different codes of use (reading, viewing, manipulation, interaction). That is to say, under the eyes and in the hands of the reader, the book enhanced its purpose of use by becoming a physical space of self-learning, a medium of knowledge and the instrument of experimentation of that knowledge. [8] ","refs":[{"start":617,"end":620,"marker":"bibr","target":"#b7"}]}]},{"title":"For a database of mobile books","paragraphs":[{"text":"In the various researches conducted on interactive books, there have been many approaches to analysis and interpretation: -from a historical point of view, useful to reconstruct the origins and cultural contexts in which these types of books were created and in which they spread; -from the point of view of production processes, for the reconstruction of the production chain and the skills required; -from a codicological and bibliological point of view, because of the coexistence of different materials (parchment, paper of different weights, metal, thread, etc.) and the different ways in which they are composed and assembled (by the printer/binder or the reader); -from a bibliographical point of view, for the still non-standardized practices of their cataloguing description.","refs":[]},{"text":"-from a philological point of view, which is useful for reconstructing the history of so-called variants and the correct construction and reconstruction of built-in mechanical devices; -from the point of view of conservation procedures and restoration techniques, on which there are still no established guidelines, if not good practices implemented in specific cases; -from a linguistic point of view, due to the non-existence of a conventional international glossary (except in the Anglo-Saxon sphere, but even then it is a lexicon that is not completely set); -from the perspective of the history of science and the history of art, for the encounter between iconographic traditions and scientific knowledge, in the representation of a complex, multimedia, multiform and changing instrumental culture; -from a literary point of view, for the absence of research that relates the 'mobile books' to the reader, and thus on how he or she is urged to interact with the text, not only to interpret it but through the manipulation of a reading device that allows him or her to disassemble and reassemble the text at will, following the 'rules of the game'.","refs":[]},{"text":"-from the point of view of the sociology of reading, because the socio-cultural composition of the recipients of these early modern 'augmented books' and the ways in which they are used and enjoyed are still poorly investigated; -from an economic point of view, because, with a few exceptions, sources relating to the costs, book trade and collecting of these special documentary types must be adequately explored [9].","refs":[{"start":414,"end":417,"marker":"bibr","target":"#b8"}]},{"text":"All these different possible critical approaches must therefore be taken into account in the construction of the DL of mobile books. Scholars belonging to these disciplinary areas will, in fact, be the first ideal recipients of the database, the first users. In the description and indexing of each item, each of these aspects will have to stand out as possible 'access points' to the data and information. A particularly delicate task will therefore be that of identifying the fields required in the design of the records","refs":[]}]},{"title":"Interactive books as 'living organism'","paragraphs":[{"text":"Initially, the coverage of the database will only be national. And, again at first, it will start with a bibliographic database. At a later stage (and depending on the economic resources recovered), a fulltext database will be built.","refs":[]},{"text":"In this first phase, the implementation of a bibliographic DL for animated books, the following quality specifications and policies were identified as essential:","refs":[]},{"text":"-Filing and indexing of specimens owned in Italy (and progressively extending the survey) to make it possible to study, locate and preserve animated books.","refs":[]}]},{"title":"-","paragraphs":[{"text":"The mapping of the holdings in Italian libraries will also highlight the possibility of considering the phenomenon from a 'spatial' point of view: the subdivision of book production by geographic areas will in fact offer the possibility of enucleating specific \"schools\" of both production and collecting. -It will be absolutely necessary a multilingual glossary. It must be considered that, for example, individual mechanical paper instruments, such as volvelle and flaps, are called differently in different languages. -It will therefore be necessary to establish a standard for the description and indexing of animated books. -The database of mobile books will strictly follow FAIR conditions in data exchange; and metadata harvesting, to foster interoperability.","refs":[]},{"text":"With reference to this last aspect, it should be noted that database, in adhering to standards of accessibility, usability, interoperability, will only reflect (translated into modern terms, linked to information technology, information retrieval) the very fundamental values that in ancient times led to the conception of books that also required the use of touch, precisely to foster extensive interactivity and accessibility [10]. Even children who could not yet read could touch, open 3D sheets and thus follow a fairy tale. And even those with no scientific knowledge could leaf through a book and touch a lunar, or adjust a calendar and find out when the next Easter would be celebrated. \"Putting your hands on\" was therefore, already for ancient movable books, the precondition for access to knowledge and emotions that could not be reached by sight alone.","refs":[{"start":428,"end":432,"marker":"bibr","target":"#b10"}]},{"text":"Since a DL -like any library -is always a 'living organism', one can imagine the further evolution it may take in the future [11]. Over time, the database is likely to develop useful elements for:","refs":[{"start":125,"end":129,"marker":"bibr","target":"#b11"}]},{"text":"1) implement machine learning functions 2) 3D solutions 3) use of AI for particular solutions, i.e. to make access to mobile, animated texts 'enhanced' and thus increasingly interactive.","refs":[]},{"text":"Even before implementing the full-text version of the database, one can also imagine applications aimed at the in-house production of specific pop-up pages, with the help of 3D printers. Tutorials could also be implemented to maintain the pleasure of building an object on one's own, and get one's hands on the 'matrix'.","refs":[]},{"text":"The ultimate aim will be to highlight, precisely through virtual reality, the centrality of the sense of touch for cultural and emotional mediation.","refs":[]}]},{"title":"Specific fields, tags and records","paragraphs":[{"text":"Remaining, however, with the current stage of development, let us dwell on the requirements as a bibliographic database and particularly on the identification of fields and records. We will start with the traditional bibliographic descriptions both in the 'short title' version (author, title, year) and in extended versions of the record (place of edition, publisher and/or printer, descriptors, abstracts). Due consideration will of course also be given to descriptive standards for metadata, such as Dublin Core [12]. But it will also be necessary to identify specific fields in order to adequately describe the peculiarities of animated books:","refs":[{"start":515,"end":519,"marker":"bibr","target":null}]},{"text":"-the presence of specific mechanical paper devices (whether volvelles, or flaps, etc.); -the material aspects related to tactile perception: the type of paper used, its thickness, its rough or smooth nature; -whether the book includes (as is often the case) instructions for use (how to operate the flywheel, for example); -a field should then be provided to describe the state of conservation. This is certainly useful for planning possible restoration work; -a field describing the material use of the book described in the record.","refs":[]},{"text":"Considering use rather than state of preservation is crucial in the case of animated books. An excellent state of preservation, from the point of view of animated, mobile, interactive books, means a poor use. The more readers a specimen has had, in fact, the more it has 'spoiled' itself, or rather: the more people have been able to make use of the book's inner workings, and have been able to feel an active part in the transmission of knowledge.","refs":[]},{"text":"It should be underlined here that the very presence of flaps, volvelles, and other mechanisms represents an implicit demand for the reader's involvement in performing an action [13]. Making a mobile book 'work' implies use, and thus also decay. We could therefore even say that the more damaged the book appears, the more it means that the invitation to 'get your hands on it' worked, and thus the reader's involvement is considered successful. When describing the state of preservation of movable books, it is therefore essential to note down every aspect and consider damaged points not so much as 'damage' but as evidence, as evidence of successful interaction.","refs":[{"start":177,"end":181,"marker":"bibr","target":"#b12"}]}]},{"title":"Puts the hands on!","paragraphs":[{"text":"A database dedicated to mobile books should therefore recreate as much as possible the material, tactile perception of the original object described. The issue may appear contradictory: using information technology, virtual reality, to amplify the perception of materiality, and in this specific case, the materiality of the book-object. Mobile books are born precisely as tactile, and thus honor a sense that has been relegated to the background. Recently, a fortunate book by the Korean philosopher Byung-Chul Han, analyzing the effects of virtual reality, feared the risk of the predominance of non-things, that is, of losing contact with the materiality of existence [14]. These are interpretations that -albeit in their depth -take into account ancient fears that arise as each cultural paradigm shifts. In the face of the cries of alarm of a contemporary world floating unconsciously and incorporeally among 'non-things', the project of a database of interactive, tactile books may point to other possible paths. When working on the construction of a DL of mobile books, one must also take into account these dystopian readings and, if anything, reinforce precisely the contact with materiality, and even the use of touch in the transmission of both knowledge and artistic emotion. It is necessary to focus on interactivity as a desire to include the reader, to 'move' him towards new cognitive, sensorial, emotional experiences, and even to enjoy \"gamification\" of the experience of learning.","refs":[{"start":671,"end":675,"marker":"bibr","target":"#b13"}]},{"text":"Interactivity, then, urges both epistemological and important political issues related to issues of social justice and cultural justice: the right to access, for everyone, regardless of their cultural background [15]. Mobile books also open up issues related to poetic and emotional issues: pop upps, whether paper or digital, in promoting interactivity, make it clear that technology is not only a tool to make a right (to access, to knowledge) viable, but also enters into our intellectual and sensory experiences through touch, the body, triggering new emotions and desires [16]. There really is no caesura between materiality and theory, as between touch and thought, between hand and brain. This was already stated by McLuhan in the 1960s, and we should continue to investigate these aspects now.","refs":[{"start":212,"end":216,"marker":"bibr","target":"#b14"},{"start":577,"end":581,"marker":"bibr","target":"#b16"}]},{"text":"In effect, it is a matter of bringing theory and application, computer science and humanistic studies into deep synergy. A reciprocal solicitation and inspiration is therefore necessary: computer theories (e.g. Richard Stallman's Open Source credo) can form the interpretative basis referring to material objects such as ancient animated books; and vice versa, the critical approach of Cultural Studies can foster the emergence of new types of DL. Working together between Humanities and Informatics is in itself interactivity. An intimate union and not a subordinate positioning of one to the other. It is not a question of sharing tasks. Contact, with the materiality of a 'bizarre' book typology that honours the touch, and therefore the body itself [16]. We both have to get our hands on it. With all senses alerted [18]. As already at the dawn of computing we dreamed, we imagined, we planned.","refs":[{"start":753,"end":757,"marker":"bibr","target":"#b16"},{"start":820,"end":824,"marker":"bibr","target":"#b18"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"In the majority of cases, bibliographic databases refer to written documents that primarily stimulate the sense of sight. In databases of films, music, sounds, the sense of hearing is added. A sense that has instead remained in a marginal position is touch. Yet, even before the invention of printing, sight was considered necessary but not sufficient to foster the dissemination of knowledge or emotional involvement. For example, in ancient treatises on astronomy, anatomy or, later, in children's books, or in artists' books, the reader was prompted to interact by turning a paper circle representing a lunar calendar; or by turning a page with a drawing of the human body, to find another page where the drawing of internal organs appeared; or, again, games and poems would open like a fan. These are the so-called mobile, interactive, animated, popup books, where the reader needs to 'put the hands on it' in order to operate the machine of knowledge and emotion. The creation of a bibliographic database on Interactive Books raises many questions, both from the theoretical and applicative point of view. It is absolutely necessary to be familiar with this very peculiar type books. Close cooperation between computer scientists and humanist scholars is therefore be essential.","refs":[]}]}}