{"bibliography":{"title":"PROMISE -Participative Research labOratory for Multimedia and Multilingual Information Systems Evaluation","authors":[{"person_name":{"surname":"Buccio","first_name":"Emanuele"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"dibuccio@dei.unipd.it"},{"person_name":{"surname":"Dussin","first_name":"Marco"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"dussinma@dei.unipd.it"},{"person_name":{"surname":"Ferro","first_name":"Nicola"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"ferro@dei.unipd.it"},{"person_name":{"surname":"Masiero","first_name":"Ivano"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"masieroi@dei.unipd.it"},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"silvello@dei.unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"Harnessing the Scientific Data Produced by the Experimental Evaluation of Search Engines and Information Access Systems","authors":[{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Hanbury","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Müller","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Santucci","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Procedia Computer Science","series":null,"scope":{"volume":4,"pages":{"from_page":740,"to_page":749}}},"b1":{"title":"Interactive Analysis and Exploration of Experimental Evaluation Results","authors":[{"person_name":{"surname":"Di Buccio","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Dussin","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Masiero","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Santucci","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Tino","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://ceur-ws.org/Vol-763/","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":11,"to_page":14}}},"b2":{"title":"Visual Comparison of Ranked Result Cumulated Gains","authors":[{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Sabetta","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Santucci","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Tino","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"Eurographics Association","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction and Motivation","paragraphs":[{"text":"With a population of over 500 million in its 27 states in which more than 80 indigenous and many more immigrant languages are found, the citizens and companies of the EU demand information systems that allow them to interact with the culturally and politically diverse content that surrounds them in multiple media. Moreover, with the advance of broadband access and the evolution of both wired and wireless connection modes, users are now not only information consumers, but also information producers: language and media barriers are no longer seen as inviolable and they are constantly crossed and mixed to provide content that can be accessed on a global scale within a multicultural and multilingual setting.","refs":[]},{"text":"The technology and research behind multilingual and multimedia information systems are, today, in the position of intercepting these emerging trends but their design and development is becoming increasingly complex and needs proper means for ensuring that they meet the expected user requirements and provide the desired effectiveness.","refs":[]}]},{"title":"Scientific Challenges","paragraphs":[{"text":"We consider experimental evaluation both laboratory and interactive a key means for supporting and fostering the development of multilingual and multimedia information systems which are more adherent to the new user needs in order to ensure that they meet the expected user requirements, provide the desired effectiveness and efficiency, guarantee the required robustness and reliability, and operate with the necessary scalability. PROMISE1 (Participative Research labOratory for Multimedia and Multilingual Information Systems Evaluation) aims at advancing the experimental evaluation of complex multimedia and multilingual information systems in order to support individuals, commercial entities, and communities who design, develop, employ, and improve such complex systems. The overall goal of PROMISE is to deliver a unified environment collecting data, knowledge, tools, methodologies, and the user community which are involved in the experimental evaluation.","refs":[{"start":440,"end":441,"marker":null,"target":"#foot_1"}]},{"text":"PROMISE is a network of excellence (contract n. 258191), funded in the 7th Framework Programme of the European Commission, with 10 academic and industrial partners, who are leaders in the field: University of Padua, Italy (coordinator); Swedish Institute of Computer Science (SICS), Sweden; University of Amsterdam, The Netherlands; Sapienza University of Rome, Italy; University of Applied Sciences Western Switzerland, Switzerland; Vienna University of Technology, Austria; Zurich University of Applied Sciences, Switzerland; Humboldt-Universitt zu Berlin, Germany; Evaluations and Language resources Distribution Agency (ELDA), France; Centre for the Evaluation of Language Communication Technologies (CELCT), Italy.","refs":[]},{"text":"The PROMISE project lasts three years, starting from September 2010 and ending in August 2013.","refs":[]},{"text":"To achieve its goals, PROMISE will pursue the following activities:","refs":[]},{"text":"-Foster the adoption of regular and thorough experimental evaluation activities: it will carry on the successful and renowned CLEF2 (Cross-Language Evaluation Forum) evaluation campaigns further pushing the evaluation exercises to tackle realistic tasks, use cases, and data sets; -Bring automation into the experimental evaluation process: it will propose methods and provide software infrastructure to create larger experimental collections; increase the number and size of the experiments conducted; and develop distributed, asynchronous, and loosely-coupled evaluation protocols, moving experimental evaluation from handicraft process to a mostly automatic one. -Promote collaboration and re-use over the acquired knowledgebase: it will curate, preserve, and enrich the collected experimental data; provide the means for an easy comparison with and a meaningful interpretation and visualisation of the experimental results; and facilitate the discussion and collaboration among all the interested stakeholders. -Stimulate knowledge transfer and uptake: PROMISE will disseminate know-how, tools, and best practices about multilingual and multimedia information systems; facilitate uptake and participation by commercial entities and industries; and give rise to multidisciplinary competencies and expertises.","refs":[{"start":130,"end":131,"marker":null,"target":"#foot_2"}]}]},{"title":"Key Technologies and Contribution by Italian Research Community","paragraphs":[{"text":"Large-scale evaluation initiatives, such as Text REtrieval Conference (TREC) in the United States, the CLEF in Europe, and the NII-NACSIS Test Collection for IR Systems (NTCIR) in Asia, contribute significantly to advancements in research and industrial innovation in the information retrieval sector, and to the building of strong research communities. A study conducted by NIST reports that \"for every $1 that NIST and its partners invested in TREC, at least $3.35 to $5.07 in benefits accrued to IR researchers. The internal rate of return (IRR) was estimated to be over 250% for extrapolated benefits and over 130% for unextrapolated benefits\". Large-scale evaluation campaigns produce a huge amount of extremely valuable scientific data which provides the foundations for subsequent scientific production and system development and constitutes an essential reference for literature in the field. This data is also economically valuable, due the considerable effort devoted to its production: the NIST study estimates in about 30 million dollars the overall investment in TREC.","refs":[]},{"text":"Nevertheless, little attention has been paid over the years to modelling, managing, curating and accessing the scientific data produced by evaluation initiatives, despite the fact that the importance of scientific data in general has been highlighted by many institutional organizations, such the European Commission, the US National Scientific Board, and the Australian Working Group on Data for Science.","refs":[]},{"text":"Our goal is to deliver a unified infrastructure and environment for data, knowledge, tools, methodologies, and the user community in order to advance the experimental evaluation of complex multimedia and multilingual information systems [1]. The evaluation infrastructure will:","refs":[{"start":237,"end":240,"marker":"bibr","target":"#b0"}]},{"text":"manage and provide access to the scientific data produced during evaluation activities; support the organization of evaluation campaigns; increase the automation of the evaluation process; provide component-based evaluation; foster the usage and understanding of the scientific data;","refs":[]},{"text":"A user-centered design approach will be adopted involving the different stakeholders, e.g. scientists, evaluation campaign organizers, system developers, students, in the development of the infrastructure.","refs":[]},{"text":"The evaluation infrastructure is not limited only at managing the experimental results but aims also at exploring how we can improve the comprehension of and the interaction with the experimental results by researchers and system developers. We imagine the following scenarios: (i) a researcher or a developer is attending the workshop of one of the large-scale evaluation campaigns and s/he wants to explore and understand the experimental results as s/he is listening at the presentation discussing them; (ii) a team of researchers or developers is working on tuning and improving a system and they need tools and applications that allow them to investigate and discuss the performances of the system under examination in a handy and effective way. To this end, we are investigating the adoption of innovative devices, such as the iPad, which can allow for a natural and easy interaction with the experimental results and the scientific data [2,3], as shown in Figure 1.","refs":[{"start":944,"end":947,"marker":"bibr","target":"#b1"},{"start":947,"end":949,"marker":"bibr","target":"#b2"},{"start":970,"end":971,"marker":"figure","target":"#fig_0"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Measuring is a key to scientific progress. This is particularly true for research concerning complex systems, whether natural or human-built. PROMISE will provide a virtual laboratory for conducting participative research and experimentation to carry out, advance and bring automation into the evaluation and benchmarking of complex multilingual and multimedia information systems.","refs":[]}]}}