{"bibliography":{"title":"Who Is the Data Curator? Defining a Vocabulary","authors":[{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":null},{"person_name":{"surname":"Casarosa","first_name":"Vittore"},"affiliations":[{"department":null,"institution":"ISTI-CNR","laboratory":null}],"email":"casarosa@isti.cnr.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-73165-0_25","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Vocabulary","Data curator","Data curation"],"citations":{"b0":{"title":"Building support for research data management: biographies of eight research universities","authors":[{"person_name":{"surname":"Akers","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sferdean","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Nicholls","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Green","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.2218/ijdc.v9i2.327","arXiv":null},"target":"https://doi.org/10.2218/ijdc.v9i2.327","publisher":null,"journal":"Int. J. Digit. Curation","series":null,"scope":{"volume":9,"pages":{"from_page":171,"to_page":191}}},"b1":{"title":"Research Data Curation Bibliography","authors":[{"person_name":{"surname":"Bailey","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":"http://digital-scholarship.org/rdcb/rdcb.htm","publisher":"Digital Scholarship","journal":null,"series":null,"scope":null},"b2":{"title":"Digital curation for science, digital libraries, and individuals","authors":[{"person_name":{"surname":"Beagrie","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":{"DOI":"10.2218/ijdc.v1i1.2","arXiv":null},"target":"https://doi.org/10.2218/ijdc.v1i1","publisher":null,"journal":"Int. J. Digit. Curation","series":null,"scope":{"volume":1,"pages":{"from_page":3,"to_page":16}}},"b3":{"title":"The emerging role of libraries in data curation and e-science","authors":[{"person_name":{"surname":"Heidorn","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Libr. Adm","series":null,"scope":{"volume":51,"pages":{"from_page":662,"to_page":672}}},"b4":{"title":"Digital curation in the academic library job market","authors":[{"person_name":{"surname":"Kim","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Warga","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Moen","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":{"DOI":"10.1002/meet.14504901267","arXiv":null},"target":"https://doi.org/10.1002/meet.14504901267","publisher":null,"journal":"Proc. Am. Soc. Inf. Sci. Technol","series":null,"scope":{"volume":49,"pages":{"from_page":1,"to_page":4}}},"b5":{"title":"Competencies required for digital curation: an analysis of job advertisements","authors":[{"person_name":{"surname":"Kim","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Warga","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Moen","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":{"DOI":"10.2218/ijdc.v8i1.242","arXiv":null},"target":"https://doi.org/10.2218/ijdc.v8i1.242","publisher":null,"journal":"Int. J. Digi. Curation","series":null,"scope":{"volume":8,"pages":{"from_page":66,"to_page":83}}},"b6":{"title":"Defining what digital curators do and what they need to know: the DigCCURR project","authors":[{"person_name":{"surname":"Lee","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Tibbo","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Schaefer","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":{"DOI":"10.1145/1255175.1255183","arXiv":null},"target":"https://doi.org/10.1145/1255175.1255183","publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":49,"to_page":50}}},"b7":{"title":"The DigCurV curriculum framework for digital curation in the cultural heritage sector","authors":[{"person_name":{"surname":"Molloy","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Gow","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Konstantelos","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Int. J. Digit. Curation","series":null,"scope":{"volume":9,"pages":{"from_page":231,"to_page":241}}},"b8":{"title":"Meeting data workforce needs: indicators based on recent data curation placements","authors":[{"person_name":{"surname":"Palmer","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Thompson","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Baker","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Senseney","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":"http://hdl.handle.net/2142/47308","publisher":null,"journal":null,"series":null,"scope":null},"b9":{"title":"Now is the future now? The urgency of digital curation in the digital humanities","authors":[{"person_name":{"surname":"Poole","first_name":"A"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://www.digitalhumanities.org/dhq/vol/7/2/000163/000163.html","publisher":null,"journal":"Digit. Humanit. Q","series":null,"scope":{"volume":7,"pages":null}},"b10":{"title":"Why manage research data?","authors":[{"person_name":{"surname":"Pryor","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"Facet Publishing","journal":null,"series":null,"scope":null},"b11":{"title":"Understanding roles and responsibilities of data curators: an international perspective","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Matusiak","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sposito","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Pervan","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Casarosa","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Libellarium","series":null,"scope":{"volume":9,"pages":{"from_page":39,"to_page":47}}},"b12":{"title":"Research data management services in academic research libraries and perceptions of librarians","authors":[{"person_name":{"surname":"Tenopir","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Sandusky","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Allard","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Birch","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Libr. Inf. Sci. Res","series":null,"scope":{"volume":36,"pages":{"from_page":84,"to_page":90}}},"b13":{"title":"New roles for new times: digital curation for preservation","authors":[{"person_name":{"surname":"Walters","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Skinner","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://www.arl.org/storage/documents/publications/nrnt_digital_curation17mar11.pdf","publisher":"Association of Research Libraries","journal":null,"series":null,"scope":null},"b14":{"title":"Institutional repositories and research data curation in a distributed environment","authors":[{"person_name":{"surname":"Witt","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":{"DOI":"10.1353/lib.0.0029","arXiv":null},"target":"https://doi.org/10.1353/lib.0.0029","publisher":null,"journal":"Libr. Trends","series":null,"scope":{"volume":57,"pages":{"from_page":191,"to_page":201}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Data curation has been defined by the University of Illinois as \"the active and ongoing management of data through its life cycle of interest and usefulness to scholarship, science, and education. Data curation activities enable data discovery and retrieval, maintain its quality, add value, and provide for reuse over time, and this new field includes authentication, archiving, management, preservation, retrieval, and representation.\"","refs":[]},{"text":"After the introduction of the term \"curation\" by the DCC centre, an interdisciplinary professional community has investigated the role and responsibilities of a new or renewed profile called \"data curator\". Data curators are specialists who play an important role, whose definition is still in progress and not agreed. The unique feature of the new profile is that it is considered a necessity in all countries; however, competencies, roles and qualifications highlight different backgrounds. In addition, the profile is evolving from the reflective practice of professionals, and there is not a shared theory for the role. The activities of the new profile are also unclear and there is no professional association that has analysed and prepared a competence list (see selected bibliography in the References Section).","refs":[]},{"text":"In 2016, the IFLA Section Library Theory and Research has (partially) funded the research project \"Data curator who is s/he?\" to clarify the profile of data curator.","refs":[]},{"text":"The main goal of the project was to define characteristics of roles and responsibilities of data curators in the international and interdisciplinary contexts.","refs":[]},{"text":"The methodology used in the IFLA Project has been based on a mixed-methodology, with content analysis of job announcements for data curators and for librarians to be involved in Research Data Management activities on one side, and semi-structured interviews with professionals working as data librarians, data curators, or research data managers on the other.","refs":[]},{"text":"The research questions of the Project were:","refs":[]},{"text":"• R1: How is data curation defined by practitioners/professional working in the field?","refs":[]},{"text":"• R2: What terms are used to describe the roles for professionals in data curation area? • R3: What are primary roles and responsibilities of data curators? • R4: What are educational qualifications and competencies required of data curators?","refs":[]},{"text":"The project, funded by the IFLA, was articulated in three main phases: In this paper we present briefly some of the results related to the research questions R1 and R2, namely what terms are used to describe the roles for professionals in the data curation area. Although it is a partial result, it seemed interesting to us to highlight the methodology of building the ontology, and how the ontology has allowed us to analyse both conceptual differences between communities and the growth of profile understanding over time between 2015 and 2017. This was an unexpected result. To monitor the development of the profile and, above all, to collaborate with data scientist and computer community scientists to arrive at an agreed terminology, the ontology remains open. The project results related to interviews and job description are going to be published in the final report.","refs":[]}]},{"title":"Term Extraction from Corpora Related to Digital Curation/Digital Curator","paragraphs":[{"text":"One of the main intent of the project was to identify a set of terms (a vocabulary) and possibly an ontology related to Digital Curation, by analysing relevant textual data in the field. Six different corpora were collected, identified with the following nicknames. The system used to extract relevant terms from the corpora, more generally called \"key phrases\" is the Keyphrase Digger (KD, see http://dh.fbk.eu/technologies/kd), developed at the Fondazione Bruno Kessler (FBK, see http://ict.fbk.eu/). KD scans a given corpus, and computes the \"scores\" of candidate key phrases, based on term frequency measures and linguistic syntactic information (Part of Speech patterns). It then return the key phrases in descending order of their score. The Keyphrase Digger has three main parameters:","refs":[]},{"text":"• n, the number of key phrases to be returned, which was set to 50 for all corpora except the Interviews. In this case, given the highly unstructured and colloquial text, n was set to 80 in order to try and capture more relevant key phrases. • p, which gives a boost to more specific key-concepts (ie. multi-token expressions).","refs":[]},{"text":"Depending on the value of p there will be more or less multi-token expressions in the result. It can have values NO, WEAK, MEDIUM, STRONG. • m, which indicated the maximum number of words that can be used in the multi-token expressions.","refs":[]},{"text":"In order to try and extract the maximum amount of information, KD was run on each corpus several times, with different values of the p and m parameters. A first series of five runs was done, with p = WEAK and m (the maximum number of words in a key phrase) going from 1 to 5. Then the results of the five runs were merged into a single list eliminating duplicates and terms clearly not related to Digital Curation (based on subjective judgement). It has to be noted here that KD does not have any \"semantic\" knowledge, and the key phrases identified are based only on frequencies and syntactic information. Therefore the returned list may contain \"key phrases\" not related at all with Digital Curation, even if the system has a stop word list to eliminate the most common words.","refs":[]},{"text":"The same process of five runs was applied to the same corpus with p = STRONG, obtaining a second list of relevant key phrases. The two lists were finally merged into a single one, eliminating duplicate terms and obtaining the set of terms related to Digital Curation for that corpus.","refs":[]},{"text":"After having extracted the set of key phrases form the six different corpora, it was apparent that there was a minimal overlap between any two pairs of corpora. To make this observation more precise, we generated the intersection of the 15 possible pairs of corpora, obtaining the key phrases in common between any two sets. In Appendix A there is the table with all the overlapping terms. The results confirmed the initial observation, as the \"intersection sets\" go from a minimum of 3 elements for the pair Interviews/Edison to a maximum of 18 elements for the pair Bibliography New/Bibliography Old.","refs":[]},{"text":"This result may not be not surprising, if we consider that the texts in the corpora are coming from different communities, and if we assume that each community may have its own terminology. What remains to be understood (possibly in a continuation of the project) is whether the differences are just a matter of \"terminology\", i.e. different communities use different terms to indicate (more or less) the same set of concepts, or is rather a difference in the set of concepts related to Digital Curation, assuming that the \"relevance\" of a concept (and therefore its appearance in the final results of KD) is actually depending on the community using it.","refs":[]}]},{"title":"Data Curation Concepts","paragraphs":[{"text":"To start trying to understand if and to what extent the overlapping in terminology between the different corpora is just a matter of terminology or is rather a matter of concepts, we have matched some of the common terms extracted from the corpora with the definitions found in Wikidata. We have also started building a table of \"related terms\" in order to arrive to a more complete and articulated taxonomy in the field of Data Curation. The initial preliminary results are shown below. ","refs":[]}]}],"tables":{"tab_1":{"heading":"•","description":"Bibliography Old. Text extracted from abstracts and keywords of papers related to Digital Curation and published up to 2015. • Bibliography New. Text extracted from abstracts and keywords of papers related to Digital Curation and published in 2016 and 2017. • Positions/Job offers. Text extracted from job offers and positions, searching for \"digital curators\", mostly from academia. • Questionnaire. Text extracted from a set of questionnaires distributed to professionals already working as data librarians, data curators, or research data managers. • Interviews. Text extracted from the transcript of interviews with selected respondents of the questionnaires. • Edison project. Text extracted from deliverables of the Edison project, a European project aiming at defining the skills and the roles of the new profession of Data Scientist.","rows":[]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"Theory and Research has (partially) funded the research project \"Data curator who is s/he?\" to clarify the profile of data curator. The main goal of the project was to define characteristics of roles and responsibilities of data curators in the","refs":[]}]}}