{"bibliography":{"title":"TindArt, an Experiment on User Profiling for Museum Applications","authors":[{"person_name":{"surname":"Zilio","first_name":"Daniel"},"affiliations":[],"email":"daniel.zilio@phd.unipd.it"},{"person_name":{"surname":"Orio","first_name":"Nicola"},"affiliations":[],"email":"nicola.orio@unipd.it"},{"person_name":{"surname":"Toniolo","first_name":"Camilla"},"affiliations":[],"email":"camilla.toniolo@studenti.unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-39905-4_13","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Museum","User profiling","User experience","Mobile application","Cultural heritage","Recommender system"],"citations":{"b0":{"title":"Capturing the visitor profile for a personalized mobile museum experience: an indirect approach","authors":[{"person_name":{"surname":"Antoniou","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":"http://eprints.gla.ac.uk/143234/","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Personalized museum experience: the rijksmuseum use case","authors":[{"person_name":{"surname":"Aroyo","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Brussee","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Rutledge","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Gorgels","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Stash","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Wang","first_name":"Y"},"affiliations":[],"email":null}],"date":{"year":"2007","month":"04","day":null},"ids":null,"target":"http://www.archimuse.com/mw2007/papers/aroyo/aroyo.html","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":11,"to_page":14}}},"b2":{"title":"Planning personalised museum visits","authors":[{"person_name":{"surname":"Berre","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Marquis","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Roussel","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2013","month":"06","day":null},"ids":null,"target":"http://www.aaai.org/ocs/index.php/ICAPS/ICAPS13/paper/view/6025","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":10,"to_page":14}}},"b3":{"title":"Recommender systems for museums: evaluation on a real dataset","authors":[{"person_name":{"surname":"Keller","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Viennet","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2015","month":"07","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"A different kind of experience: using a smart mobile guide for education and aging research at the Hecht museum","authors":[{"person_name":{"surname":"Kuflik","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Sagy","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Lanir","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Wecker","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Mogilevsky","first_name":"O"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":"https://mw2013.museumsandtheweb.com/paper/hecht-smart-mobile-guide/","publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Amazon.com recommendations. Item-to-item collaborative filtering","authors":[{"person_name":{"surname":"Linden","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"York","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IEEE Internet Comput","series":null,"scope":{"volume":7,"pages":{"from_page":76,"to_page":80}}},"b6":{"title":"Towards evaluating the impact of recommender systems on visitor experience in physical museums","authors":[{"person_name":{"surname":"Loboda","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Nyhan","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Mahony","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Romano","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2018","month":"09","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"Improving museum visitors' quality of experience through intelligent recommendations: a visiting style-based approach","authors":[{"person_name":{"surname":"Lykourentzou","first_name":"I"},"affiliations":[],"email":null}],"date":{"year":"2013","month":"07","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"PEACH -Intelligent Interfaces for Museum Visits","authors":[{"person_name":{"surname":"Stock","first_name":"Oliviero"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":{"DOI":"10.1007/3-540-68755-6","arXiv":null},"target":"https://doi.org/10.1007/3-540-68755-6","publisher":"Springer","journal":null,"series":null,"scope":null},"b9":{"title":"Recommendation in museums: paths, sequences, and group satisfaction maximization","authors":[{"person_name":{"surname":"Rossi","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Barile","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Galdi","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Russo","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":{"DOI":"10.1007/s11042-017-4869-5","arXiv":null},"target":"https://doi.org/10.1007/s11042-017-4869-5","publisher":null,"journal":"Multimedia Tools Appl","series":null,"scope":{"volume":76,"pages":{"from_page":26031,"to_page":26055}}},"b10":{"title":"Personalising content presentation in museum exhibitions -a case study","authors":[{"person_name":{"surname":"Tan","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Oinonen","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2009","month":"09","day":null},"ids":{"DOI":"10.1109/VSMM.2009.42","arXiv":null},"target":"https://doi.org/10.1109/VSMM.2009.42","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":232,"to_page":238}}},"b11":{"title":"Enhancing visitors' experience in art museums using mobile technologies","authors":[{"person_name":{"surname":"Tesoriero","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Gallud","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Lozano","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Penichet","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.1007/s10796-012-9345-1","arXiv":null},"target":"https://doi.org/10.1007/s10796-012-9345-1","publisher":null,"journal":"Inf. Syst. Front","series":null,"scope":{"volume":16,"pages":{"from_page":303,"to_page":327}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"One of the most important institutions of our society are museums. Since the foundation of the first museum more than 2500 years ago, this entity gave a fundamental contribution to the preservation, conservation and communication of the Cultural Heritage. Thanks to museums we can enjoy artworks, find ruins of the human and natural past and many other examples of items that are the bearer of human knowledge. There is an uncountable number of museums in the world, Italy alone hosts nearly five thousand museums covering all the aspects of culture -from archaeology, to art, from music to industrial heritage. In 2017, Italian museums attracted 57.8 millions of tourists which increase to 73.2 millions if archaeological sites are included) 1 .","refs":[]},{"text":"Despite this richness and the fact that Italy is one of the most important tourist destination in the world, there is no Italian museum inside the top ten visited museums 2 . There are a number of reasons to explain this apparent contradiction. Probably the main reason is that museums are not so attractive for tourists and citizens because they are seen like boring places 3 . It is related to the generalized problem of transmission of the cultural message, which may become specially crucial for art and archaeological museums. Museums plays a double role, enabling both the study and the dissemination of cultural heritage, and in many cases they are not able to communicate with all the variety of their potential users. For instance, a panel with a very long technical text is particularly useful for scholars and experts but may be difficult to understand for normal visitors without a training in the subject.","refs":[]},{"text":"To tackle these problems, the aim of this paper is to propose a methodology and an experiment to connect visitors preferences with museums items. The approach is based on the creation of personalised museum visits, and its starting point is the problem of user profiling from a cultural standpoint. The general idea is to use Recommender Systems (RSs) to adapt the presentation and the enjoyment of museum items to the visitor, while maintaining the quality and the depth of the content that is communicated. The approach regards both the itinerary that touches the most relevant items for the user and the manner in which the cultural message is transmitted to visitors.","refs":[]},{"text":"The research work presented in this paper is part of a larger project on the design and development of a RS and represents the initial step on collecting user choices and preferences. To this end, we developed a tool for Android to collect users preference in a fun way. The app, called TindArt because it mimics the interaction of a famous dating application, presents a sequence of pictures of artworks and asks users to express their preference with a binary choice between \"like\" and \"nope\". TindArt is a stand-alone application but it can also be embedded in a larger software application, for instance the one that visitors use while in line before entering a museum. The items included in TindArt were gathered during a pilot study, which allowed us to obtain a first sample of user preferences regarding art works. We present an analysis of the initial results on user usage and preferences.","refs":[]}]},{"title":"Related Works","paragraphs":[{"text":"As discussed in the previous section, the application of RSs to enrich the visitor's experience is still far from being widely applied to real case scenarios. User profiling, collaborative filtering, content-based analysis are essential components of modern content-delivery platforms. It is a common experience to receive recommendations about books by Amazon [6], music by Spotify, or videos by Netflix -just to mention the most prominent players in the respective areas -but the access to cultural heritage is still mediated through the traditional approach: written guides, panels, audio-guides, panels.","refs":[{"start":361,"end":364,"marker":"bibr","target":"#b5"}]},{"text":"Yet there are a number of researchers that are addressing the problem of enriching the visitor experience in museums, exhibitions and archaeological sites.","refs":[]},{"text":"For instance, a mobile application to personalize museum guides have been proposed in [8] with the aim to improve visitors' experience. Education is the main aspect of the work presented in [5], which is aimed at attracting new visitors [11] a goal shared by most of the institutions involved in this kind of projects.","refs":[{"start":86,"end":89,"marker":"bibr","target":"#b7"},{"start":190,"end":193,"marker":"bibr","target":"#b4"},{"start":237,"end":241,"marker":"bibr","target":"#b10"}]},{"text":"A key component of many approaches to recommendations regards the recollection of visitors' preferences and tastes. A number of approaches have been tested: from direct interaction with visitors [2] to indirect feedback [1] during the development of a narrative, to the use of virtual characters that interact with the visitor [9]. Evaluation is a key aspect in the development of any automatic system, and it has been the subject of a number of research papers like [4], which directly collected users data during an exhibition and evaluated the effectiveness of the system on this dataset, and [7] that addressed the impact on novel tools on user experience. User experience and satisfaction has been addressed also by [12] and [10]. One interesting aspect in recommending visit paths [3] in a museum is given by the number of constraints that have to be taken into account, including the lengths of the visit, the effect of fatigue, the mandatory items that everybody has to be see in any museum.","refs":[{"start":195,"end":198,"marker":"bibr","target":"#b1"},{"start":220,"end":223,"marker":"bibr","target":"#b0"},{"start":327,"end":330,"marker":"bibr","target":"#b8"},{"start":467,"end":470,"marker":"bibr","target":"#b3"},{"start":596,"end":599,"marker":"bibr","target":"#b6"},{"start":721,"end":725,"marker":"bibr","target":"#b11"},{"start":730,"end":734,"marker":"bibr","target":"#b9"},{"start":787,"end":790,"marker":"bibr","target":"#b2"}]}]},{"title":"The Project","paragraphs":[{"text":"The aim of the proposed project is to design and develop a RS to be used in a real museum context. Let us imagine a visitor who is waiting in a (perhaps long) queue at the entrance of an art museum. In order to kill time, the visitor is very likely to resort to his/her smartphone looking for some entertainment. TindArt could be the app he/she decides to play with. The simple interaction, discussed in Sect. 3.2, is designed to record visitor preferences expressed by simple gestures while providing some entertainment with a slide show of art works. The gathered information can be exploited to provide users with personalized visits, either by classifying the user interest in a group of predefined visit routes or by simply suggesting potentially interesting items while the user freely visits the museum.","refs":[]},{"text":"The set of images that are displayed by TindArt has been gathered during a pilot study that involved a group of students. We analyzed their choices to investigate the presence of common patterns that could be used to cluster user in groups with similar interests. The results of the pilot study are presented in Sect. 3.1. After collecting and normalizing the images, we involved a group of test users, monitoring their interaction with the application. The initial outcomes are described in Sect. 3.2.","refs":[]}]},{"title":"Pilot Study","paragraphs":[{"text":"The pilot study has been carried out involving 61 undergraduate students attending the course in History and Conservation of the Artistic and Musical Heritage of the University of Padua. Their assignment was to choose five artworks from the Heilbrunn Timeline of Art History 4 , the online archive of the Metropolitan Museum of New York which contains images and bibliographical records of hundreds of artworks. In particular, records are well structured and include a rich set of tags that describe the content in detail. Students were asked to choose freely the artworks according to their interest, with the only requirement that the chosen element were classified as Painting (the digital collection contains also images of sculptures, photographs, furniture, and furnishing). Once chosen the artworks, the participants had to download the corresponding digital image and copy the metadata, which were both uploaded to a web-based platform. After this step, 305 annotated images were available.","refs":[]}]},{"title":"Pre-processing","paragraphs":[{"text":"The majority of participants accurately followed the assignment, although we needed to carry out some cleaning. A small subsets of uploaded artworks did not met the constraint and were chosen from others categories like Prints, Photographs, Drawings and so on. Moreover, some students misspelled the website URL and chose the artworks from the official site of Metropolitan Museum5 instead of the Heilbrunn Timeline of Art History. After manually aligning the metadata, we maintained all the elements because they were all part of a larger category of bi-dimensional artistic representations.","refs":[{"start":380,"end":381,"marker":null,"target":"#foot_1"}]},{"text":"We added two extra fields to the metadata, using as a reference the information provided by the above cited Heilbrunn Timeline of Art History combined with WikiArt6 .","refs":[{"start":163,"end":164,"marker":null,"target":"#foot_2"}]},{"text":"-Artistic movement.","refs":[]},{"text":"-Artistic genre.","refs":[]},{"text":"The classification in artistic movement and genre was carried out in different steps. Starting from 35 artistic movements and 25 artistic genres, we merged similar categories obtaining respectively 21 and 11 classes. Grouping allowed as to improve the overlap between student choices, and was carried out through a process of generalization; for instance the artistic movements Informal Art and Dadaism were put together in Abstract Art group.","refs":[]}]},{"title":"Results","paragraphs":[{"text":"As a first step, we analyzed the consistency of individual participants in selecting the artworks, that is how they were distributed across the artistic movement and artistic genre classes. Afterwards, we investigated the possibility to cluster participants according to their artistic preferences.","refs":[]}]},{"title":"Consistency of Participants","paragraphs":[{"text":"Our interest was to find out whether participants consistently chose artworks from a limited group of artistic movements and genres or they had wider interests. From Table 1, which reports the two trends, it can be seen that the majority of participants chose artworks belonging to four different artistic movements and that only 15% chose artworks belonging to one or two movements. As regards the artistic genre, the majority of students chose artworks belonging to three or four different genres.","refs":[{"start":172,"end":173,"marker":"table","target":"#tab_0"}]}]},{"title":"Grouping Participants","paragraphs":[{"text":"Our goal was to check the possibility to profile participants by assigning them to a limited number of groups. The main assumption is that participants chose the artwork according to their artistic taste. In this paper our intention is not to investigate the intrinsic meaning of what artistic taste could be, but to investigate the possibility to grouping users starting from their preferences in an artistic context. We carried out a cluster analysis according to either the artistic movement or the artistic genres. Similarity between participants was computed using the cosine distance. Results of cluster analysis are shown in Figs. 1 and2. As it can be seen from the two dendrograms, there are three main clusters for the artistic movement and four clusters for the artistic genre, showing that participants can in principle be profiled according to their choices. Clearly this initial positive result should be confirmed by experiments with a larger set of participants.  Still using the cosine distance as a measure of similarity, we carried out multidimensional scaling in order to highlight how participants can be organized on a bi-dimensional space. Results of multidimensional scaling are shown in Fig. 3 and in Fig. 4 for artistic movement and genre respectively. Even if in this case the representation is quite sparse, a number of small groups (highlighted in the two figures) can be seen. Extending multidimensional scaling to a third dimension did not improve the results. Results obtained in these first preliminary experiments show that there can be some common trends in the choices made by the participants, and thus users can be profiled according to their choices.","refs":[{"start":638,"end":639,"marker":"figure","target":"#fig_0"},{"start":643,"end":644,"marker":"figure","target":"#fig_1"},{"start":1216,"end":1217,"marker":"figure","target":null},{"start":1230,"end":1231,"marker":"figure","target":null}]}]},{"title":"TindArt","paragraphs":[{"text":"As stated in Sect. 1 there are two motivations for the development of the mobile application TindArt. The first is to create a tool that can be used to profile users from a cultural point of view and the second is to study the interaction and user experience with an app that can be used in a museum pre-visit. It is important for our research to investigate both if this approach is a suitable method to obtain a user profile aimed at providing effective recommendations, and if it is appealing for users in a real setting.","refs":[]}]},{"title":"How TindArt Works","paragraphs":[{"text":"TindArt is developed for Android devices and it can be downloaded in beta version from Google Play7 . The application mimics the dating app Tinder8 in the way it uses the swipe gesture to express preferences according to the swipe direction. As it is well known, swipe represents a linear motion of fingers over a screen in order to move onto the next page, choose something, and so on. This gesture is used in Tinder to express preferences about persons appearance, while it is used in TindArt to express preferences about artworks. Our choice is motivated by the idea of giving the user an intuitive and fan tool so he/she can immediately learn how it works. In opposition to Tinder, that shows several information about the people, in our App we show the user only the name of the artwork, in order to make the choice more spontaneous possible and not linked to other aspects (such as if an artist is more famous than others). After download, the user creates an account using his/her email9 and so a session is created. In the main screen (see Fig. 5) there are four buttons and one that is implicit:","refs":[{"start":98,"end":99,"marker":null,"target":"#foot_3"},{"start":146,"end":147,"marker":null,"target":"#foot_4"},{"start":993,"end":994,"marker":null,"target":"#foot_5"},{"start":1053,"end":1054,"marker":"figure","target":null}]},{"text":"-Logout: it is used to disconnect from actual session; -Guida: a small tutorial of the application; -Progetto: it shows information about the project; -Inizia: it starts the artworks evaluation; -PERSONAL INFORMATION (implicit): it's the logo in the centre of the upper task bar and now it is only used for the preliminary study described in Sect. 3.3.","refs":[]},{"text":"Figure 6 shows the main screen of the application. The application randomly shows an artwork from a set of artworks, taken from collections of The Heilbrunn Timeline of Art History and The Metropolitan Museum of New York as described in Sect. 3.1, and the user can only rate it positively or negatively. There are two ways to express a preference:","refs":[{"start":7,"end":8,"marker":"figure","target":null}]},{"text":"-using the green button for LIKE or the red button for NOPE ; -using swipe gesture, left to right for LIKE, right to left for NOPE. There is also a button in the high right corner named Chat, but it is reserved for future experiments. A rating session can be stopped anytime by the user and it is possible in a second time to restart it. An artwork can be rated more than once. The total number of artworks are not known by the user and when he/she completes all of them an appropriated screen is shown. Unlike Tinder, the swipe gesture is not visually simulated, so when a user expresses a choice it is immediately recorded and a visible feedback is shown.","refs":[]}]},{"title":"Shown Items","paragraphs":[{"text":"The items have been selected starting from a subset of the artworks provided by the 61 students who participated to the pilot experiment. We kept only paintings, removed duplicate items and images with low quality on a standard mobile phone. The final number of artworks that are presented by TindArt is 352.","refs":[]}]},{"title":"User Experience with TindArt","paragraphs":[{"text":"An important issue of the research is to understand if an application like TindArt could be used in a real museum context and, at the same time, could investigate the user behaviour when interacting with this tool. To this end, a set of variables are stored into a database during the application use.","refs":[]},{"text":"These variables are reported for every single rated artwork:","refs":[]},{"text":"-Swipe: a boolean flag that represents if user rated using buttons or swipe gesture. -Date: the information about date could be used to analyse the number of votes that a user gives in a specific period of time. It also could be a measure of how many times a user uses the app, representing a evidence of the reliability of a choice. -Time of choice: the timing spent by user for a single vote.","refs":[]},{"text":"-Resolution of smartphone: We included this passive information to investigate if different devices could influence the user's choice.","refs":[]},{"text":"The number of artworks on which a user gives his preferences before dismissing the application is another information that will be considered in a future release.","refs":[]}]},{"title":"Initial Study with TindArt","paragraphs":[{"text":"Once collected the set of artworks, we tested whether the user preferences could be collected using the smartphone app TindArt. Data were gathered from a fixed period of time since after the application release on Play Store. Although still in beta version, the app can be installed and used freely by anyone with a Google Play account under the Play Store testing policy 10 . We asked a second group of undergraduate students, attending the course in Design and Management of Cultural Tourism of the University of Padova, to use the app. There was no particular assignment, because students were free to express their choice for any number of artworks. The interaction is straightforward and did not require any explanation to the students.","refs":[{"start":372,"end":374,"marker":null,"target":"#foot_6"}]},{"text":"The experiment lasted for about one month. During this period 54 users downloaded and tested the app, for an amount of 9882 choices. By inspecting their Gmail accounts, we estimate that about 60% of users were students of the mentioned course, while the remaining are common people that found and tried the application. We were not interested in demographic or personal data because the main goal was to obtain an initial set of preferences to analyse. Thus users could start playing with the application without providing any personal data or filling any questionnaire. It has to be noted that we proposed TindArt to students just to promote the application and to obtain potential feedback easily. Yet students of Design and Management of Cultural Tourism are a good representative of potential users of this kind of application in a museum context.","refs":[]}]},{"title":"Pre-processing","paragraphs":[{"text":"It is likely that some of the interactions were just random or interfered with other activities on the smartphone. So we decided to remove choices that were either too fast or too slow. The following thresholds were applied to the time of choice t: t min = 0.5 s t max = 20 s We assumed that choices outside this interval had no significance and could be removed because either completely random (t min < 0.5 s) or distracted by other activities (t max > 20 s). We removed about 7% of the choices, obtaining 9196 preferences that were analyzed.","refs":[]}]},{"title":"Analysis of the Interaction","paragraphs":[{"text":"After applying the threshold, the average time for a choice was: t mean = 2.39 s with variance t var = 3.68 s. In Fig. 7 we reported the histogram of time choices, which has the shape of an F-distribution. Swipe was used for 26.6% of preferences, thus there was a clear preference for using the buttons. About 50% of users used the swipe for less than 10% of the preferences, only the about 19% for more than 70%. This result was somehow surprising because swipe seemed to be more engaging than pressing buttons. We intend to investigate if this trend is maintained also in future experiments. The mean time of choice using swipe was: t mean swipe = 2.64 s whilst with buttons the average time was lower:","refs":[{"start":119,"end":120,"marker":"figure","target":"#fig_4"}]},{"text":"The overall number of LIKE, considering swipe and buttons, was 4615 (50.2%), the overall amount of NOPE was 4581 (49.8%). Using swipe the number of LIKE and NOPE were, respectively:","refs":[]},{"text":"N like swipe = 1349 (55.1%) N nope swipe = 1101 (44.9%) Using buttons they were:","refs":[]},{"text":"N like button = 3266 (48.4%) N nope button = 3480 (51.6%) An item has been rated on average 26.1 times, the minimum is 16, the maximum 34. Figure 8 shows the histogram about the number of items rated, while Fig. 9 shows the trend of choices from the most appreciated item to the least one. It is interesting to see trend is linear and do not follow the typical power-law that is seen on user preferences. In this paper we described the preliminary results of a larger project about the design and development of a recommender system for the tourism area, in particular for museum visits. We ran an experiment to gather a collection of images, taking advantage of the experiment by testing the possibility to profile users according to their choices on artistic movements and genres. An application, called TindArt, which collects information about user cultural preferences has been presented. The information obtained from the first analysis of user experience shows that it could be a useful tool to gathered information about user in a pre-visits museum scenario. For the user profiling we conducted a pilot study without using the application, but focusing on the problem to cluster user using a small collection of preferences about artworks. The results indicate that this can be a viable approach, but a deeper analysis on the different ways to use the metadata associated to the items have to be done. The next step is to increase the dataset of the choices made by users with TindArt and proceed with their analysis in order to create a system that allows us to cluster and profile users. When we will complete this step the aim will be to use this information gathered to create different kinds of visits for a real museum case.","refs":[{"start":146,"end":147,"marker":"figure","target":null},{"start":212,"end":213,"marker":"figure","target":null}]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Distribution of participants according to the amount of chosen artistic movement or genre Amount of different choices Artistic movement Artistic genre","rows":[["1","3","1"],["2","6","10"],["3","13","26"],["4","23","19"],["5","16","5"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"In this paper an Android application called TindArt is presented. It has been developed to investigate a way to profile the user in cultural contexts, through the application of Recommender Systems for museum visits in the future. The purpose of the research also includes the study of the User Experience with TindArt to understand how it could be used in a real museum context. Two pilot studies are also presented.","refs":[]}]}}