{"bibliography":{"title":"Modeling the Concept of Movie in a Software Architecture for Film-Induced Tourism","authors":[{"person_name":{"surname":"Lavarone","first_name":"Giulia"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"giulia.lavarone@unipd.it"},{"person_name":{"surname":"Orio","first_name":"Nicola"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"nicola.orio@unipd.it"},{"person_name":{"surname":"Polato","first_name":"Farah"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"farah.polato@unipd.it"},{"person_name":{"surname":"Savino","first_name":"Sandro"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"sandro.savino@unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1_13","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Film annotation","User requirements","Film-induced tourism"],"citations":{"b0":{"title":"L'auto e i turismi tematici","authors":[{"person_name":{"surname":"Censis","first_name":"Aci"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":"http://www.aci.it/fileadmin/documenti/bassihome/RapportoTurismo2008.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Film-Induced Tourism","authors":[{"person_name":{"surname":"Beeton","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"Channel View Publications","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":11,"to_page":11}}},"b2":{"title":"Le produzioni cinematografiche, il turismo, il territorio","authors":[{"person_name":{"surname":"Di Cesare","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Rech","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"Carocci","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":45,"to_page":88}}},"b3":{"title":"Al cinema con la valigia. I film di viaggio e il cineturismo","authors":[{"person_name":{"surname":"Provenzano","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"FrancoAngeli","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":256,"to_page":283}}},"b4":{"title":"Progress in information technology and tourism management: 20 years on and 10 years after the internet-the state of eTourism research","authors":[{"person_name":{"surname":"Buhalis","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Law","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Tourism Manage","series":null,"scope":{"volume":29,"pages":{"from_page":609,"to_page":623}}},"b5":{"title":"Il Davinotti -il correggibile","authors":[],"date":null,"ids":null,"target":"http://www.davinotti.com/","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"In a scenario where it is increasingly important to diversify the touristic offer, the development of thematic touristic paths such as the ones of film-induced tourism plays a central role [1]. Film-induced tourism has been defined by Sue Beeton as \"visitation to sites where movies and TV programmes have been filmed as well as to tour to production studios, including film-related theme parks\" [2]. Film-induced tourism may be very helpful for destination management and destination marketing: it attracts new visitors and also tourists who have already seen the area; it is largely independent from seasonal trends; it conveys tourists from overcrowded sites to new and less explored ones; and eventually can be suitable for a substantial re-branding of a certain area. A number of film-induced tourism related initiatives has been already undertaken at the international level by public and private bodies, which developed movie maps and movie tours or exploited the success of a particular movie as a tool for destination branding [3]. In Italy, increasing attention has been paid to the economic impact generated by the stay and work on-location of film and TV crews, fostering the birth and development of organizations -called film commissions -and funding aimed at the creation of film-friendly areas; nevertheless, excluding some notable exceptions, there is still a lack of coordinated efforts on film-induced tourism [4].","refs":[{"start":189,"end":192,"marker":"bibr","target":"#b0"},{"start":396,"end":399,"marker":"bibr","target":"#b1"},{"start":1036,"end":1039,"marker":"bibr","target":"#b2"},{"start":1429,"end":1432,"marker":"bibr","target":"#b3"}]},{"text":"The Department of Cultural Heritage of the University of Padova is currently investigating the topic of film-induced tourism in an ongoing project that brings together the expertise of film scholars and of computer scientists; the goal of the project is to develop an information system that combines the data about a geographical area and the movies produced in it with the purpose of fostering film-induced tourism. At the same time, the project aims at promoting the dissemination of important, yet less-known, movies that have been filmed in the selected area, that is the city of Padova and its province. The system is composed by two main components: a knowledge base storing all the relevant data about the movies shot in a given territory together with touristic information of the film locations, and an advanced interface to query the knowledge base and retrieve the information that could serve not only the tourist, but all the actors involved in film-induced tourism, as film-makers and destination managers.","refs":[]},{"text":"The system shall store and display detailed description of movies and locations, enriched by geo-referenced movie clips, informative touristic texts about the places, commentaries compiled by cinema experts about the movies, the locations and their relation, provide further information for movie professionals, and be able to filter and aggregate the information and propose it in the form of itineraries or recommendations. A novel characteristic of the system resides in the idea to relate the information not to a movie as a whole (as it is instead commonly done in current systems) but to excerpts of the movie itself, leading to a database that has a very precise and fine-grained description of what appears in the movie. This required us to develop a novel database model to store all the data we need to capture and map the relations among them.","refs":[]},{"text":"This paper describes the design and implementation of such database and it is organized as follows: the first part illustrates in more details the context, the aim and the requirements of the information system to be developed and, more specifically, those of the database; following in Sect. 3 a review of the existing literature on this topic is given; in Sect. 4 the actual design of the implemented system is described; conclusion and future work are left in the final part of the paper.","refs":[]}]},{"title":"Analysis of Requirements","paragraphs":[{"text":"The design of the system started with the collection and analysis of requirements.","refs":[]},{"text":"The requirements for the structure of the system were clear since the beginning: we needed a system capable of storing and retrieving rich and fine-grained data about movies and locations. To define the requirements for the contents of our system we started by identifying our intended users.","refs":[]},{"text":"As film-induced tourism brings together the two fields of cinema and tourism, there are many actors playing different roles: film and touristic agents, respectively producing movies and creating and managing the touristic offer, and a variety the users, including cinephiles or tourists, with interests of different degree in each of these two fields. In our analysis, we modelled the different users in three main groups, based on their different interests:","refs":[]},{"text":"• Tourists, interested in information to plan or enrich their visit; • Agents of the touristic industry, interested in information to exploit and promote locations; • Representatives of the movie industry, interested in information about locations and film-making related services.","refs":[]},{"text":"In order for the system to be informative for all the different user groups, the data structure should store information relevant to each of them: using a user-cases analysis, we defined the different interests for each of the user listed above and which data should be represented. The design of the data structure should also reflect the way in which the contents are presented, as different users access the data in a different way (Table 1). Some examples can better explain the possible interaction between a user and the system:","refs":[{"start":442,"end":443,"marker":"table","target":"#tab_0"}]},{"text":"• A tourist at home is planning his visit and uses the system to decide the destinations to visit; • A tourist, who is already visiting an area, uses the system -eventually through a mobile device -to decide his next stop in a tour; • A travel agent is preparing a touristic route and uses the system to plan a cinetouristic route or to enrich an existing route with cinetouristic related information; • A travel agent uses the system to gather information (text, images, dialogues, video excerpts) to promote a specific area as a destination or as a location; • A location manager is looking for new locations and uses the system to find available environments (e.g. a square with palaces of a given historical period) and evaluate their suitability as movie sets, with respect also to the facilities available nearby (parkings, hotels, catering, technicians,…); • A film maker is looking for existing footage of a specific area and uses the system to find and preview it, and to gather information on the copyright and copyright holders.","refs":[]},{"text":"The users' profiles can be further refined and expanded. For instance, tourists can be classified whether they are cinephiles or not influencing the type and depth of the information sought out. Moreover, the system could have additional commercial A fully defined list of the system's users goes beyond the scope of this paper; the classification and the examples above however confirm that, in order to be able to provide punctual and rich information to all the users, we need a deeper granularity in respect to existing data structures for movie representation. In particular, the data structure should store information about the location and its potential interest for tourists besides the mere role as location. Furthermore, the specific context requires the structure to store both geographic and multimedia information. In particular, movie clips play a central role in the interaction with the users. Given that the project aims at promoting both touristic location through movies and unknown movies through touristic paths, the choice of the video excerpts to show needs to be carefully done. This is one of the many contributions that need to be given by film scholars, and motivates the creation of a multidisciplinary team. Finally the structure should be flexible in order to let the system to inter-operate with data coming from different sources, such as existing lists of destinations, tourist attractions and local operators (e.g. hotels, restaurants, shops).","refs":[]},{"text":"In Sect. 4 we describe how the structure was designed in order to fulfil both the structure and contents requirements defined above.","refs":[]}]},{"title":"Related Work","paragraphs":[{"text":"Despite being a well studied phenomenon, little or no works can be found in literature approaching the topic of film-induced tourism from the perspective of information systems and digital libraries. Most of the research work on film-induced tourism describe case studies or detail the economic impact of film-induced tourism, but none of them discuss the creation of an information system.","refs":[]},{"text":"The literature on information systems for tourism, mainly promoted by the International Federation for IT and Travel & Tourism [5] through the ENTER annual conferences [6], is more focussed on business and management. The application of information technologies to tourism allowed the development of a number of software architectures, as Destination Management Systems (DMS) or Travel Recommender Systems (TRS), but do not specifically address the topic of film-induced tourism.","refs":[{"start":168,"end":171,"marker":"bibr","target":"#b4"}]},{"text":"Looking for models and database designs concerning movies, it is possible to find in literature many standards (e.g. MPEG-7, CWS) and many real world examples (e.g. IMDB); despite the wealth of different models available, however, we could not find any model suiting our needs. Most of the models lack the necessary resolution, as they have been designed for the purpose of creating catalogues (e.g. ISBD, ISAN) and as such they index the movie as a whole; on the other hand some are too resolute, indexing single frames (e.g. MPEG-7) and focussing only on some aspects (e.g. music or still images). Furthermore, most models lack completely of spatial attributes for the geo referencing of data or, where present, they refer just to the whole movie and not to excerpts of it as needed for our purposes.","refs":[]},{"text":"Currently, the only available IT products specifically developed for film-induced tourism are simple databases and apps for smartphones and tablets. These databases are usually just a plain list of movies and a list of related locations, created by local organizations or fan-based [7]; the granularity of the information stored is often quite rough (e.g. one location per movie) and the content is not very rich, with few information both on the locations and the movies and generally lacking any analysis of the relation between these two elements.","refs":[{"start":282,"end":285,"marker":"bibr","target":"#b5"}]},{"text":"The smartphone and tablet apps are usually very basic, consisting of a map with markers, and provide no or little information on the movies and on the territory. They are marketing products, usually specifically developed for a specific area, and albeit they can provide some useful ideas, especially on how to group and present data, they can not be used as a general model.","refs":[]},{"text":"In general the examples found in literature could provide us only some insights, but none of them addresses the topic of film-induced tourism in a way that is structured and heterogeneous as requested by our needs.","refs":[]},{"text":"Our attempt to develop a software architecture that brings together both cinematographic and touristic information at a fine grained level, and capable to accommodate the needs of different users seems pretty novel and requires to design an original structure to store all the needed information.","refs":[]}]},{"title":"Database Design","paragraphs":[{"text":"The design of the database was a long process that required a careful analysis of the requirements and, especially, a close collaboration between the film scholars and the computer scientists to extract and put together their respective knowledge in order to conceive a sound structure able to model all the information we needed.","refs":[]},{"text":"The structure that we finally designed revolves around five main entities: MOVIE, ESTRATTO (excerpt), MOI (Moment of Interest), POI (Point of Interest) and TAG. MOVIE represents a single film and its relationships with persons and companies involved in its production, and basically overlaps with the data structures normally used in online databases such as IMDB. The two entities ESTRATTO and MOI are entities with a temporal dimension, while POI has a spatial dimension. Finally, TAG has a semantic dimension and is used to add a description to all other entities (Figs. 1 and2).","refs":[{"start":574,"end":575,"marker":"figure","target":"#fig_0"},{"start":579,"end":580,"marker":"figure","target":"#fig_1"}]},{"text":"To attain the resolution required by our system for the description of a movie and its relation with the territory, the concept of movie has been divided into smaller parts, the MOIs, which we define as consecutive parts of a movie that have been shot in a given location. That is, a MOI corresponds to a sequence of consecutive frames in which a given location can be identified. MOIs are described spatially using the POIs, and semantically using the TAGs that allow for a rich and articulate description of the MOIs and, hence, of the MOVIE; by establishing links between TAGs and POIs, the system is able to expose relations between different MOVIEs and different MOIs, thus letting the user explore both the knowledge base and the territory in a bidirectional way. If the starting and ending points of a MOI can be defined based on what can be seen in the movie, the definition of the boundaries of an ESTRATTO is less precise. We define an ESTRATTO as a movie excerpt that provides the user with a significative portion, from a narrative point of view, of the movie. On the one hand, an ESTRATTO can include a sequence of MOIs when the setting changes place rapidly (e.g. two actors are discussing while driving in the city center). On the other hand, an ESTRATTO can be shorter that a single MOI when the setting does not change for a long time (e.g. many facts are happening in the same place, possibly involving different actors).  While the entities MOVIE and POI are of no surprise, the entities ESTRATTO, MOI and TAG reflect the design choices taken to meet our requirements; the concept of MOI in particular is central to our system.","refs":[]},{"text":"A MOI is thus the atomic part of a movie described in our system, represented by the start and end timestamps of a sequence of contiguous frames of the movie. A MOI has a temporal extent that can vary from few seconds to many minutes; it has no equivalent in any of the units traditionally used in film analysis (e.g. frame, shot, scene…), which is the reason why we prefer to introduce a new term instead of overloading the existing terminology. Various aspects of the movie are described in each MOI: these aspects have been chosen as they provide information that is meaningful to the different users of our system. One of the main aspects being described for each MOI is its geo-localization (or \"where\"); this connects MOIs with POIs and allows for a fine grained geo-referencing of a movie. A new MOI is created every time that the setting or the location changes.","refs":[]},{"text":"Together with \"where\", a MOI also describes the concepts of who, what, when and how; each of these concept is described in one or more attributes of the entity MOI.","refs":[]},{"text":"The concept of \"who\" is translated into three attributes, describing people, objects and symbols that are present on screen during the MOI; the first stores the characters, identified both as characters and actors; the second stores specially meaningful or characteristics items; the latter is used for abstract concepts, ideas or even people referenced to during the MOI. The attribute \"when\" is populated if the scene is set in a particular age; if the field is empty, the temporal setting of the MOI is supposed to be contemporary to the period of the production of the movie itself. This is helpful to find parts of the movies set in the future or in historic ages. Two attributes are used to describe \"what\" happens on screen during the MOI: a field describes the actions taking place during the MOI, while another is used for the emotions evoked by the events on screen. A MOI has also two attributes to describe \"how\" the scene was shot: one stores information about how the scene is composed visually and the other about the audio used. Each MOI has also a score that represents how well the MOI contributes to valorise the location and the movie.","refs":[]},{"text":"A POI (i.e. point of interest) is another key entity in our structure. Each POI has a geographical location and a shape being a point, a line or a polygon. These different geometries are useful to associate the POI with real-world entities as, for instance, a statue (point), a street (line) or a square (polygon). A POI can be related to a MOI in three different ways: it can be the POI where the MOI was shot (its location), the POI where the MOI is set (its setting) or a POI that is visible during the MOI (e.g. a building in the background).","refs":[]},{"text":"The description of a MOI is done using tags. A TAG is an entity composed by a name, an optional description and an attribute that indicates its \"type\", i.e. the different attribute of the MOI in which it was used. This allows to avoid homonymy issues between tags describing different aspects of a MOI (e.g. the tag \"Saint Anthony\" could indicate both the historical character or a church named after him).","refs":[]},{"text":"The entity MOVIE has all the usual attributes needed to describe a movie (e.g. title, director, genre…) and it is in relation with the entities MOI and ESTRATTO; in our structure, a movie is not directly connected to a POI, but the relation goes through the entity MOI: this choice allows to relate each movie with many POIs, generating an accurate list of the locations used in each movie.","refs":[]},{"text":"As already described, the entity ESTRATTO is a clip of the movie, i.e. a sequence of contiguous frames. The characteristic of each ESTRATTO is that its length is suitable for viewing on a device and that the clip is sound from the point of view of the plot and of the events on screen (i.e. there are no sudden cuts); this is not always true for the MOIs, whose duration is decided with respect to other parameters. Since the project aims at promoting the movie culture, in our structure the entity ESTRATTO is actually the only way video information is provided to the user. That is, even if the relation with the territory is the main reason why a tourist is interested in a given movie excerpt, the system does not aim to present the use with clips without a significant context.","refs":[]}]},{"title":"Database Implementation and Population","paragraphs":[{"text":"The first step after the definition of the database structure was its implementation. The need to store georeferenced data required the use of a spatially enabled DBMS: the database was hence implemented on PostgreSQL with the PostGIS extension, one of the most widely used open-source GeoDBMS.","refs":[]},{"text":"Once the database was ready, the second step was to populate it and an interface was designed and implemented in order to speed up the process of population. It was chosen to develop a web interface, to allow many users to work simultaneously on different movies; the interface has been implemented using PHP and JavaScript on a Apache webserver connected to the PostgreSQL DBMS.","refs":[]},{"text":"The interface is composed of modules. Each module allows to perform the usual CRUD operations on one specific entity; the most complex and worth noting module is the module to insert and edit a MOI, the key entity in the system (see Fig. 3).","refs":[{"start":238,"end":239,"marker":"figure","target":"#fig_2"}]},{"text":"During the development of the interface, and in particular of this module, a lot of care was put in order to make it easy to use and fast: due to the big amount of data to input for each movie and to the fact that the data entry has to be done mostly by expensive resources as film scholars, it is of big importance for the system that the interface was efficient; this was obtained developing an interface that could reduce the number of actions needed to perform a task and the possibility of errors. Among the aids developed, where possible, buttons or visual tools are used to insert data avoiding direct typing of text (e.g. for coordinates or timestamps): in the module to insert and edit a MOI, an auto-complete function helps the user in the insertion of TAGs, reducing the chances of typos whilst allowing the use of free TAGs; the module for the POIs, contains a map tool that allows to define the shape of the POI by directly drawing it on screen; the modules for MOIs and ESTRATTOs have an embedded video player that allows to create and edit these entities while watching the movie.","refs":[]},{"text":"To make the interface meet the users' needs, it was developed iteratively, with cycles of prototyping and testing.","refs":[]},{"text":"Finally the interface was fully implemented and tested and it is currently used by five to ten people to populating the database. ","refs":[]}]},{"title":"Conclusions and Future Work","paragraphs":[{"text":"In this paper we have described a database structure to be used in a software architecture to promote film-induced tourism. We proposed a novel design to model the concept of movie that goes further than existing known structures: the design that we propose is capable of describing at a very fine resolution a movie, its contents and its relation with locations. This model is to be used in a system to convey different types of rich contents, elaborated by film scholars, to different types of users. The data structure is currently being populated by a number students of film studies, coordinated by a scholar who is part of the research team.","refs":[]},{"text":"Our next steps regard the design of a personalized search engine, to create tourist paths across the territory according with user's interest on movies and location.","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Type of data and interests of the different users of the system","rows":[["User type","Interests","Useful data","Data presentation"],["Tourist","discover new places, learn","entertaining, appealing","maps, itineraries,"],["","new things both on movies","and informative data","recommendations,"],["","and the territory","about movies and","video clips"],["","","territory",""],["Tour","touristic promotion,","locations used in movies,","textual, video clips"],["operator,","creation of touristic","information on movies",""],["destination","itinerary","produced",""],["manager","","",""],["Film maker,","discover locations for new","visual and logistic","maps, video clips,"],["location","movies,","information on the","data sheets"],["manager","see how the territory was","locations",""],["","read in previous movies","",""]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"Film induced tourism is a recent phenomenon, which is rising increasing interest in tourism management and promotion. A research project on this topic is currently investigated at the Department of Cultural Heritage of the University of Padova, with the aim of developing a software architecture for promoting film-induced tourism. One of the challenges in the development of such system was the design of a suitable model to capture the concept of movie and all the related information. This paper presents the design and implementation of this model: how the entity of movie and its related information have been represented, how the design reflects the special needs and purposes of the system, how a database was implemented and populated and the outcomes of the developed software.","refs":[]}]}}