{"bibliography":{"title":"EDB: Knowledge Technologies for Ancient Greek and Latin Epigraphy","authors":[{"person_name":{"surname":"Fumarola","first_name":"Fabio"},"affiliations":[{"department":"Dipartimento di Informatica","institution":"Università degli Studi di Bari \"A. Moro\"","laboratory":null}],"email":"fabio.fumarola@uniba.it"},{"person_name":{"surname":"Pio","first_name":"Gianvito"},"affiliations":[{"department":"Dipartimento di Informatica","institution":"Università degli Studi di Bari \"A. Moro\"","laboratory":null}],"email":"gianvito.pio@uniba.it"},{"person_name":{"surname":"Felle","first_name":"Antonio"},"affiliations":[{"department":"Dipartimento di Scienze dell'Antichità e del Tardo Antico","institution":"Università degli Studi di Bari \"A. Moro\"","laboratory":null}],"email":"antonio.felle@uniba.it"},{"person_name":{"surname":"Malerba","first_name":"Donato"},"affiliations":[{"department":"Dipartimento di Informatica","institution":"Università degli Studi di Bari \"A. Moro\"","laboratory":null}],"email":"donato.malerba@uniba.it"},{"person_name":{"surname":"Ceci","first_name":"Michelangelo"},"affiliations":[{"department":"Dipartimento di Informatica","institution":"Università degli Studi di Bari \"A. Moro\"","laboratory":null}],"email":"michelangelo.ceci@uniba.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Spatial databases","Information retrieval","Epigraphy","Knowledge bases","Novelty detection"],"citations":{"b0":{"title":"A contribution for the dissemination of cultural heritage content to a wider public","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":354,"pages":{"from_page":195,"to_page":206}}},"b1":{"title":"Using colour information to understand censorship cards of film archives","authors":[{"person_name":{"surname":"Altamura","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Berardi","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ceci","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Malerba","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Varlaro","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal on Document Analysis and Recognition","series":null,"scope":{"volume":9,"pages":{"from_page":281,"to_page":297}}},"b2":{"title":"From relational databases to linked data in epigraphy: Hispania epigraphica online","authors":[{"person_name":{"surname":"Álvarez","first_name":"F.-L"},"affiliations":[],"email":null},{"person_name":{"surname":"Gómez-Pantoja","first_name":"J.-L"},"affiliations":[],"email":null},{"person_name":{"surname":"Barriocanal","first_name":"E"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":225,"to_page":233}}},"b3":{"title":"Document image analysis for World War II personal records","authors":[{"person_name":{"surname":"Antonacopoulos","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Karatzas","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":336,"to_page":341}}},"b4":{"title":"MTSR 2011","authors":[],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":240,"pages":null}},"b5":{"title":"The inscriptions of aphrodisias as electronic publication: A user's perspective and a proposed paradigm","authors":[{"person_name":{"surname":"Bodard","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Digital Medievalist","series":null,"scope":{"volume":4,"pages":null}},"b6":{"title":"Relational data mining and ilp for document image understanding","authors":[{"person_name":{"surname":"Ceci","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Berardi","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Malerba","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Applied Artificial Intelligence","series":null,"scope":{"volume":21,"pages":{"from_page":317,"to_page":342}}},"b7":{"title":"Latin on Stone: Epigraphy and Databases","authors":[{"person_name":{"surname":"Feraudi-Gruénais","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Lexington Book","journal":null,"series":null,"scope":null},"b8":{"title":"Document-centered collaboration for scholars in the humanities -the COLLATE system","authors":[{"person_name":{"surname":"Frommholz","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Brocks","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Thiel","first_name":"U"},"affiliations":[],"email":null},{"person_name":{"surname":"Neuhold","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Iannone","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Semeraro","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Berardi","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ceci","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":2769,"pages":{"from_page":434,"to_page":445}}},"b9":{"title":"CHiC 2011 -Cultural Heritage in CLEF: From Use Cases to Evaluation in Practice for Multilingual Information Access to Cultural Heritage","authors":[{"person_name":{"surname":"Gäde","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Paramita","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"A segmentation-free recognition technique to assist old greek handwritten manuscript OCR","authors":[{"person_name":{"surname":"Gatos","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Ntzios","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Pratikakis","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Petridis","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Konidaris","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Perantonis","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":3163,"pages":{"from_page":63,"to_page":74}}},"b11":{"title":"An adaptive binarization technique for low quality historical documents","authors":[{"person_name":{"surname":"Gatos","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Pratikakis","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Perantonis","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":3163,"pages":{"from_page":102,"to_page":113}}},"b12":{"title":"Automatic metadata retrieval from ancient manuscripts","authors":[{"person_name":{"surname":"Bourgeois","first_name":"Le"},"affiliations":[],"email":null},{"person_name":{"surname":"Kaileh","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":3163,"pages":{"from_page":75,"to_page":89}}},"b13":{"title":"RESTful web services","authors":[{"person_name":{"surname":"Richardson","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Ruby","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"O'Reilly Media, Incorporated","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Many countries are nowadays interested in the valorization of the cultural heritage, since it is widely recognized that cultural heritage resources have significant implications for development (both as a knowledge basis and in terms of commercial exploitation). For this aim, many institutions which collect and According to the definition reported in the 1972 UNESCO \"World Heritage Convention\" -Article 1 -cultural heritage refers to \"monuments\", \"groups of buildings\" and \"sites\" which are of outstanding universal value historically, artistically or scientifically. However, the concept of cultural heritage has recently assumed a broader connotation and includes, among other things, tangible, moveable objects such as works of art, artifacts, scientific specimens, photographs, books, manuscripts and recorded moving image and sound [2].","refs":[{"start":840,"end":843,"marker":"bibr","target":"#b1"}]},{"text":"In the literature, several systems have been proposed for the analysis, also through knowledge technologies, of digital Cultural Heritage resources and metadata. Typically, they are developed in the context of research projects such as MASTER [13], MEMORIAL [4], D-SCRIBE [11] [12], CULTURA [1], PROMISE [10], COLLATE [9] and CDLI (http://cdli.ucla.edu). They are either general purpose projects or focused on specific types of artifacts (e.g. COLLATE focuses on digitalized film archives of the Second World War) but none of them take into account the specific case of epigraphs.","refs":[{"start":243,"end":247,"marker":"bibr","target":"#b12"},{"start":258,"end":261,"marker":"bibr","target":"#b3"},{"start":272,"end":276,"marker":"bibr","target":"#b10"},{"start":277,"end":281,"marker":"bibr","target":"#b11"},{"start":291,"end":294,"marker":"bibr","target":"#b0"},{"start":304,"end":308,"marker":"bibr","target":"#b9"},{"start":318,"end":321,"marker":"bibr","target":"#b8"}]},{"text":"Epigraphs are invaluable sources of information that provide us with a myriad of useful information of the past (an example of epigraph is shown in Figure 1). They play the role of \"time capsules\" for example by allowing us to shed light on otherwise undocumented historical events, or to gain new knowledge of local laws and customs, and even to determine the date and producer of a given piece of lead piping. Epigraphy also documents the evolution of languages and scripts, although indirectly. In some cases, such as that of the Rosetta Stone, it can provide those key insights that allow for the successful deciphering of an unknown script.","refs":[{"start":155,"end":156,"marker":"figure","target":"#fig_0"}]},{"text":"In recent years, the tendency to create epigraphic databases for storing both images of epigraphs and associated metadata, as well as for supporting retrieval functionalities has emerged [8]. Examples are [6] and, more recently, [3] which exploit the EPIDOC schema [5] to guarantee uniform representation of epigraphic metadata. In the particular case of [3], the authors propose the Hispania Epigraphica database which allows the representation and the exploitation of semantic links between entities.","refs":[{"start":187,"end":190,"marker":"bibr","target":"#b7"},{"start":205,"end":208,"marker":"bibr","target":"#b5"},{"start":229,"end":232,"marker":"bibr","target":"#b2"},{"start":265,"end":268,"marker":"bibr","target":"#b4"},{"start":355,"end":358,"marker":"bibr","target":"#b2"}]},{"text":"However, four main problems have, up to now, affected epigraphic databases:","refs":[]},{"text":"1. Retrieval capabilities should take into account possible evolutions of the language, possibly due to the influence of other languages (e.g. in the Middle age) which lead to aberrant forms. Preserving retrieval effectiveness in these cases requires the consideration of a thesaurus which plays the role of background knowledge to be used for retrieval purposes. 2. Classic epigraphy has evolved into three strictly separate disciplines, i.e.","refs":[]},{"text":"Greek, Latin and Christian epigraphy, characterized by separate collections and corpuses used for reference, separate publications, separate populations of scholars and researchers. Indeed, different languages require different background knowledge to be exploited. 3. Data available in the databases can be used to extract knowledge through the application of data mining algorithms (following previous studies that use data mining algorithms for the analysis of digitalized cultural heritage resources [7]). 4. Epigraphs have traditionally been featured in non-geographical data bases.","refs":[{"start":504,"end":507,"marker":"bibr","target":"#b6"}]},{"text":"This results in the fact that several inscriptions that should be linked because of thematic or historic commonalities are scattered across multiple collections. Geo-referencing would help to overcome this limitation.","refs":[]},{"text":"In this paper, we present EDB (Epigraphic Database Bari) which concentrates on the valorization of the huge Italian cultural heritage and, in particular, on the valorization of Christian inscriptions in Rome. EDB actually stores around 30,000 Christian inscriptions and provides an answer to the problems described before. It stores metadata, such as the type of support (e.g. marble), the approximate period, the engrave technique, the current position and the text. Moreover, in the retrieval phase it expands queries by exploiting a thesaurus which includes more than 3000 relationships between terms. It also integrates a data mining algorithm which faces a novelty detection task. In this way, it is possible to identify relevant (frequent) changes in the properties of the inscriptions over time. Finally, it embeds a spatial database used to geo-reference epigraphs.","refs":[]},{"text":"The paper is organized as follows. In the next section, we describe the system architecture of EDB. In Section 3, we describe the application of EDB to the inscriptions published in the Inscriptiones Christianae Vrbis Romae septimo saeculo antiquiores, nova series editions. Finally, in Section 4, we report conclusions and delineate some future work.","refs":[]}]},{"title":"System Architecture","paragraphs":[{"text":"The general architecture of the proposed system consists of several components, each of which is in charge of performing specific tasks, and of a set of different data sources (see Figure 2). A summarized description of each of them is reported in the following subsections. ","refs":[{"start":188,"end":189,"marker":"figure","target":"#fig_1"}]}]},{"title":"Data Sources","paragraphs":[{"text":"Since the main goal of the system is to store and retrieve data about epigraphs, the main data source is the Epigraph Database, which, together with the text of the epigraphs, stores a set of metadata about dating, original context, current location, related literature, etc.","refs":[]},{"text":"The Literature Database stores metadata about scientific papers in which epigraphs have been studied. These metadata can include, but are not limited to, the authors, the journal, the year of publication, the citations, etc. Each epigraph stored in the Epigraph Database can be associated to one or more scientific papers stored in this database.","refs":[]},{"text":"The Knowledge Base stores the knowledge extracted by the Data Mining Module, i.e. patterns of interest in the form of rules, clusters, etc.","refs":[]},{"text":"The Image Repository stores photos of the epigraphs. This repository can be either internal or external, as well as an integration of internally produced and external resources.","refs":[]},{"text":"The Thesaurus data source is useful to support retrieval tasks. In particular, it gives the possibility to enhance and/or expand the user's query to better match data stored in the epigraph database. This aspect is detailed later in the Section 2.3.","refs":[]},{"text":"The Geographic Database stores data about geographic positions. It can be either an internal or an external resource (e.g. a web service). One or more geographic positions can be associated to each epigraph, which can represent either the locations where the epigraph (or an its fragment) was found or the position where the epigraph is currently located.","refs":[]}]},{"title":"System Components","paragraphs":[{"text":"The User Interface component allows users to interact with the system. In particular, this component is in charge of translating each user action to a request to other system components and to properly show the returned results. Although in Figure 2 a single actor is reported, it is noteworthy that different types of users may interact with the system. In particular:","refs":[{"start":248,"end":249,"marker":"figure","target":"#fig_1"}]},{"text":"-Administrators, which access the system to manage users and services; -Compilers/Epigraphists, which are the domain experts in charge of inserting, editing and deleting data about epigraphs to/in/from the main database, as well as of managing the image repository and the literature related to the epigraphs; -Web users, which are mainly interested in retrieving information about archived epigraphs according to many different filtering criteria; -Data Analysts, whose goal is to analyze data in order to extract valuable knowledge from them.","refs":[]},{"text":"The Retrieval Module exposes an interface to query the Epigraph Database. This is the central component of the system, through which users, as well as other components of the system, can access data to perform their own tasks.","refs":[]},{"text":"In particular, the main goal of this component is to retrieve epigraphs which satisfy a given set of filtering criteria. Such filters can be defined on the epigraphs' text, as well as on their metadata, which include the dating, the related literature and the geographic position about their original context or about their current location. Therefore, this component has to access directly to the Epigraph Database, to the Literature Database and to the Geographic Database. Furthermore, since performing the retrieval on the basis of the epigraph's text could be tricky when aberrant forms are present (see Section 2.3), this component also exploits the Thesaurus data source.","refs":[]},{"text":"The Export Module offers a service to other systems that need to access to information about epigraphs, acting as a bridge between them and the Retrieval Module.","refs":[]},{"text":"The Data Management Module performs the tasks which are mainly related to the activity of compilers. In particular, this component allows the users to insert, edit and delete data about the epigraphs and manage all their aspects, such as the related literature and the geographic positions associated to the original context or to the current location of conservation.","refs":[]},{"text":"The Image Management Module allows the users (mainly compilers) to manage, i.e. insert into, editing or deleting from, the image repository. Part of the Fig. 3. On the left, an example of aberrant forms of the term \"vixit\". On the right, a set of terms which can be mapped to the same term \"vivus\".","refs":[{"start":158,"end":159,"marker":"figure","target":null}]},{"text":"image repository is obtained via web queries to the Pontificia Commissione di Archeleogia sacra (PCAS) web site 1 .","refs":[{"start":112,"end":113,"marker":null,"target":"#foot_0"}]},{"text":"The Data Mining Module allows the users (mainly data analysts) to execute data mining algorithms on the available data, in order to discover valuable knowledge, which is then stored in the Knowledge Base. This component accesses data through the Retrieval Module. An example of data mining task which can be applied to epigraphs is reported in Section 2.4.","refs":[]}]},{"title":"Dealing with Aberrant Forms through a Thesaurus","paragraphs":[{"text":"Among all the possibilities that a user can exploit to find an epigraph of interest, the text-based search on the inscription is one of the most straightforward way provided by the Retrieval Module.","refs":[]},{"text":"However, in this particular domain, a simple matching strategy between the query and the text of the inscriptions stored in the database can easily fail, since i) the same term could have changed in its phonetic or orthography over time (aberrant forms) and ii) many different terms semantically map to the same concept (see Figure 3).","refs":[{"start":332,"end":333,"marker":"figure","target":null}]},{"text":"In this context, it is useful to design a thesaurus containing the relations between aberrant forms and normal forms as well as the sets of terms which map to the same concepts. In this way, the quality of the results returned by the Retrieval Module can be substantially improved, since it can easily map each term contained in the query and in text of the inscriptions to its normal form (and/or to the term which express the general concept), before verifying the matching between the query and the inscription.","refs":[]}]},{"title":"Novelty Detection","paragraphs":[{"text":"In this subsection we report one of the possible data mining tasks, called novelty detection, which can be applied on data about epigraphs. In particular, the main goal of this task is to identify emerging patterns, that is, patterns which show relevant changes (in frequency) over time. Therefore, this task is strongly related to the temporal dimension associated to the epigraphs.","refs":[]},{"text":"Since epigraphs can usually be associated to an historical period (dating), even to a single year or to a definite time interval, it could be interesting to identify how social and cultural changes over time have affected the epigraphs, in the phonetics or in the orthography as well as in the used materials or in the executing techniques.","refs":[]},{"text":"This task requires to deal with several pre-processing issues. In particular:","refs":[]},{"text":"-Identification of the reference objects and of the task-relevant objects. In this case, target objects are clearly the epigraphs, while the task relevant objects are the materials, the executing techniques, the different kinds of writing, etc. -Definition of proper time intervals (or time windows), which consists in the identification of an adequate number of intervals and in the choice of the discretization method to apply (e.g. equal width, equal frequency, clusteringbased discretization). -Feature selection, that is, identification of features of interest among all the available ones, in order to focus the algorithm only on the relevant data.","refs":[]},{"text":"In the following we report two examples of possible emerging patterns, expressed as a list of logical predicates, which could be discovered by applying novelty detection algorithms to data about epigraphs.","refs":[]},{"text":"[250, 349] → [350, 399] : epigraph(E), transcription(E, T ), term(T, \"vixit\")","refs":[]},{"text":"[250, 349] → [350, 399] : epigraph(E), pertinence area(E, \"Via Appia\") (2)","refs":[]},{"text":"In the example (1), the discovered pattern describes a relevant increase of the number of epigraphs containing the term \"vixit\" in their transcription, in the time interval [350,399] with respect to the time interval [250,349]. The pattern in the example (2) emphasizes an increased amount of epigraphs in the area of \"Via Appia\", in the same period.","refs":[{"start":173,"end":178,"marker":"bibr","target":null},{"start":178,"end":182,"marker":"bibr","target":null},{"start":217,"end":222,"marker":"bibr","target":null},{"start":222,"end":226,"marker":"bibr","target":null}]},{"text":"The discovered patterns can be ranked according to some measures of relevance, such as the growth rate, which represents the relative variation of the support of the pattern in the considered time intervals.","refs":[]},{"text":"It is noteworthy that the discovered patterns can suggest the researchers some relevant aspects that are worth to be deeply investigated, since they can describe social and cultural changes otherwise difficult to identify in the huge amount of available data.","refs":[]}]},{"title":"Application to Roman Inscriptions","paragraphs":[{"text":"EDB (Epigraphic Database Bari) 2 is an online, freely accessible, database hosted by the University of Bari. It includes about 30000 Christian inscriptions of Rome, including inscriptions published in the Inscriptiones Christianae Vrbis Romae septimo saeculo antiquiores, nova series (ICVR) editions. The ICVR editions started in 1922 with the first volume and is going to end with the eleventh volume in the next years.","refs":[]},{"text":"Similar initiatives are EDR (Epigraphic Database Roma) 3 , EDH (Epigraphic Database Heidelbergh) 4 and HE (Hispania Epigraphica) 5 . However, they actually do not offer the possibility of performing complex text-based search, also with the help of the thesaurus. Furthermore, data about epigraphs are not entirely reported in each of these databases, since they may focus on different specific aspects. The project EAGLE (Europeana network of Ancient Greek and Latin Epigraphy), indeed, aims at the creation of a federation of these databases (including EDB), in order to allow the researcher to retrieve data about epigraphs in an integrated way from all the databases.","refs":[{"start":55,"end":56,"marker":null,"target":"#foot_2"},{"start":97,"end":98,"marker":null,"target":"#foot_3"},{"start":129,"end":130,"marker":null,"target":"#foot_4"}]},{"text":"Currently, EDB includes the text and the metadata of around 30000 inscriptions, discovered, classified and enriched with semantic metadata by Carlo Carletti and his team. EDB makes freely available over the web the inscriptions  EDB allows access to an unique cultural heritage which is in its major part not accessible by public visitors.","refs":[]},{"text":"Figure 4 shows the main page of the EDB web site. In order to maximize the user experience, EDB is implemented using HTML5 and CSS3. This allows users to fully access the information stored in EDB using a common web browser, a tablet or a smartphone. Moreover, all the functionalities of the web applications are exposed through a restful interface [14].","refs":[{"start":7,"end":8,"marker":"figure","target":"#fig_2"},{"start":349,"end":353,"marker":"bibr","target":"#b13"}]},{"text":"The main functionality offered by EDB is in the epigraph search. In Figure 5a the basic search web page is presented. Epigraphs can be retrieved on the basis of their EDB identifier, their ICVR volume and number, by the religious identity of the epigraph (Christian, Jewish and Pagan), by the area and context of pertinence, as well as by specifying a textual query and using the thesaurus. The text for a query can be written using latin words and greek words by enabling an automatic greek inputter inserted in the query web page. For example (see Figure 5a) if the user searches for epigraphs of type Christian, which are discovered on the via Appia, in the context coem. ad Vibiam and such that their text contains vixit, EDB currently retrieves 11 matching inscriptions (see Figure 6). This figure shows the text of the inscriptions and the related metadata. In particular, it shows information on (from the top left corner) the ICVR volume, the reference literature, the area of pertinence and its context, the place where the inscription is physically stored, the support and the technique used, the editing time (which is estimated by archeologists), a link to the image of the inscription on the PCAS web site and, finally, its text.","refs":[{"start":75,"end":77,"marker":"figure","target":"#fig_3"},{"start":557,"end":559,"marker":"figure","target":"#fig_3"},{"start":787,"end":788,"marker":"figure","target":"#fig_4"}]},{"text":"Moreover, thanks to the spatial database, all the inscriptions stored in EDB are geo-referenced. Figure 5b shows as example the geographic position of the coem. Callisti area subdialis situated in the via Appia.","refs":[{"start":104,"end":106,"marker":"figure","target":"#fig_3"}]},{"text":"All the stored information allow us to evaluate the effort made by the archeologist and by EDB ecosystem to add valuable information to the text of the epigraph. This is the added value of the EDB project. ","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"This paper presents the system EDB which supports epigraphists in storing, managing and retrieving information on a large repository of Italian inscriptions found in the area of Rome. Peculiarities of the proposed system are in the possibility of managing, in addition to metadata, geo-spatial information and references which cite the specific epigraph. EDB also supports time-based analysis of epigraphs which aims at detecting and representing changes of inscriptions in their properties/metadata over time.","refs":[]},{"text":"By means of its web interface, it also allows (possibly non-expert) web-users to define search queries and retrieve all the necessary information. Search queries are automatically expanded by the system, according to a thesaurus, in order to consider aberrant forms.","refs":[]},{"text":"The effectiveness of EDB is proved by its current and extensive use by a team of epigraphists which elaborate a set inscriptions discovered over 25 years of archeological research and studies inside the Roma's catacombs.","refs":[]},{"text":"Lombardi, Filippo Piazzolla, Marida Pierno, Miriam Ramunni, Domenico Schiraldi and Carolina Ventura.","refs":[]},{"text":"This work partially fulfills the research objectives of the PON 02 00563 3470993 project \"VINCENTE -A Virtual collective INtelligenCe ENvironment to develop sustainable Technology Entrepreneurship ecosystems\" funded by the Italian Ministry of University and Research (MIUR).","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Classical Greek and Latin culture is the very foundation of the identity of modern Europe. Today, a variety of modern subjects and disciplines have their roots in the classical world: from philosophy to architecture, from geometry to law. However, only a small fraction of the total production of texts from ancient Greece and Rome has survived up to the present days, leaving many ample gaps in the historiographic records. Epigraphy, which is the study of inscriptions (epigraphs), aims at plug this gap. In particular, the goal of Epigraphy is to clarify the meanings of epigraphs, classifying their uses according to dates and cultural contexts, and drawing conclusions about the writing and the writers. Indeed, they are a kind of cultural heritage for which several research projects have recently been promoted for the purposes of preservation, storage, indexing and on-line usage. In this paper, we describe the system EDB (Epigraphic Database Bari) which stores about 30,000 Christian inscriptions of Rome, including those published in the Inscriptiones Christianae Vrbis Romae septimo saeculo antiquiores, nova series editions. EDB provides, in addition to the possibility of storing metadata, the possibility of i) supporting information retrieval through a thesaurusbased query engine, ii) supporting time-based analysis of epigraphs in order to detect and represent novelties, and iii) geo-referencing epigraphs by exploiting a spatial database.","refs":[]}]}}