{"bibliography":{"title":"Digital Cultural Content: National and European Projects and Strategies","authors":[{"person_name":{"surname":"Caffo","first_name":"Rossella"},"affiliations":[{"department":"Ministero per i Beni e le Attività Culturali Istituto centrale per il catalogo unico delle biblioteche italiane e per le informazioni bibliografiche (ICCU)","institution":null,"laboratory":null}],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{},"sections":[{"title":"MINERVA (2002-2008) -www.minervaeurope.org","paragraphs":[{"text":"The first initiative coordinated by the Ministry was MINERVA, the network of the ministries of culture of the Member States that worked for the harmonization of digitization efforts. Between 2002 and 2008 MINERVA produced several results in terms of concrete tools and strategic actions and today is recognized as a trustworthy name.","refs":[]},{"text":"The project was articulated in three phases, each of them coordinated by MiBAC: MINERVA operated through the coordination of national digitization policies and programs and supported the National Representatives Group for digitization (NRG) in order to facilitate the creation of added value products and services shared at the European level, to improve awareness of the state-of-the-art in the sector, to contribute to overcoming fragmentation and duplication of digitization activities of cultural and scientific content and to maximize cooperation among the Member States.","refs":[]},{"text":"2 MICHAEL (2004-2008) -www.michael-culture.org MICHAEL was a MINERVA spin-off; it has realized a European multilingual portal which provides integrated access to European cultural heritage through the collections of museums, libraries, archives and other cultural institutions and organizations.","refs":[]},{"text":"MICHAEL has a distributed organization involving thousands of institutions belonging to every domain at the national, regional and local level.","refs":[]},{"text":"At the national level MiBAC involved all its sectors and offices: State archives (about 130), State libraries (almost 50), and hundreds of museums, heritage offices etc, covered at the regional level through MiBAC Regional Directorates.","refs":[]},{"text":"MiBAC stipulated cooperation agreements with all the 20 Italian Regions and with Universities coordinated through CRUI-Padua University.","refs":[]},{"text":"MICHAEL describes both the collections and its context. The MICHAEL data model is suitable for describing digital collections belonging to all cultural heritage sectors and recording related contextual information to Institutions (creator, owner, keeper, manager), Projects / programs (funding), Services / products (giving access) and Physical collections (represented full or in part).","refs":[]},{"text":"The national MICHAEL portals can be visited at the following addresses: ","refs":[]}]},{"title":"CULTURAITALIA -www.culturaitalia.it","paragraphs":[{"text":"CulturaItalia is the Italian Culture Portal. It is a cross-domain initiative based on the results of past digitization projects coordinated by the Ministry (mainly MINERVA and MICHAEL) and on the most widespread international interoperability standards.","refs":[]},{"text":"In Italy, CulturaItalia is the first portal to offer a single and integrated access point to Italian cultural heritage.","refs":[]},{"text":"The Portal is a collaborative project since it is being carried out in cooperation between all the Ministry's offices, the Regions, Universities, and private and local Institutions.","refs":[]},{"text":"CulturaItalia aims to communicate the various aspects of Italian culture (heritage, landscape, cinema, music, literature etc.) and to make the digital cultural content available to a wide audience.","refs":[]},{"text":"CulturaItalia is organized as a unique index of data and metadata harvested from several metadata repositories.","refs":[]},{"text":"A specific Application Profile (PicoAp) has been developed for CulturaItalia to describe the digital objects and the tangible resources of all the cultural heritage sectors. The metadata are described by the PICO-AP and classified through the PICO Thesaurus, a controlled vocabulary conceived for addressing the digital resources to the index and the thematic menus.","refs":[]},{"text":"Through metadata harvesting and the implementation of PicoAp, CulturaItalia is therefore able to aggregate the digital resources of hundreds of Italian \"digital libraries\".","refs":[]},{"text":"CulturaItalia, like the other national multidisciplinary aggregators, can contribute to Europeana by making available the databases, the cooperatives resources, the contacts and the agreements stipulated with hundreds of Institutions.","refs":[]},{"text":"CulturaItalia is the national aggregator towards Europeana, the European digital library. ATHENA aims to:","refs":[]}]},{"title":"ATHENA (2008-2011) -www.athenaeurope.org","paragraphs":[{"text":"reinforce, support and encourage the participation of museums and other institutions coming from those sectors of cultural heritage not fully involved yet in the EDL; contribute to the integration of the different sectors of cultural heritage, in cooperation with other projects more directly focused on libraries and archives, with the overall objective of merging all these different contributions into the EDL; develop a set of plug-ins to be integrated within the EDL, to facilitate access to the digital content belonging to European museums.","refs":[]},{"text":"ATHENA will also produce a set of scalable tools, recommendations and guidelines, focusing on multilingualism and semantics, metadata and thesauri, data structures and IPR issues, to be used within museums for supporting internal digitization activities and facilitating the integration of their digital content into the EDL. All these outputs R. Caffo will be based on standards and guidelines agreed by the partner countries for harmonized access to the content, and will be easily applicable.","refs":[]},{"text":"The final aim of ATHENA is to bring together relevant stakeholders and content owners from all over Europe, evaluate and integrate standards and tools for facilitating the inclusion of new digital content into the EDL, thus conveying to the user the original and multifaceted experience of all the European cultural heritage.","refs":[]},{"text":"ATHENA will work in close cooperation with existing projects (e.g. EDLnet and Michael, both present in ATHENA) and develop intense clustering activities with other relevant projects. The final aim of the DC-NET project is to generate a powerful and comprehensive plan of joint activities for the implementation of a new data and service e-Infrastructure for the virtual research community in the Digital Cultural Heritage. The new Digital Cultural Heritage e-Infrastructure will be based on the enhancement of the MICHAEL platform and will deploy a wide range of end-to-end services and tools facilitating integration and increasing of the research capacities in the sector. The new e-Infrastructure will be targeted towards a multidisciplinary virtual research community on digital cultural heritage that is demanding more and more empowered functions (access, search, storage, usability, etc.) to improve their scientific collaboration and innovation.","refs":[]},{"text":"DC-NET aims to: create a place for the dialog between the community of digital cultural heritage and the e-Infrastructures, generating a common awareness of the reciprocal research items involve all the relevant stakeholders through a program of seminars, workshops, meetings and conferences enlarge the network to involve all the countries who are willing to join DC-NET create a joint commitment among the participating countries to implement the joint activities plan.","refs":[]}]}],"tables":{"tab_0":{"heading":"MINERVA eC, on","description":"the basis of the achieved results, develops supporting actions for the development of the European Digital Library, EU-ROPEANA.","rows":[["The MINERVA eC activities are related to:"],["• Workshops and seminars on:"],["o MINERVA tools for digitization of cultural heritage"],["o Quality of cultural websites"],["• Plenary meetings, in coordination with the rotating Presidency of the European"],["Union"],["• Guidelines and studies: IPR guidelines, technical guidelines, study on user needs,"],["report on content interoperability, best practice on digitization, cost reduction in"],["digitization, multilingualism, quality, accessibility and usability of contents, an-"],["nual report on digitization."]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"For many years the Central Institute for the Single Catalogue of Italian Libraries (ICCU) of the Italian Ministry for Cultural Heritage has been involved in the coordination of European and national projects that promote the digitization and online accessibility of cultural heritage.","refs":[]}]}}