{"bibliography":{"title":"Reflecting on the Europeana Data Model","authors":[{"person_name":{"surname":"Peroni","first_name":"Silvio"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bologna","laboratory":null}],"email":null},{"person_name":{"surname":"Tomasi","first_name":"Francesca"},"affiliations":[{"department":"Department of Classical Philology and Italian Studies","institution":"University of Bologna","laboratory":null}],"email":"francesca.tomasi@unibo.it"},{"person_name":{"surname":"Vitali","first_name":"Fabio"},"affiliations":[{"department":"Department of Computer Science","institution":"University of Bologna","laboratory":null}],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Edm","Dc","Rdf","Frbr","Linked data","Cidoc crm"],"citations":{"b0":{"title":"Europeana v1.0","authors":[{"person_name":{"surname":"Aloia","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Concordia","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Meghini","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":249,"pages":{"from_page":127,"to_page":129}}},"b1":{"title":"Definition of the Europeana Data Model","authors":[],"date":{"year":"2012","month":"02","day":"24"},"ids":null,"target":"http://pro.europeana.eu/documents/900548/bb6b51df-ad11-a78-8d8a-44cc41810f22","publisher":null,"journal":null,"series":null,"scope":{"volume":5,"pages":null}},"b2":{"title":"Europeana Semantic Elements Specification","authors":[],"date":{"year":"2011","month":"03","day":"31"},"ids":null,"target":"http://pro.europeana.eu/documents/900548/4968d0bd-416b-48ed-bc67-6a4a47f09098","publisher":null,"journal":null,"series":null,"scope":{"volume":3,"pages":null}},"b3":{"title":"Europeana Data Model Primer","authors":[],"date":{"year":"2011","month":"10","day":"26"},"ids":null,"target":"http://pro.europeana.eu/documents/900548/770bdb58-c60e-4beb-a687-874639312ba5","publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"data.europeana.eu: The Europeana Linked Open Data Pilot","authors":[{"person_name":{"surname":"Haslhofer","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Isaac","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":94,"to_page":104}}},"b5":{"title":"Augmenting Europeana Content with Linked Data Resources","authors":[{"person_name":{"surname":"Haslhofer","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Roochi","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Gay","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Simon","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":null},"b6":{"title":"Dublin Core Metadata Element Set","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":1,"pages":null}},"b7":{"title":"DCMI Metadata Terms, DCMI Recommendation","authors":[],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":"http://dublincore.org/documents/dcmi-terms/","publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"SKOS Simple Knowledge Organization System Reference","authors":[{"person_name":{"surname":"Miles","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Bechhofer","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2009","month":"08","day":"18"},"ids":null,"target":"http://www.w3.org/TR/skos-reference/","publisher":null,"journal":null,"series":null,"scope":null},"b9":{"title":"Abstract Data Model. ORE Specification. Open Archives Initiative","authors":[{"person_name":{"surname":"Lagoze","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Van De Sompel","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Johnston","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Nelson","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Sanderson","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Warner","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2008","month":"10","day":"17"},"ids":null,"target":"http://www.openarchives.org/ore/1.0/datamodel12","publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"Information and documentation-A reference ontology for the interchange of cultural heritage information","authors":[],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":"International Organization for Standardization","journal":null,"series":null,"scope":null},"b11":{"title":"Definition of the CIDOC Conceptual Reference Model","authors":[{"person_name":{"surname":"Crofts","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Doerr","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Gill","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Stead","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Stiff","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2011","month":"11","day":null},"ids":null,"target":"http://www.cidoc-crm.org/docs/cidoc_crm_version_5.0.4.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Europeana Data Model Mapping Guidelines","authors":[],"date":{"year":"2012","month":"02","day":"24"},"ids":null,"target":"http://pro.europeana.eu/documents/900548/ea68f42d-32f6-4900-91e9-ef18006d652e","publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"Linked Data: Evolving the Web into a Global Data Space","authors":[{"person_name":{"surname":"Heath","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Bizer","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":{"DOI":"10.2200/S00334ED1V01Y201102WBE001","arXiv":null},"target":null,"publisher":"Morgan & Claypool Publishers","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Europeana 1 is the European Digital Library, a distributed access point to Europe's multilingual cultural heritage in a digital form. The main aim of the project is to collect metadata from a large number of providers, mainly cultural institutions, across Europe, and to enable search and discovery of cultural items described therein.","refs":[{"start":10,"end":11,"marker":null,"target":"#foot_0"}]},{"text":"The metadata aggregation is based on a mapping between the providers' data description and the Europeana model. The Europeana v1.0 project2 [1] proposes the Europeana Data Model (EDM) 3 that defines a set of classes and properties to be used in Europeana for describing cultural objects. The EDM [2] is a clear improvement over the earlier data model, the Europeana Semantic Elements (ESE) [3]. ESE was meant to express the providers' datasets using the Dublin Core (DC) standard as its \"lowest common denominator\", while EDM, based on the DCMI Metadata Terms and a number of more advanced metadata models, adopts \"an open, cross-domain Semantic Web-based framework\" leaving each provider free to use their preferred metadata standard with regard to the element sets and the vocabularies of values [4].","refs":[{"start":138,"end":139,"marker":null,"target":"#foot_1"},{"start":140,"end":143,"marker":"bibr","target":"#b0"},{"start":184,"end":185,"marker":null,"target":"#foot_2"},{"start":296,"end":299,"marker":"bibr","target":"#b1"},{"start":390,"end":393,"marker":"bibr","target":"#b2"},{"start":798,"end":801,"marker":"bibr","target":"#b3"}]},{"text":"Given this, an extreme heterogeneity can be observed in the descriptions of cultural objects, a situation determined by the differences in existing collections that Europeana involves (museums, archives, audiovisual collections and libraries), and by the different kinds of objects described in the cultural repositories that were harvested (i.e. manuscripts, documents, paintings, art and architecture objects, photos, videos, etc.). Also, the variety of descriptive situations depends both on the reference models for the metadata element sets (not only DC, SKOS, and the CIDOC CRM, but also e.g., EAD for archives, METS for digital libraries, TEI for literary texts 4 ) and from the vocabularies of values (authority lists, thesauri or controlled vocabularies) used by data providers (such as Geonames, Art&Architecture Thesaurus, Iconclass, WordNet, Dewey Decimal Classification, DBPedia, etc.) 5 .","refs":[{"start":669,"end":670,"marker":null,"target":"#foot_3"},{"start":899,"end":900,"marker":null,"target":"#foot_4"}]},{"text":"Furthermore, even if the EDM has been introduced, a majority of records in Europeana still seems to follow the old ESE data model and the users' query interface is based on just a few categories of Dublin Core. The main problems in using the current release of Europeana derives in part from the above-mentioned issues: the original object descriptions are often lost and the ESE, the first proposed model, was not sufficient to describe the complexity of many cultural objects, as it was based on just a few DC categories. Providers that had complex and structured descriptions have had to force them into to a much simpler model and providers that created descriptions in a model not compliant with ESE have lost data or have forced them into incorrect properties, leading to aggregations of imprecise information. Consequently, many user queries cannot be satisfied completely. Probably the complete integration of EDM in Europeana records will help towards completeness and correctness of the contained information. But some other improvements could solve many situations that not even EDM takes into complete account.","refs":[]},{"text":"The whole point of this effort clearly is to allow users to enact better queries and to obtain better results through the use of a sophisticated and increasingly ontological metadata model on which to let the search engine work. Europeana is now working on improving the quality of the responses to users' queries, but much is still to be done.","refs":[]},{"text":"For example at the moment there is no possibility to perform a multilingual search, although the vocabulary alignment is a problem being studied currently by the Europeana group, since one of the aims of subproject EuropeanaConnect 6 is in fact to solve this gap. Some other features are planned to be implemented using Semantic Web technologies 7 . For example, Europeana lacks a semantic network for the subjects, that could help users in finding records by specifying either the exact word or any of its synonyms, hyponyms, hypernyms, related terms, etc. WordNet, for example, has been published as a RDF vocabulary 8 and could be used after a vocabulary alignment. Another issue that Semantic Web technologies could solve is to enrich the existing metadata sets, contextualising objects and using authoritative sources, including controlled vocabularies, concretely shared in an integrated environment. The \"related content\", presented in each object description in Europeana, is now mostly limited to other objects from the same data provider. More complex and structured relationships between what Europeana calls the provided \"Cultural Heritage Object (CHO)\" [2] and other pertinent resources, internal (other data providers) or external (other digital libraries), could be solved in a Linked Data perspective.","refs":[{"start":346,"end":347,"marker":null,"target":"#foot_6"},{"start":1166,"end":1169,"marker":"bibr","target":"#b1"}]},{"text":"Although some features are now being studied as an experimental increment to the existing feature set, some discrepancies could be noticed between the EDM and the objects described, for which we do not know of any on-going work.","refs":[]},{"text":"In this paper we analyze the query results of the current implementation and propose some reflections on the EDM in this phase of implementation. We focus here on three aspects, derived from the adoption of DC as the end-user property set: the \"media type\" concept, the multi-layer description of subjects and the connection between roles and values (Section 3). Even if the original adoption of DC is the main reason for the limitations in user queries, a redefinition of some classes and properties of EDM could solve some issues. Finally, given that one of the main aims of Europeana project is to expose metadata as Linked Open Data we verified that the current implementation is fairly good for the data that has been converted, but is still lacking in handling properly error cases. For this reason we analysed the \"data.europeana.eu\" Linked Data responses and the issues with empty resources (Section 4).","refs":[]}]},{"title":"Related Works","paragraphs":[{"text":"In its specifications (EDM), Europeana mentions vocabularies, models and ontologies adopted in its data model [2]. The aim is to represent metadata for cultural heritage objects and to give access to digital representations of these objects. The EDM moves in the context of data aggregation, where objects can be complex, and several data providers may entertain different views on them. The basis of the metadata description is RDF statements. An XML Schema has been defined for describing classes and properties. Some classes and properties are reused from public models: DC, DCterms, SKOS, OAI-ORE, CIDOC-CRM, FRBR. Some other classes and properties are specifically created for the EDM and are mostly equivalent to predicates used in the most common ontologies.","refs":[{"start":110,"end":113,"marker":"bibr","target":"#b1"}]},{"text":"In addition to classes and properties, Europeana is defining also controlled vocabularies useful for CHO interoperability (such as AAT, DDC, DBpedia, Iconclass). The main aim of Europeana is to work on Linked Data both exposing record sets [5] and using Linked Data resources [6] in order to augment Europeana content.","refs":[{"start":240,"end":243,"marker":"bibr","target":"#b4"},{"start":276,"end":279,"marker":"bibr","target":"#b5"}]},{"text":"In the following sub-sections we introduce the main external models adopted by EDM, highlighting which part of them are effectively used.","refs":[]}]},{"title":"Dublin Core","paragraphs":[{"text":"The current versions of the Dublin Core (DC) Metadata Elements [7] and of the DC Metadata Terms [8] are the most widely used vocabularies for describing and cataloguing resources. These vocabularies have become particularly important and relevant for sharing metadata about documents among different repositories and digital libraries.","refs":[{"start":63,"end":66,"marker":"bibr","target":"#b6"},{"start":96,"end":99,"marker":"bibr","target":"#b7"}]},{"text":"While very useful for creating basic metadata that permit bibliographic resource descriptions (e.g., creator, contributor, publisher, format), the main limitation of DC is a consequence of the generic nature of its terms. In fact, its classes are organised without a strong hierarchical structure and their properties often lack in clear domain/range definitions. EDM makes extensive use of DC Elements and DC Terms entities, such as the properties dc:subject, dc:contributor, dcterms:created and dcterms:alternative.","refs":[]}]},{"title":"Skos","paragraphs":[{"text":"Data providers, publishers and aggregators, such as Europeana, need to classify the resources they publish according to discipline-specific thesauri and classification schemes. The Simple Knowledge Organization System (SKOS) [9] is an RDFS ontology to support the use of knowledge organization systems (KOS). A large number of well-known thesauri and classification systems have started to convert their specifications into SKOS documents, such as the \"Nuovo Soggettario\" of the National Central Library in Florence 9 . This makes SKOS the de facto standard for encoding controlled vocabularies for the Semantic Web. EDM uses the main SKOS class, i.e. skos:Concept, defined as a particular kind of edm:NonInformationResource for introducing an idea or notion.","refs":[{"start":225,"end":228,"marker":"bibr","target":"#b8"},{"start":516,"end":517,"marker":null,"target":"#foot_7"}]}]},{"title":"Frbr","paragraphs":[{"text":"The Functional Requirements for Bibliographic Record (FRBR) [10] is a general model for describing bibliographic entities, such as documents and artistic works. FRBR specifies four basic concepts -work, expression, manifestation and item -used for characterising a particular bibliographic entity from different perspectives. In particular:","refs":[]},{"text":"• A work is the abstract essence of an intellectual or artistic creation, e.g. the ideas in Shakespeare's head concerning the Macbeth. A work is realised in one or more expressions;","refs":[]},{"text":"• An expression is the content of a particular work at a specific point in time, e.g. the final text of the Macbeth written by Shakespeare or its Italian translation made by Andrea Maffei. An expression is embodied in one or more manifestations; • A manifestation is the particular format in which an expression is stored, such as a printed object or a digital document, e.g. the 2005 edition of Macbeth published by Penguin Books or its HTML Italian version published by. A manifestation is exemplified in one or more item; • An item is a particular physical or electronic copy of the Macbeth that a person can own, e.g. the printed version of that book you have in your bookcase or the specific HTML document of its Italian version you are visualising in your browser.","refs":[]},{"text":"Overall, EDM makes only limited use of FRBR concepts, although it declares explicitly their adoption. The only specific references to FRBR are:","refs":[]},{"text":"• the class edm:InformationResource, defined as union of FRBR Work, FRBR Expression and FRBR Manifestation that results in collapsing completely the hierarchy of the FRBR model;","refs":[]},{"text":"• the classes edm:Event and edm:Place, defined as equivalent to FRBR Event and FRBR Place respectively.","refs":[]}]},{"title":"Ore","paragraphs":[{"text":"The Open Reuse and Exchange specification (ORE specification) [11] is a standard defined by the Open Archives Initiative for describing and exchanging aggregations of Web resources. Europeana uses two terms from this model:","refs":[{"start":62,"end":66,"marker":"bibr","target":"#b9"}]},{"text":"• Aggregation, i.e. a particular resource that aggregates, either logically or physically, other resources; • Proxy, used to refer to a specific aggregated resource in a context of a particular aggregation.","refs":[]},{"text":"EDM uses all the main classes and properties of the ORE specification. For instance, it allows one to describe a \"cultural heritage object\" (i.e., edm:providedCHO) and its digital representations (i.e., edm:WebResource) as a particular aggregation (ore:Aggregation) representing the results of the activity of a particular data provider (i.e., edm:Agent).","refs":[]}]},{"title":"Cidoc crm","paragraphs":[{"text":"CIDOC Conceptual Reference Model (CRM) [12] is an ISO standard defining a model for describing and sharing cultural heritage information. It provides entity definitions and a formal multi-level structure to link physical objects to related events and agents (i.e., people and organisations), so as to represent a mediator between different sources of cultural heritage information (e.g., museums, libraries and archives). EDM aligns some of its classes and properties to the CIDOC CRM specification, for instance the class edm:Event as equivalent to E4 Period, the class edm:InformationResource as subclass of E73 Information Object, and the property edm:wasPresentAt as equivalent to P12 occurred in the presence of (was present at)10 .","refs":[{"start":733,"end":735,"marker":null,"target":"#foot_8"}]}]},{"title":"Issues Arising While Using Europeana","paragraphs":[{"text":"The EDM rationale is based on some principles [14]:","refs":[{"start":46,"end":50,"marker":"bibr","target":"#b12"}]},{"text":"1. distinction between \"provided objects\" (painting, book, movie, etc.) and their digital representations; 2. distinction between objects and metadata records describing an object; 3. allow for multiple records for a same object, containing potentially contradictory statements about it; 4. support for objects that are composed of other objects; 5. compatibility with different levels of description; 6. standard metadata format that can be specialized; 7. support for contextual resources, including concepts from controlled vocabularies.","refs":[]},{"text":"Although the Europeana core classes stress the difference between the provided object (edm:ProvidedCHO), i.e, the \"real object\", and its digital representation (edm:WebResource), i.e., its Web resource, sometimes this difference is not evident at all in the aggregated metadata exposed to the final user, generating confusion. Sometimes the description seems to be addressed to the electronic version, some other to the original work, without a clear distinction (see 3.1). Additionally, the Europeana contextual classes, which are designed to answer to the four fundamental questions of the who (the Agent), the where (the Place), the when (the Time), and the what (the Concept) of the object, sometimes are not correctly represented in the metadata description because of a potential multi-layer representation issue derived from the stratification of object and subject (see 3.2). Therefore, the rationale of the EDM appears not always respected and the application of the listed properties is not totally functional (see 3.3). Here we describe some examples of these limits.","refs":[]}]},{"title":"The Media Type","paragraphs":[{"text":"The first and most evident source of confusion is the concept of media type found as the topmost choice in the filter section after every query (edm:type = text, image, audio, video). The media type is sometimes congruent with the type of the provided CHO, and sometimes to its web resource. Yet, the rationale of Europeana is to distinguish between the description of the CHO and its digital representation. If we search for any object called \"illuminated manuscript\" we receive different answers: sometimes it has type \"text\", sometimes type \"image\" some other times \"physical object\".","refs":[]},{"text":"In general, resources classified as IMAGE are in fact image files (regardless of whether they represent pictures or physical objects such as buildings or statues or manuscripts), but resources classified as TEXT are sometimes texts, and sometimes images of texts (e.g., photographs of old volumes or manuscripts). One may wonder which would be more useful for searches, i.e., for the media type to refer to the web resource, providing a description of a computer-specific object, or to the cultural heritage object, which is what the user would be actually searching for. In both cases, it would be quite important to provide subtypes: they could be either subtypes of the relevant Internet MIME type 11 in the first case, or a selection of the values found in the dc:type facet of the records as specified in the collections in the other case.","refs":[]}]},{"title":"Multi-layer Descriptions","paragraphs":[{"text":"The issue of the separation between web resource and cultural heritage object can be subsumed in the issue of separating objects and subjects in record descriptions. In fact, what does exactly a Europeana record describe? Is it an image, the content of the image, or the object represented in the content of the image? Sometimes this is easy to understand, and sometimes it creates interpretation issues, and the problem of distinguishing between object and subject in a record can go several layers deep. For instance, consider the 1756 publication by Giambattista Piranesi called \"Le antichità romane\", containing prints of famous Roman monuments, including the Coliseum. A best seller of the time, the volume appears in several of the collections of Europeana. We analysed 3 items, alla 3 form the Bildarchiv Foto Marburg as data provider. According to one item 12 , the page representing the Coliseum is of dc:type druck (print), dc:creator Giambattista Piranesi, dc:date 1756. According to another 13 , the same page is of dc:type amphitheatre, dc:description Location:Rome and its dc:date is 70/80 a.D. (and no dc:creator), but reports (in the dc:description field) that the actual photo was taken in 1956, and that the content is an extract of the Piranesi's book of 1756. This is coherent with several colour photographs of the Coliseum 14 present in the same collection, whose dc:type is also amphitheatre, dc:date is 72/80 a.D., further adding that dc:format is travertine, and dc:contributor is Vespasianus (as contractor).","refs":[]},{"text":"In cases such as Piranesi's, the number of layers of subjects is multiple: the CHO being described is a 1956 b/w photograph of unknown creator, whose subject is a 11 http://www.iana.org/assignments/media-types/text/index.html 12 http://www.europeana.eu/portal/record/08501/ 7B74073B6E9E90F5B572EF6DF20426AF0135202E.html 13 http://www.europeana.eu/portal/record/08501/ EA45A0B5F838ABDDD1956DE3BE636A70F1B8EA8A.html 14 http://www.europeana.eu/portal/record/08501/ 43E4B1EF54983567EC92DDCDD57B3DBD2D4CC013.html 1756 print whose creator is Giambattista Piranesi, whose subject is a 70 a.D. travertine amphitheatre whose creator (as contractor) was Vespasianus. If we add the issue of the media type of the web resource, as introduced in 3.1, an additional level becomes manifest: we are describing a 21 st century JPEG image of a 20 th century photograph of a 18 th century print of a 1 st century building.","refs":[]},{"text":"One of the most frequent dilemmas for a provider of metadata about an object is deciding whether interesting information for which no natural facet is available should be omitted, forced into an inappropriate facet (e.g., the dc:type or dc:date in the above examples), or dumped into a generic container (e.g., the dc:description above). A better solution would be to use a metadata model whose characteristic naturally accommodates the interesting information. As such, a simple solution exists already for the layers of subjects: while in DC the subject is \"the topic of the resource [that is] typically […] represented using keywords, key phrases, or classification codes\", in FRBR \"the «has as subject» relationship indicates that any of the entities in the model, including work itself, may be the subject of a work\".","refs":[]},{"text":"Thus the example of the print by Piranesi could be expressed more precisely and with fewer misunderstanding as a record for a JPEG image whose frbr:subject is a 1956 photo whose frbr:subject is a 1756 print whose frbr:subject is a roman building, for instance as in figure 1  Fig. 1. An OWL rendering of the correct relationships between subject layers using FRBR (all other facets are expressed as in the original examples for simplicity) 15 In this and all subsequent examples, we use the following prefixes (please note that the prefixes with the Europeana domain are fictitious, are present in these example only as a suggestion and do not correspond to existing ontologies): @prefix resource: <http://data.europeana.eu/resource/> @prefix ontology: <http://data.europeana.eu/ontology/> @prefix foaf: <http://xmlns.com/foaf/0.1/> @prefix pro: <http://purl.org/spar/pro/> @prefix dc: <http://purl.org/dc/elements/1.1/> @prefix frbr: <http://purl.org/vocab/frbr/core#> @prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> resource:antichità-romane a ontology:Print ; dc:date \"1756\" ; dc:creator \"Giovanbattista Piranesi\" ; frbr:subject resource:colosseum . resource:colosseum a ontology:Amphitheatre ; dc:date \"70/80\" ; dc:creator \"Vespasianus [Auftrag]\" .","refs":[{"start":273,"end":274,"marker":"figure","target":null},{"start":281,"end":282,"marker":"figure","target":null}]}]},{"title":"Fig. 1. (Continued)","paragraphs":[{"text":"Using FRBR in its true meaning, so as to distinguish the stratification of layers resulted from describing an object (the idea, the content, the format and the specific item), it is also possible to better distinguish between the different levels (the work, the expression, the manifestation and the item).","refs":[]},{"text":"EDM, in fact, defines dc:subject more precisely than Dublin Core itself, explicitly specifying that its value is either a string or a reference (thus allowing references to other CHOs), and even defines a subproperty of dc:subject, called edm:isRepresentationOf, to precisely specify the relationship between representations and represented entities (e.g., a statue and a painting of the statue). Yet, the edm:isRepresentationOf property is currently greyed out (meaning that it \"will not be used in the first implementation so any values provided for them will not be used\"), and the current number of subjects specified as strings will make turning them into references a conspicuous and non-trivial job 16 .","refs":[]}]},{"title":"Roles and Values","paragraphs":[{"text":"Many of DC properties (e.g., dc:creator and dc:contributor) are considered insufficient so often that in most Europeana resources that we have checked many actual values are composed of the indication of a role or other contextual information as well as a name (e.g. of the creator and/or contributor). For example consider:","refs":[]},{"text":"Creator: Morel, Francois (Radierer) 17 Creator: Cartographer : Ryther, Augustus 18 16 …not to mention the fundamental problem that in OWL a property can either be a data property (i.e., allowing strings) or an object property (i.e., allowing references) but not both, so that any OWL ontology based on EDM will have to choose one representation for the values of all the properties, including dc:subject, that allow either strings or references as their values. This, in and by itself, will be a major exercise in reconversion and qualification of existing data sets. 17 http://www.europeana.eu/portal/record/08547/ DC2A5E3DB3A0675D12DA7699647D1D8FA1B9293D.html 18 http://www.europeana.eu/portal/ record/92037/25F9104787668C4B5148BE8E5AB8DBEF5BE5FE03.html Creator: Friedrich, J. C. F. [Production]19 Subject: AUTN=Piranesi Giovanni Battista; AUTA=1720/ 1778 20The universality of this approach is evident, and similarly evident is the need to provide more information than a mere name, although the syntaxes, the metadata models and the provided information differ.","refs":[{"start":797,"end":799,"marker":null,"target":"#foot_9"},{"start":858,"end":860,"marker":null,"target":"#foot_10"}]},{"text":"A better solution could be obtained by promoting strings into first-class objectse.g., converting people names into individuals of the class edm:Agent or foaf:Person21 -and dealing with people names and people's roles separately. There exist two alternative ways to address efficiently and effectively this issue.","refs":[{"start":165,"end":167,"marker":null,"target":"#foot_11"}]},{"text":"On the one hand, we can create explicit sub-properties of properties such as dc:creator or dc:contributor. For instance, by allowing \"cartographer\" to become an explicit sub-property (e.g., property ontology:cartographer) of dc:creator, the identification of name and roles becomes possible and easy, and consequently the queries become more powerful, as shown in the following excerpt related to The Cittie of London 31 by Augustus Ryther:","refs":[]},{"text":"resource:cittie-of-london-31 ontology:cartographer resource:ryther . resource:ryther a foaf:Person ; foaf:givenName \"Augustus\" ; foaf:familyName \"Ryther\" .","refs":[]},{"text":"A problem with this approach is that the TBox of the ontology needs to be modified every time a new role is defined as a new subproperty of dc:creator, which is not a good design principle in general.","refs":[]},{"text":"An alternative is to define people's roles as individuals of a class. In theory, CIDOC CRM already implements this behaviour by using the meta-property P14.1 in the role of [13] (a property of property P14 carried out by) so as to specify the role that an agent has in the context of a particular event (e.g., the creation of an artistic work) through an instance of the class E55 Type. However, the official RDFS ontology of CIDOC CRM22 does not implement any meta-property and in reality RDF lacks the expressive power needed to define meta-properties altogether. To simulate a metaproperty in RDFS/OWL we may define an additional class that associates the person to his/her role. For instance, the Publishing Roles Ontology (PRO) 23 ","refs":[{"start":173,"end":177,"marker":"bibr","target":"#b11"},{"start":435,"end":437,"marker":null,"target":"#foot_12"},{"start":733,"end":735,"marker":null,"target":"#foot_13"}]}]},{"title":"4","paragraphs":[{"text":"Experimenting on \"data.europeana.eu\"","refs":[]},{"text":"The current implementation of the web site http://data.europeana.eu already contains a first selection of the full library of items as RDF statements and they are already queryable via Linked Data aggregators24 . However some limits can be observed in how the site handles non-existing and non-translated resources, which prevents this implementation from being fully compliant with the Linked Data architecture.","refs":[{"start":208,"end":210,"marker":null,"target":"#foot_14"}]},{"text":"According to [15], one of the most important principles of Linked Data is that all the published resources must be defererenceable. Content negotiation is necessary, since information about a resource should be always returned according to the format requested by the user who is navigating the Linked Data, e.g., HTML for humans and Turtle for computer agents. Content negotiation usually has the form of a \"303 redirect\": the client asks for a resource in a specific format, the server answers with a \"303 See Other\" HTTP status code indicating the URL where that requested representation is available to the client, and finally the client gets the content from the specified URL.","refs":[{"start":13,"end":17,"marker":"bibr","target":"#b13"}]},{"text":"Europeana does in fact correctly implement the \"303 redirect\" approach for the resources it makes available in RDF, but does not behave correctly for non-existing or non-available resources. Regardless of whether the resource exists or not, in fact, the server always returns a 303 redirect, and then, after the client restates the query to the new URL, it returns an error if the resource is non-existent. Good Linked Data policy, on the other hand, is that 303 is only returned on existing resources, and an immediate error is returned for non-existing or non-available resources.","refs":[]},{"text":"Two different approaches can be adopted for the return code, depending on which perspective is adopted: in an Open World perspective, we cannot state whether a resource exists, but we can only say whether we have data about it, while in a Closed World perspective, if no data is available about a resource, then the resource itself does not exist.","refs":[]},{"text":"Depending on which of the above views the server adopts, the client should expect a different reply than a \"303 See Other\" when its initial request cannot be satisfied, as shown in table 1 ","refs":[{"start":187,"end":188,"marker":"table","target":"#tab_2"}]}]},{"title":"Conclusion","paragraphs":[{"text":"The final question is: how can we improve user queries? How do we work in the direction of an effective enrichment of metadata, in order to address the information needs of the end users? Europeana currently misleads in the object descriptions mainly because of the imprecise mapping of the original metadata set onto the Europeana specific model. The variety of metadata vocabularies, ontologies and models makes things difficult to manage. Approaches towards a better integration of the different metadata sources that feed Europeana could be helped by existing works on the creation, extension and alignment of OWL ontologies, but much work in the mapping of richer models still needs to be dealt with by hand. The EDM Mapping Guidelines [13] should lead content providers to create descriptions compliant to EDM, at the same time leaving them free to use metadata models and value vocabularies most appropriate to their own internal uses. But although by correctly using the Guidelines many of the existing problems would be solved, some aspects of the EDM could be improved, reflecting on the different levels of description of the objects. Full and correct Linked Data compliancy, furthermore, is the right direction for the future and will help Europeana in giving more complete and structured descriptions. Yet, the techniques have to be refined. We wait for the announced Europeana v2.0 at the end of 201425 .","refs":[{"start":741,"end":745,"marker":"bibr","target":"#b11"},{"start":1414,"end":1416,"marker":null,"target":"#foot_15"}]}]}],"tables":{"tab_2":{"heading":"Table 1 .","description":". HTTP status code for non-existing or non-available resources in Linked Data Other and the indication of a new location that contains empty content in the format requested, e.g. an empty RDF/XML string \"<rdf:RDF />\") There are no information about the resource 404 Not Found The resource does not exist","rows":[["","","","Open World view","Closed World view"],["Resource is not","406 Not Acceptable","406 Not Acceptable"],["available in the","Information about the resource exist but they can-","There are no information"],["requested","for-","not be returned in the requested format","about the resource in the"],["mat","","","","requested format"],["There","is","no","204 No Content (no body specified)"],["resource","","with","or"],["that URI","","","303 See"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"We describe some issues arising while using Europeana, and analyze some features of the Europeana Data Model (EDM), starting from the rationale of the project. Some aspects of the theoretical model, derived mostly from the mapping between the provided Cultural Heritage Object (CHO) and the EDM, prevent useful results in users' queries. The concept of media type, the multilayer description and the relation between roles and values are some issues about which we reflected. The aim of Europeana to make records available as Linked Open Data on the Web could require moreover a redefinition of the implementation techniques.","refs":[]}]}}