{"bibliography":{"title":"Library Data Integration: The CoBiS Linked Open Data Project and Portal","authors":[{"person_name":{"surname":"Schiavone","first_name":"Luisa"},"affiliations":[{"department":null,"institution":"INAF Turin Astrophysical Observatory","laboratory":null}],"email":"luisa.schiavone@inaf.it"},{"person_name":{"surname":"Morando","first_name":"Federico"},"affiliations":[{"department":null,"institution":"Synapta Srl","laboratory":null}],"email":null},{"person_name":{"surname":"Allavena","first_name":"Davide"},"affiliations":[{"department":null,"institution":"Synapta Srl","laboratory":null}],"email":null},{"person_name":{"surname":"Bevilacqua","first_name":"Giorgio"},"affiliations":[{"department":"Department of Humanities","institution":"University of Turin","laboratory":null}],"email":null}],"date":null,"ids":{"DOI":"10.1007/978-3-319-73165-0_2","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"datos.bne.es: A library linked dataset","authors":[{"person_name":{"surname":"Vila-Suero","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Villazón-Terrazas","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Gómez-Pérez","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Semant. Web","series":null,"scope":{"volume":4,"pages":{"from_page":307,"to_page":313}}},"b1":{"title":"Publishing bibliographic records on the web of data: opportunities for the BnF (French National Library)","authors":[{"person_name":{"surname":"Simon","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Wenz","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Michel","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Di Mascio","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-642-38288-8_38","arXiv":null},"target":"https://doi.org/10.1007/978-3-642-38288-8","publisher":"Springer","journal":null,"series":null,"scope":{"volume":7882,"pages":{"from_page":563,"to_page":577}}},"b2":{"title":"Bibliographic framework as a web of data: linked data model and supporting services","authors":[{"person_name":{"surname":"Miller","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"Library of Congress","journal":null,"series":null,"scope":null},"b3":{"title":"RML: A generic language for integrated RDF mappings of heterogeneous data","authors":[{"person_name":{"surname":"Dimou","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Sande","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Colpaert","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Verborgh","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Mannens","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Van De Walle","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":"https://www.w3.org/DesignIssues/LinkedData.html","publisher":"LinkedData","journal":null,"series":null,"scope":{"volume":5,"pages":null}},"b4":{"title":"Linked data -the story so far","authors":[{"person_name":{"surname":"Bizer","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Heath","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Berners-Lee","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IJSWIS","series":null,"scope":{"volume":5,"pages":{"from_page":1,"to_page":22}}},"b5":{"title":"Linked data per biblioteche, archivi e musei","authors":[{"person_name":{"surname":"Guerrini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Possemato","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"Editrice Bibliografica","journal":null,"series":null,"scope":null},"b6":{"title":"Wikidata: la soluzione wikimediana ai linked open data","authors":[{"person_name":{"surname":"Martinelli","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"AIB Studi","series":null,"scope":{"volume":56,"pages":{"from_page":75,"to_page":85}}},"b7":{"title":"RDA e la sfida del web semantico","authors":[{"person_name":{"surname":"Bianchini","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"EUT Edizioni Università di Trieste","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":197,"to_page":206}}},"b8":{"title":"La filosofia open: paradigma del servizio contemporaneo","authors":[{"person_name":{"surname":"Guerrini","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Biblioteche oggi","series":null,"scope":{"volume":35,"pages":{"from_page":12,"to_page":21}}},"b9":{"title":"Future of Bibliographic Control: On the Record: Report of the Library of Congress Working Group on the Future of Bibliographic Control","authors":[],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"Library of Congress","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The CoBiS (Coordinamento delle Biblioteche Speciali e Specialistiche di Torino i.e. Coordination of Special and Specialized Libraries of Turin) is an informal network of 65 libraries, collaborating to provide continuing professional development and to offer a better service to their users. CoBiS libraries are heterogeneous from many points of view: holdings, cataloguing software and OPACs. The LOD project started in 2015 as a training program, in collaboration with Prof. Vivarelli from the University of Turin. The program was divided in various topics: copyright, collaboration between libraries and Wikipedia, (Linked) Open Data.","refs":[]}]},{"title":"Purpose","paragraphs":[{"text":"Six libraries from the CoBiS decided to participate in a pilot project with the purpose of providing a unique access point to the collections of CoBiS libraries. CoBiS bibliographic data were divergent from different perspectives: file formats, semantic frameworks and authority files. Linked Open Data technologies provide the means to engage such interoperability problems, both from a technical and a semantic point of view. Many national libraries (e.g. BNE [1] and BNF [2]) have converted their catalogues from MARC to RDF and have published their data also through a SPARQL endpoint.","refs":[{"start":462,"end":465,"marker":"bibr","target":"#b0"},{"start":474,"end":477,"marker":"bibr","target":"#b1"}]},{"text":"In Italy, the SHARE Catalogue project 1 has converted MARC records from multiple university libraries in RDF; however, no SPARQL endpoint is available to query the database.","refs":[]},{"text":"By developing and implementing effective tools and procedures, we were able to convert CoBiS datasets, composed of different data formats, into RDF, to interlink them with external authoritative sources (Wikidata, VIAF and Inter-netArchive) and to publish them as Linked Data, giving also access to the enriched dataset via a SPARQL endpoint.","refs":[]},{"text":"This work led CoBiS datasets to become a connecting piece in the Linked Open Data Cloud; as a result, data are not only becoming more interoperable among them, but they are also open in order to facilitate the collaboration with online communities.","refs":[]}]},{"title":"The Project","paragraphs":[{"text":"With respect to the Linked Open Data stack, Fig. 1 shows an overall picture of the project. The first activity of the project consisted in transforming bibliographic data into RDF triples.","refs":[{"start":49,"end":50,"marker":"figure","target":"#fig_0"}]},{"text":"Created using various cataloguing softwares, CoBiS data are encoded in different file formats (CSV, XML and JSON) and are structured according to different data models (MARC 21, UNIMARC, Dublin Core OAI-PMH).","refs":[]},{"text":"In order to define a unique data model we used two main ontologies: Schema.org and Bibframe, the latter being developed by the Library of Congress with the specific aim to facilitate the necessary transition from the traditional catalographic system (based on MARC) to a bibliographic environment integrated in the web of data [3]. We also used selected properties from RDFS, OWL, DCTerms, FOAF, and Culturalis2 , with the purpose of providing more semantic interoperability.","refs":[{"start":327,"end":330,"marker":"bibr","target":null},{"start":410,"end":411,"marker":null,"target":"#foot_0"}]},{"text":"During the first phase of the project, we tried to convert data in RDF triples using the Library of Congress tool marc2bibframe3 to process MARC 21 and using the RML mapping language for all the other formats.","refs":[{"start":127,"end":128,"marker":null,"target":"#foot_1"}]},{"text":"RML is a generic mapping language defined to express customized mapping rules from heterogeneous data structures and serializations to the rdf data model [4]. The RML conceptual model, based on R2RML W3C standard 4 , perfectly fitted with the needs of the project, but had some limitations with respect to technical performances, i.e. processing time, and the verbosity of the mapping language.","refs":[{"start":154,"end":157,"marker":"bibr","target":"#b3"},{"start":213,"end":214,"marker":null,"target":"#foot_2"}]},{"text":"When tabular data were available, we experimented the TARQL tool, described by its developers as SPARQL for Tables: a command-line tool for converting CSV files to RDF using SPARQL 1.1 syntax5 . TARQL proved to be both technically efficient and not very time-consuming in terms of writing new mappings, thanks to the use of the standard SPARQL 1.1 syntax, with all its features.","refs":[{"start":191,"end":192,"marker":null,"target":"#foot_3"}]},{"text":"Since many of our input data had a tree-like structure (XML or JSON format) Synapta, in a joined effort with other open source developers from FactsMission6 , realized and published JARQL, a new open source software tool for converting JSON data to RDF. As TARQL, from which it takes inspiration, JARQL uses the SPARQL 1.1 syntax and constructs queries to describe its mappings 7 .","refs":[{"start":155,"end":156,"marker":null,"target":"#foot_4"},{"start":378,"end":379,"marker":null,"target":"#foot_5"}]},{"text":"By improving those technical tools, we were able to define a triplification pipeline where data are extracted from local sources, mapped (using a SPARQL query) to selected ontologies, and converted into an RDF graph, which is periodically updated. A sample JSON input and the related SPARQL mapping is shown in Fig. 2. According to the W3C recommendations [5], CoBiS entities (books and authors) are unambiguously identified by URIs, so that they can be connected to external sources.","refs":[{"start":316,"end":317,"marker":"figure","target":"#fig_1"}]},{"text":"CoBiS libraries were using different authority files (e.g. SBN or local systems), but the graph structure of RDF supported the generation of a unified Authority file. Interlinks to external sources, like VIAF and Wikidata, helped us to identify and de-duplicate authors under a shared procedure.","refs":[]},{"text":"For link generation [6] we used both automatic algorithms and manual approaches. In order to minimize false positives, automatic matches proceeded mostly through SBN identifiers: in this way, the newly created graph was interlinked with VIAF and Wikidata.","refs":[{"start":20,"end":23,"marker":"bibr","target":"#b4"}]},{"text":"Due to the size of the VIAF database and to the absence of a public SPARQL end-point, we had to recreate locally a Linked Data graph from the VIAF RDF dump.","refs":[]},{"text":"In order to support manual matches, we exploited OLAF (Open Linked Authority File) 8 , our crowd-sourcing interface for creating an authority file based on SPARQL queries.","refs":[{"start":83,"end":84,"marker":null,"target":"#foot_6"}]},{"text":"By analyzing different RDF-structured databases, OLAF suggests potential relations of identity between similar entities (see Fig. 3).","refs":[{"start":130,"end":131,"marker":"figure","target":null}]},{"text":"Candidate matches are submitted to domain-experts and, if validated, they are annotated in the CoBiS RDF graph, using the owl:sameAs property. The interaction between automatic computation and manual validation improves the quality and the reliability [7] of the data, by allowing domain-experts to directly contribute to the Linked Open Data Cloud.","refs":[{"start":252,"end":255,"marker":"bibr","target":"#b5"}]}]},{"title":"Fig. 3. The Galilei search in OLAF","paragraphs":[{"text":"Within the overall interlinking process, Wikidata is assuming the role of metadata hub: because of its constant growing and the dynamism of the wiki approach [8], its entities are strongly interlinked with VIAF and other databases (e.g. national bibliographic and biographic dictionaries, disciplinary databases, etc.).","refs":[{"start":158,"end":161,"marker":"bibr","target":"#b6"}]},{"text":"On a scenario where the cataloging process is evolving into aggregating shared and interlinked data [9], librarians (especially those of small institutions not contributing to VIAF) are encouraged to use Wikidata as authority file [10], both by connecting existing data and creating new items about authors not yet included in Wikidata (using its publicly editable graphic interface). In those cases, such a practice would minimize redundancy and the overall cost of authority record creation, thus increasing the efficiency of bibliographic record production and maintenance [11].","refs":[{"start":100,"end":103,"marker":"bibr","target":"#b7"},{"start":231,"end":235,"marker":"bibr","target":"#b8"},{"start":576,"end":580,"marker":"bibr","target":"#b9"}]}]},{"title":"The Portal","paragraphs":[{"text":"The CoBiS LOD Project portal (http://dati.cobis.to.it) is online with its full Linked Data stack, including a public SPARQL end-point configured to support federated queries (http://dati.cobis.to.it/sparql) a full dump of the RDF data, etc.","refs":[]},{"text":"In the author's page, dynamically generated through SPARQL queries, you have biographical information and a list of interlinked resources coming from Wikidata and other bibliographic repositories (VIAF, Wikidata, LoC, Deutsche National Bibliothek GND, Bibliothèque Nationale de France BNF, Servizio Bibliotecario Nazionale SBN, Dizionario Biografico degli Italiani DBI). On the right there is an infobox with authors data and an image, both fetched live from Wikidata leveraging Linked Data. Clicking on the RDF button, all the triples of the resource can be directly viewed.","refs":[]},{"text":"At the bottom of the page, all the author's books inside the CoBiS database are shown (see Fig. 4). To explore information on such books, you can click one of the boxes or you can use the search bar, looking for a title which is not listed 9 . Figure 5 shows an example search for the Dialogo. On the left side of the page, you see bibliographic details with a collection of interlinked resources. Exploiting the power of Open Data, we are also able to read the Internet Archive digital copy of the book (Fig. 6). A physical copy of the book is available in some CoBiS libraries. All details coming from the individual OPACs can be shown by clicking the OPAC button (Fig. 5).","refs":[{"start":96,"end":97,"marker":"figure","target":"#fig_2"},{"start":240,"end":241,"marker":null,"target":"#foot_7"},{"start":251,"end":252,"marker":"figure","target":null},{"start":510,"end":511,"marker":"figure","target":null},{"start":672,"end":673,"marker":"figure","target":null}]}]},{"title":"Towards New Challenges","paragraphs":[{"text":"The pilot is only an initial step.","refs":[]},{"text":"CoBiS plan to include more libraries in a second phase of the project, converting their data into Linked Open Data and linking them to the Linked Open Data Cloud and to other online resources, such as Internet Archive and Wikipedia.","refs":[]},{"text":"Thanks to linked data, it is possible to query for common items in the CoBiS catalogue and in other major National Libraries catalogues exposing a SPARQL endpoint.","refs":[]},{"text":"Performing the query in Fig. 7 on the CoBiS SPARQL endpoint10 towards the French National Library SPARQL endpoint11 returns a subset of shared books. ","refs":[{"start":29,"end":30,"marker":"figure","target":"#fig_4"},{"start":59,"end":61,"marker":null,"target":"#foot_8"},{"start":113,"end":115,"marker":null,"target":"#foot_9"}]}]},{"title":"Acknowledgements","paragraphs":[{"text":"This pilot project would not have taken place without the aid of the following organizations, that we want to thank:","refs":[]},{"text":"-Regione Piemonte for having believed in the project and for the contribution ","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The CoBiS is a network formed by 65 libraries. The project is a pilot for Piedmont aiming to provide the libraries with an infrastructure for LOD publishing, creating a triplification pipeline designed to be easy to automate and replicate. This was realized with open source technologies, such as the TARQL and JARQL tools that use SPARQL queries to describe the conversion of tables (CSV) or trees (JSON) into graphs (RDF data). The first challenge consisted in making possible the dialog of heterogeneous data sources, coming from four different library applications and different types of data. As a second step, the information contained in the catalogs was interlinked with external data sources.","refs":[]}]}}