{"bibliography":{"title":"Europeana: Towards The European Digital Library","authors":[{"person_name":{"surname":"Aloia","first_name":"Nicola"},"affiliations":[],"email":"nicola.aloia@isti.cnr.it"},{"person_name":{"surname":"Concordia","first_name":"Cesare"},"affiliations":[],"email":"cesare.concordia@isti.cnr.it"},{"person_name":{"surname":"Meghini","first_name":"Carlo"},"affiliations":[],"email":"carlo.meghini@isti.cnr.it"}],"date":{"year":"2009","month":"03","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"Setting the Foundations of Digital Libraries. The DELOS Manifesto","authors":[{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2007","month":"04","day":null},"ids":null,"target":null,"publisher":null,"journal":"D-Lib Magazine","series":null,"scope":{"volume":13,"pages":null}}},"sections":[{"title":"1","paragraphs":[{"text":"Europeana: the inception","refs":[]},{"text":"In October 2004 Google launched Book Search a tool that searches the full text of books. The service was formerly known as Google Print when it was introduced at the Frankfurt Book Fair. In reaction to that, in 2005 Jacques Chirac called for a European Digital Library in order to affirm the \"cultural identity\" of Europe and to spread its heritage.","refs":[]},{"text":"In ","refs":[]}]},{"title":"Building Europeana: the projects cluster","paragraphs":[{"text":"The Europeana Digital Library will be the result of a number of projects run by different cultural heritage institutions; amongst these projects, we have:","refs":[]},{"text":" Athena, an aggregator that helps museums bringing their content to Europeana.  APENet, a Best Practice Network whose objective is to build an Internet Gateway for Documents and Archives in Europe.  EuropeanaLocal, aiming at improving the interoperability of the digital content held by regional and local institutions.  European Film Gateway, whose goal is to find solutions for providing integrated access to the Europe's cinematographic heritage.  Judeica, whose aim is to establish a comprehensive map of European Jewish Cultural Heritage.  EuropeanaConnect, that will provide the technologies and resources to semantically enrich the digital content in Europeana.  Europeana V1.0 that will implement the technological platform.","refs":[]},{"text":"All projects are part-funded by the European Commission\"s eContentplus program. The full implementation of the Europeana Digital Library System is the goal of the two \"core\" projects: EuropeanaConnect and Europeana V1.0. The complete list of the projects contributing to Europeana is at the URL: http://group.europeana.eu/.","refs":[]}]},{"title":"Building Europeana: the EDLNet","paragraphs":[{"text":"The EDLnet Thematic Network is an eContentPlus program recently concluded, that has prepared the ground for the European Digital Library. The project main topic was to improve the cross-domain accessibility to cultural content, a pillar of the European Commission\"s i2010 Digital Libraries initiative. EDLnet Thematic Network has brought on board the key European stakeholders to build consensus on creating the European Digital Library. EDLnet project main results are:","refs":[]},{"text":" The creation of a large visible community of archivists, librarians and museum people committed to making content available in an interoperable way.  The production of clear and usable summary reports and recommendations on each of the main areas of interoperability addressed in the EDLnet.  The definition of a roadmap showing how the component parts interlink and what needs to be achieved when to realise the aim of the European Digital Library.  The implementation of a fully working prototype, with interoperable multilingual access, covering over 4,5 million digital items.  The definition of a proposal for funding to create a fully operational European Digital Library service.","refs":[]},{"text":"As of April 09 the Europeana prototype (www.europeana.eu) contains data from 54 cultural institutions from 24 countries.","refs":[]}]},{"title":"The System View","paragraphs":[{"text":"In the wide public, Europeana is primarily perceived as a Portal exposing a great amount of cultural heritage information. Even though this perception is not entirely misleading, one of the goals of Europeana is to build an open services platform enabling users and cultural institutions to create and access a large collection of objects representing digital and digitised content via an Application Program Interface (API). Europeana API will enable cultural institutions and users to:","refs":[]},{"text":" Access Europeana content  Provide content to Europeana  Build applications using Europeana functionalities for their own use.  Use Europeana services for their own Digital libraries From this more general point of view, the Europeana Portal is just a component of the system, more specifically it can be viewed as a web application using the Europeana API to offer services, in particular discovery-based access to, the Europeana Digital Library. ","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper briefly describes the process that will lead to Europeana, the European Digital Library. This process is currently running, so that it is possible to give only an account of its inception, involved actors and projects, and current status. The paper concludes by quickly outlining the role that CNR has in the making of Europeana.","refs":[]}]}}