{"bibliography":{"title":"Establishing a Digital Library in Wide-Ranging University's Context The Sapienza Digital Library Experience","authors":[{"person_name":{"surname":"Iorio","first_name":"Angela"},"affiliations":[{"department":null,"institution":"Sapienza Università di Roma","laboratory":null}],"email":"angela.diiorio@uniroma1.it"},{"person_name":{"surname":"Schaerf","first_name":"Marco"},"affiliations":[{"department":null,"institution":"Sapienza Università di Roma","laboratory":null}],"email":"marco.schaerf@uniroma1.it"},{"person_name":{"surname":"Bertazzo","first_name":"Matteo"},"affiliations":[{"department":null,"institution":"CINECA","laboratory":null}],"email":"m.bertazzo@cineca.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Long term digital preservation","Mods","Controlled vocabularies","Digital library","Oais","Mets","Digital curation","Premis"],"citations":{"b0":{"title":"Consultative Committee for Space Data Systems Reference Model for an Open Archival Information System (OAIS), Blue Book","authors":[],"date":{"year":"2002","month":"01","day":null},"ids":null,"target":"http://public.ccsds.org/publications/archive/650x0b1.pdf","publisher":null,"journal":null,"series":null,"scope":{"volume":1,"pages":null}},"b1":{"title":"The DELOS Digital Library Reference Model -Foundations for Digital Libraries, Version 0.98","authors":[{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Ioannidis","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Koutrika","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Meghini","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Ross","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Soergel","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Dobreva","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Katifori","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Schuldt","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2008","month":"02","day":null},"ids":null,"target":"http://www.delos.info/files/pdf/ReferenceModel/DELOS_DLReferenceModel_0.98.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Fedora 3.5 Documentation, Content Model Architecture","authors":[],"date":null,"ids":null,"target":"https://wiki.duraspace.org/display/FEDORA35/Content+Model+Architecture","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Metadata Encoding & Transmission Standard (METS","authors":[],"date":null,"ids":null,"target":"http://www.loc.gov/standards/mets/5","publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Metadata Object Description Schema (MODS","authors":[],"date":null,"ids":null,"target":"http://www.loc.gov/standards/mods/","publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"PREservation Metadata Implementation Strategies (PREMIS)","authors":[],"date":null,"ids":null,"target":"http://www.loc.gov/standards/premis/","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Digital Library Federation/Aquifer Implementation Guidelines for Shareable MODS Records","authors":[],"date":null,"ids":null,"target":"https://wiki.dlib.indiana.edu/confluence/download/attachments/24288/DLFMODS_ImplementationGuidelines.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"Metadata for Digital Content Developing institution-wide policies and standards at the Library of Congress","authors":[],"date":null,"ids":null,"target":"http://www.loc.gov/standards/mdc/elements/","publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"PREMIS Data Dictionary for Preservation Metadata version 2","authors":[],"date":{"year":"2008","month":"03","day":null},"ids":null,"target":"http://www.loc.gov/standards/premis/v2/premis-2-0.pdf","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The Sapienza Digital Library1 (SDL) is a research project undertaken by Sapienza Università di Roma (Sapienza), the largest Europe's campus, and the Italian supercomputer center Cineca, which is a non profit consortium made up of 47 Italian universities.","refs":[{"start":28,"end":29,"marker":null,"target":"#foot_0"}]},{"text":"The SDL project aims to build an infrastructure supporting preservation, management and dissemination of the past, present and future digital resources, containing the overall intellectual production of the Sapienza University.","refs":[]},{"text":"Setting the future scenario of the SDL application, it has been evaluated and prefigured the large amount of research and knowledge materials, coming from such large and ancient University, as well as the variety of interests coming from such large and multidisciplinary community of stakeholders, and, last but not least, the potential uses of that material, for general and specialized communities of users.","refs":[]},{"text":"The project was indeed conceived to manage the integration of a large volume of multiformat materials, and to enable their access through different devices, in order to fulfill the needs and the expectations of diverse communities, local, global, and future.","refs":[]},{"text":"The actual state of experiences in digital libraries, in digital resources management, in digitization and in evolution of dissemination tools have suggested to examine new cost-effective solutions in the weaving factory of submission, archiving, and dissemination of digital resources. The solution adopted tries to find a tradeoff between the standardization of the digital processes and products, that allows a cost-effective centralized management, and the preservation of the peculiarities of scientific materials that need to be digitally available for future and specific initiatives.","refs":[]}]},{"title":"Mission","paragraphs":[{"text":"The primary objective of the project is to provide Sapienza University with a modern digital library, comprehensive and open, which contains all digital materials produced by, held by, with ownership of, or granted to Sapienza. The materials will be organized, catalogued, enriched and made accessible to the whole academic community and over.","refs":[]}]},{"title":"Project's Objectives","paragraphs":[{"text":"The initial objectives that was detected are those essentially appliable to any kind of university or educational institution, and extending the vision, also to any institution that needs to manage digital material. The objectives were firstly defined from the users point of view:","refs":[]},{"text":"• Offering to the Sapienza's designated communities the opportunity to exploit digital materials owned and/or produced by Sapienza; • Managing a broad variety of digital materials, born-digital and digitized; • Archiving and preserving collections of images, audio/videos, 3D materials, scientific articles and datasets, special and valuable collections (private archives of scientists, work archives, etc.), museums/archives/libraries materials, scientific learning and teaching materials; • Organizing, grouping, and indexing materials, supporting their browsing and searching on different dimensional views, and their reuse in different contexts; • Optimizing, improving, and enhancing the value of digital materials throughout the web semantic technologies and social tools;","refs":[]},{"text":"• Building a framework in the forefront, for the submission, dissemination, and preservation of Sapienza's digital assets, interconnected with the most important Italian, European, and International digital resources aggregators;","refs":[]},{"text":"• Allowing the interoperable conversation with other kinds of information management systems (libraries/archives/musems/universities, open access repositories…).","refs":[]},{"text":"More technical objectives connected to the more stringent organizational and technical requirements in harmonization with the global digital libraries, and the digital curation scenario, were defined as the following:","refs":[]},{"text":"• Managing digital materials coming from former digitization projects, making retrospective conversions of existing materials; • Gathering as much as possible information, lowering the threshold of information lost;","refs":[]},{"text":"• Achieving a satisfying level of information not only for user needs, but also for enabling advanced services for preservation and dissemination;","refs":[]},{"text":"• Enriching the information making it reusable and connectable with other application contexts,","refs":[]},{"text":"• Adhering to the Open Archival Information System (OAIS) [1]  Collecting and managing the intellectual materials that was, is, and will be produced by that large organizational scenario, needs of a common, and a costeffective solution, which leveraging on standardized digital resources, will allow their management and exploitation in the long term.","refs":[{"start":58,"end":61,"marker":"bibr","target":"#b0"}]},{"text":"By the digital management point of view, the application context is extremely fragmented, because of the multiplicity of information sources that had produced digital resources in a local view and with personalized methodologies. Actually, scientists are simply more focused on their studies, researches and interests, than on the digital management of their information resources. For this reason, finding a common way to organize, manage, and exploit the content of digital materials, is essential to provide useful tools that support and ease the intellectual work, and lower the weight of the daunting task of managing digital resources.","refs":[]}]},{"title":"Digital Materials Used","paragraphs":[{"text":"At the beginning of the project was necessary to prepare an initial census of the existing digital materials that were representative of specific type of objects like for example videos, images, digitized books, text documents, big images like historical maps. All the materials were gathered and stored into a dark repository of the Sapienza computing center. The materials were used as samples for the workflow of digital resources building that has led to the creation of the Submission Information Package (SIP) as required by the OAIS model [1]. Different types of SIPs were modelled on resources' types (i.e. image, video, map) and system's services were coherently modelled for ingesting, managing, and accessing the content. For example, even though maps and a photographs are both images, the fruition service provided by the system is different in regard to the image's dimension.","refs":[{"start":546,"end":549,"marker":"bibr","target":"#b0"}]},{"text":"In general, the materials that, the SDL will be able to manage, are:","refs":[]},{"text":"• Books, ancient (before 1831) and modern, prints, maps and other digitized materials;","refs":[]},{"text":"• Scientific digital products (Ph.D. thesis, materials with rights, datasets…);","refs":[]},{"text":"• Images, Audio/Video materials digitized and born-digital;","refs":[]},{"text":"• Learning objects • User Generated Contents • Special materials: i.e. archaeological documentations, personal archives… • 3D objects","refs":[]}]},{"title":"SDL Reference Models and the Preservation Strategy","paragraphs":[{"text":"The reference models that lay down the digital library design and conception are the Open Archival Information System (OAIS) [1] and the DELOS digital library Reference Model (DELOS) [2]. Specifically, the DELOS Three-tier framework composed by Digital Library(DL), Digital Library System(DLS), and the Digital Library Management System(DLMS) were envisaged in the Sapienza context.","refs":[{"start":125,"end":128,"marker":"bibr","target":"#b0"},{"start":183,"end":186,"marker":"bibr","target":"#b1"}]},{"text":"In conformance with DELOS model, the Sapienza DL is a set of \"real\" persons and organizational units that \"collects, manages and preserves for the long term rich digital content, and offers to its user communities specialised functionality on that content, of measurable quality and according to codified policies\".","refs":[]},{"text":"The Sapienza DLS is a distributed architecture tailored on and used by the different communities and provides specific software tools.","refs":[]},{"text":"The Sapienza DLMS is the software infrastructure which was conceived following the philosophy of the \"extensibility\", in order to implement tailored services in harmonization of the integration of new content types (i.e. specific visualization tool for big images) as well as the introduction of new requirements for the system (i.e. application of new information classification system).","refs":[]},{"text":"A supposed DLMS is usually founded on the OAIS conceptual model, and usually its archiving repository provides the basic functions like ingestion, archival storage, data management, administration, preservation planning, access. Actually, very few DLMS are equipped with a complete and overall preservation planning, likewise coherently, the relevant administration. Indeed, the LTDP needs more integration between the technological support and the digital preservation organizational need, which is especially expressed throughout the organizational commitment, as evidence of the sufficient level of awareness about the LTDP.","refs":[]}]},{"title":"Activities Project's Overview","paragraphs":[{"text":"The project has started in January 2011 and it was divided into two work phases. The objective of the first phase, was to release a DLMS prototype implementing all the macrofunctionalities defined by the OAIS: ingesting, archiving and access. To release the DLMS prototype, it was necessary to design the pre-ingestion activities for the SIP building, and contemporaneously, it was defined and progressively improved the metadata framework, useful to support the information management. Consequently, the outcome of the first phase was prototyping, the SDL metadata framework (7.3), the Sapienza pre-ingestion workflow (7.4), the Sapienza SIP building (7.5), the SDL DLMS (7.6).","refs":[{"start":672,"end":677,"marker":"bibr","target":null}]},{"text":"The first phase of the project has been closed in December 2011.","refs":[]},{"text":"The second phase started in January 2012 and the objectives are: 1) developing DLSs for making communities to interoperate with SDL, 2) enriching the prototyped elements, released during the first phase, by adding metadata enabling the digital preservation strategies implementation, 3) optimizing the overall DLMS functionalities.","refs":[]},{"text":"The following describes the activities performed for the first phase of the project.","refs":[]}]},{"title":"System's Requirements Analysis and Matching of Digital Materials Characteristics","paragraphs":[{"text":"The census of available digital resources has resulted in a first categorization of materials types, and in a list of characteristics, that need to be managed by the system's services in supporting the main OAIS functionalities like ingest, archiving and access. The characteristics of materials were modelled taking into account the user needs, and consequently the differentiated access types, the variety of searching/browsing, the preservation needs and the draft of the rights management with the corpus of permissions, statements and other generic constraints.","refs":[]},{"text":"From that initial analysis was designed a workflow of the materials processing, in order to prepare them for the submission to the SDL digital repository. The processing objective is the creation of a SIP, which in real implementations is a compound object made of content objects and metadata objects.","refs":[]}]},{"title":"Selection of the Digital Repository Application System","paragraphs":[{"text":"The choice of the digital repository management system is a strategic and constraining decision for the digital curation of the materials. Consequently, an initial evaluation of the most spread open source software projects was done, and the Fedora Commons (FC) [3] has been chosen because, in spite of its complexity is more oriented to the web services integration, the semantic web technologies, and the LTDP. Furthermore, FC gives chances to use content models, that can be customized in regard to the originating models of the SDL materials.","refs":[{"start":262,"end":265,"marker":"bibr","target":"#b2"}]},{"text":"As usual in implementing FC, an analysis of the pros and cons about the atomistic and compound paradigm was done, in relation to the projects requirements. The choice was led on the atomistic model, mainly considering the long term perspective of the project, which foresees to use and reuse the digital materials in diverse contexts. The greater flexibility, in reusing digital objects, was considered a good reward respect to the major complexity in managing the atomistic model, due to the system maintenance of information about relationships among objects.","refs":[]}]},{"title":"Definition and Design of the SDL Metadata Framework","paragraphs":[{"text":"The metadata framework conceived for SDL had taken into account the wide-ranging general requirements that set three specific characteristics: completeness (gathering as much as possible information), flexibility (adapting to different contexts) and extensibility (integrating with new information). Consequently, the framework has to be able to hold any kind of resources' description. The holding of information does not mean that the managing system has necessarily to manage it, but holding information and maintaining it available, would allow its reuse in future focused projects.","refs":[]},{"text":"The metadata framework has to support the following requirements:","refs":[]},{"text":"• conformant with OAIS;","refs":[]},{"text":"• prearranged to hold different standard descriptions on which implementing integration services, supporting the use of wide-ranging knowledge's materials; • prearranged to the exchange with other digital library systems or other information management systems;","refs":[]},{"text":"• prearranged to the LTDP and equipped with the minimal and essential metadata, enabling the long term management.","refs":[]},{"text":"The metadata is generally categorized in descriptive, administrative, structural rights management, preservation 2 , and technical and use 3 , even though same metadata can be assigned to different categories, in regard to the use perspectives. The actual scenario, in DL implementations, highlights the broad adoption of metadata standards, coming from metadata specialists international workgroups, supported by the Library of Congress. The most adopted combination is METS [4]/MODS[5]/PREMIS [6],","refs":[{"start":113,"end":114,"marker":null,"target":"#foot_2"},{"start":139,"end":140,"marker":null,"target":"#foot_3"},{"start":476,"end":479,"marker":"bibr","target":"#b3"},{"start":495,"end":498,"marker":"bibr","target":"#b5"}]},{"text":"where PREservation Metadata Implementation Strategies (PREMIS), is used for preservation metadata, Metadata Object Description Schema (MODS) for descriptive metadata and Metadata Encoding & Transmission Standard (METS) for wrapping metadata all together. Usually the metadata standards are available to the communities by means of XML schemas 4 that enable the information systems to interchange, set of information encoded in XML files.","refs":[{"start":343,"end":344,"marker":null,"target":"#foot_4"}]},{"text":"The SDL has adopted primarily LOC standards because of the wide-adoption in DL projects and, the more the standards are spread and the more the adopting systems are interoperable. In addition, because they are open standards it follows that the longevity of their knowledge-base is likely longer.","refs":[]}]},{"title":"Descriptive Metadata Set","paragraphs":[{"text":"The SDL metadata framework was designed to support as much as possible information, even coming from different kinds of knowledge provider. The MODS metadata is the \"core description\" on which are configured the DLMS's services for searching and browsing of the SDL collections. A stable MODS profile will be released during the second phase of the project, and it will be the reference descriptive framework for describing new digital materials. All the varied information sets, collected from the different Sapienza organizational units are mapped and encoded in MODS, and enriched by controlled values taken from the MODS controlled vocabularies as well as, the SDL controlled vocabularies.","refs":[]},{"text":"The translation of different information sources into the MODS has respected and followed the Digital Library Federation/Aquifer Implementation Guidelines for Shareable MODS records [7]. The elements required by the DLF/Aquifer requirement level, has been adopted as one of the SDL policies for the basic requirement level in resource's description. Furthermore, for special collections it has been taking into account the Master Data Element List of Library of Congress Metadata for Digital Content [8].","refs":[{"start":182,"end":185,"marker":"bibr","target":"#b6"},{"start":500,"end":503,"marker":"bibr","target":"#b7"}]},{"text":"The MODS has been used for describing materials, not only at the single item level, but also at the collection level. Every item or resource (here meant as a discrete unit, conceptually equivalent to the OAIS Information Package (IP), in this article specifically qualified as SIP in 7.1), existing in SDL, must belong to an identifiable collection, that indeed is described by MODS elements.","refs":[]},{"text":"The MODS was considered more suitable for the SDL metadata framework, because is richer than the easiest implementable Dublin Core, it being understood that the DL system can dumb down from MODS, to Dublin Core5 , and similar in simplicity, as well as to map toward open data standards 6 .","refs":[{"start":210,"end":211,"marker":null,"target":"#foot_5"},{"start":286,"end":287,"marker":null,"target":"#foot_6"}]},{"text":"Mostly, all advantages and features, listed on MODS official website, were considered important in implementing it, but one of them deserves to be cited: MODS can be used also for Search/Retrieval via URL(SRU) 7 as specified format, enabling federated searching and similar automated queries via URL, which means to offer further advanced services to the users.","refs":[{"start":210,"end":211,"marker":null,"target":"#foot_7"}]}]},{"title":"Metadata Container and Structural Metadata","paragraphs":[{"text":"For packaging all metadata together into the defined SIP, the SDL metadata framework deviced, has exploited the flexibility of METS, making the system available 1) to collect other kinds of metadata set, over those specifically adopted, and 2) to dumbing down toward standards less complex like Dublin Core or European Semantic Elements 8 .","refs":[{"start":337,"end":338,"marker":null,"target":"#foot_8"}]},{"text":"Whenever is necessary to collect resources' descriptions more detailed than MODS, these descriptions are stored \"as is\" and summarized, according to the SDL MODS profile, into the SDL MODS core description.","refs":[]},{"text":"Thanks to the METS flexibility, during the development of the per-ingestion activities and the improvement of the metadata framework design, other metadata standards have been embedded, like for example technical standards specific for different kinds of materials (MIX9 , VideoMD10 ).","refs":[{"start":269,"end":270,"marker":null,"target":"#foot_9"},{"start":280,"end":282,"marker":null,"target":"#foot_10"}]},{"text":"A stable METS profile will be released during the second phase of the project.","refs":[]}]},{"title":"Preservation Metadata","paragraphs":[{"text":"The overall SDL SIP building workflow was pervaded by the LTDP philosophy, ensuring the basic provision of the preservation metadata, considered mandatory by the PREMIS, that is the preservation metadata framework mapped from the conceptual structure of the OAIS model. The SDL metadata framework was designed to guarantee the minimum conformance with the PREMIS standard both on semantic unit and data dictionary level, following requirements and constraints, and by collecting all the metadata defined as mandatory by the PREMIS Data Dictionary [9]. Although PREMIS is not formally and completely adopted yet, all the mandatory information were encapsulated into the metadata framework, and all the other useful information were stored by the SDL black repository system and will be encapsulated during the project's second phase. This means that the SDL resources are already equipped for the management of the LTDP strategies, even though the DL prototype is not managing them yet. The preservation planning and administration will be implemented in the second phase of the project.","refs":[{"start":547,"end":550,"marker":"bibr","target":"#b8"}]}]},{"title":"Pre-ingestion Workflow","paragraphs":[{"text":"Considering the extension of the University, in numerical as well as in geographical terms, the workflow was designed following a distributed view of the work, even though in order to design the workflow, at the beginning a centralized system of the materials' treatment is necessary. The workflow will be applied and distributed in the different institutional units belonging to Sapienza at the first stable system release.","refs":[]},{"text":"The materials gathered into the SDL dark repository were of different varieties, in terms of contents and metadata structure. The first step was to maintain the provenance source of materials identifying firstly the real Sapienza Organizational Unit, that asked to submit materials to the system, and secondly, identifying the collections and items contained.","refs":[]},{"text":"At the beginning, the workflow was designed and tested on a sample collection of almost 2000 images, and progressive tests of SIP building processes(7.5) had fixed and integrated both metadata framework(7.3), pre-ingestion workflow activities and the SIP building processes. The pre-ingestion workflow consists of all those activities necessary to prepare digital objects and metadata for the automatic building of the SIP, in conformance with the SDL metadata framework defined. In practice it organizes, structures and enriches the flow of digital materials from Sapienza organization units toward the Sapienza SIP building DLS.","refs":[]},{"text":"The design and development of the workflow has essentially consisted of the following activities:","refs":[]},{"text":"• Detection of available digital materials; • Analysis, normalization and enrichment of both metadata and digital objects; • Modelling of resources and resources' collections information for the submission objective;","refs":[]},{"text":"• Modelling of provenance information being collecting in pre-ingestion activities;","refs":[]},{"text":"• Designing and development of a local database as \"metadata nursery\" for the production of the final SIP's version.","refs":[]}]},{"title":"Selection of Representative Samples and SIP Building","paragraphs":[{"text":"From the analysis of the existing materials were identified the representative samples of diverse types of materials(collections, videos, images, maps, books), to which applying specific content model. The building process of the SIP was applied to the samples selected and was performed throughout activities like the normalization of files' naming, the organization of collections, resources and digital objects, the creation and encoding of metadata files. The building process was tested and integrated many times during the experiment of the ingestion, until the maturity of the metadata framework.","refs":[]},{"text":"At the conclusion of the first phase of project the SIP building was tested in 6 retrospective conversions of existing collections, compounding images and video, and described by spreadsheets and database information.","refs":[]}]},{"title":"Fig. 2. SIP building development","paragraphs":[{"text":"For each sample were defined constraints on the information structure, which characterizes the originating model and unleashes the relevant FC content model.","refs":[]},{"text":"The SIP building process consists of transforming the sources information (databases/datasets/spreadsheets/systems folders) in metadata, enriching it with provenance, context, reference, fixity (OAIS) metadata, and with basic knowledge domain semantics, encoding it in XML files valid for the XML schemas specifications, and combining them following the METS profile specification of the SDL metadata framework.","refs":[]},{"text":"The SIP built has the following characteristics:","refs":[]},{"text":"• based on METS as metadata container;","refs":[]},{"text":"• encompasses different descriptive and administrative standards;","refs":[]},{"text":"• conformant to specific metadata standard guidelines (i.e. DLF aquifer);","refs":[]},{"text":"• conformant to Sapienza customized FC content models;","refs":[]},{"text":"• exists independently and redundantly apart from the DLMS;","refs":[]},{"text":"• open to the inclusion of other metadata standards that are more descriptive than MODS core description.","refs":[]}]},{"title":"SDL DLMS Prototype","paragraphs":[{"text":"The SDL DLMS gets in ingestion the SIP built in conformance with the SDL metadata framework, it archives the objects and information in FC, and makes the SIP's resources available to the SDL exploration's system which allows to navigate, browse and search resources.","refs":[]},{"text":"The prototype is internally available in order to give the opportunity to the project's community of participating to the optimization of the UI and Users' services, as well as testing functionalities, and improving the architectural information structure of the web interface. At this moment the prototype was peopled with 6 collections containing almost 15,000 items, differentiated in four resources types, images, books, videos, and maps. Furthermore, was uploaded a collection created ad hoc for the prototype's homepage, that was created by reusing resources, already ingested in the system. This has verified that the system holds all necessary information useful to create new digital objects (items or collections), that are aggregations of existing resources.","refs":[]}]},{"title":"Future Developments","paragraphs":[{"text":"The second phase of the project will provide the DL with a set of specific DLS which will essentially support 1) the submission of new digital items and collections, 2) the participation of Sapienza community for collecting new materials, 3) the optimizazion of dissemination tools by means of customized interfaces (web users, OAI-PMH, Web Services…), and the integration of services for the exhibition/export of metadata for third party resources aggregators: InternetCulturale11 , Europeana12 , World Digital Library13 , 4) the integration of metadata supporting preservation planning and administration.","refs":[{"start":479,"end":481,"marker":null,"target":"#foot_11"},{"start":493,"end":495,"marker":null,"target":"#foot_12"},{"start":519,"end":521,"marker":null,"target":"#foot_13"}]},{"text":"The workflow of the overall materials submission will be ruled by SDL guidelines wherein will be defined the Sapienza digital policies. The guidelines will harmonize the way of creating, and producing digital resources for the DL: specific paths for different content models will be described in order to support the community in being aware about the digital resources' management.","refs":[]},{"text":"Stable METS and MODS profiles will be released during this phase. At the end of 2012, the system will be released in production for the main functionalities, and will be open to other partners.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The Sapienza Digital Library (SDL) is a research project undertaken by Sapienza Università di Roma, the largest Europe's campus, and the Italian supercomputer center Cineca.","refs":[]},{"text":"The SDL project aims to build an infrastructure supporting preservation, management and dissemination of the past, present and future digital resources, that contain the overall intellectual production of the Sapienza University. The solution adopted tries to find a tradeoff between the standardization of the digital processes and products (that allows a cost-effective centralized and shared management and curation), and the preservation of the peculiarities of scientific materials, belonging to disparate knowledge disciplines (that need to be digitally available for future initiatives, more specifically tailored to the designated communities).","refs":[]}]}}