{"bibliography":{"title":"Training Data Stewards in Italy: Reflection on the FAIR RDM Summer School","authors":[{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"annamaria.tammaro@unipr.it"},{"person_name":{"surname":"Caselli","first_name":"Stefano"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"stefano.caselli@unipr.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-39905-4_16","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Open science 1 introduction: research data management skills gap","Data stewards","Research data management"],"citations":{"b0":{"title":"ARL: Strategic Thinking + Design Initiative report","authors":[],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":"https://www.arl.org/wp-content/uploads/2015/02/strategic-thinking-design-full-report-aug2014.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Setting Up Open Access Repositories: Challenges and Lessons from Palestine","authors":[{"person_name":{"surname":"Awadallah","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":"iPRES","journal":null,"series":null,"scope":null},"b2":{"title":"Big Data, Little Data, No Data: Scholarship in the Networked World","authors":[{"person_name":{"surname":"Borgman","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":null},"b3":{"title":"Roles and responsibilities: libraries, librarians and data","authors":[{"person_name":{"surname":"Corrall","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"Facet","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":105,"to_page":133}}},"b4":{"title":"Data Stewardship for Open Science: Implementing FAIR Principles","authors":[{"person_name":{"surname":"Mons","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":"CRC Press Taylor and Francis Group","journal":null,"series":null,"scope":null},"b5":{"title":"Una proposta non sovversiva","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Biblioteche oggi","series":null,"scope":{"volume":36,"pages":{"from_page":65,"to_page":71}}},"b6":{"title":"Data curator's roles and responsibilities: an international perspective","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Matusiak","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sposito","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Casarosa","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Libri","series":null,"scope":{"volume":69,"pages":{"from_page":89,"to_page":104}}}},"sections":[{"title":"Research Data Management in Italy: The Skills Gap","paragraphs":[{"text":"The mandate of the European Commission for Open Science states: \"As open as possible, as closed as necessary\". In practice, the European Commission asks the professors and researchers involved in projects for which public funding is requested and obtained to deposit research results, including scientific publications, in open access repositories and to produce a Data Management Plan for the data.","refs":[]},{"text":"In Italy, after Law No. 112/2013 which launched a first political initiative for Open Access to scientific publications, a bill (called \"Gallo\" from the name of the speaker) is now being discussed in Parliament, which includes the research data among its topics of interest, as the first legal basis of a national policy for the research data infrastructure, starting from the existing network of institutional repositories.","refs":[]},{"text":"Even in Italy, some research data management pioneering experiences are born, many linked to the IOSSG group. The characteristic that distinguishes the service of these Italian universities has been defined as: \"single point of entry\". This model of open data support services, developed by the IOSSG Group, highlights the social role of the data librarian, who must work with the other University offices involved in the research cycle. However, adequate skills are lacking in Italy, and moreover new roles are needed for support services. Only two training experiences have been carried out at the Universities of Bologna and Padua, where the Library Systems have trained staff involved in support services.","refs":[]},{"text":"Most of the professional literature believes that the librarian's background includes fundamental skills for the data librarian, but often does not describe them. During the Stelline Conferences in 2018 and 2019 two Seminars were held on the Data Librarian profile to understand the needs of Italian universities that pioneered the research data management service. The organizers of the two Seminars were DILL (International Master in Digital Library Learning) together with IOSSG, OpenAire and RDA. The good practices of some of the major Italian universities were illustrated during the seminar by Elena Giglia (University of Torino), Paola Galimberti (University of Milan), Elena Bianchi (University of Padua), Marialaura Vignocchi (University of Bologna).","refs":[]},{"text":"The questions on which the organizers wanted to start the discussion were: What are the activities necessary for research data management? and what skills are consequently necessary for the training and updating of the data librarian? Before the first Seminar in 2018, a questionnaire was distributed on the skills of the data librarian. A conversation before and after the Seminar took place online, and helped to clarify the different opinions of librarians.","refs":[]},{"text":"The questionnaire that preceded the Stelline Seminar allowed to highlight the opinions of 165 librarians who responded to the survey (Tammaro 2018). The competencies listed in the questionnaire had to be classified by the respondents as: fundamental (core identity of the librarian), specialized (emerging competencies of the data librarian), important (common to librarians in different roles) and not important. The objectives that had been set were:","refs":[{"start":133,"end":147,"marker":"bibr","target":"#b5"}]},{"text":"• Understand the skills that require specialized training for the data librarian;","refs":[]},{"text":"• Highlight the core skills that each librarian curriculum should propose.","refs":[]},{"text":"The results of the questionnaire for the first macro-area of the support activities highlight as core skills in order of importance: cataloging (59%) including classifications and ontologies (28%), evaluation and selection of resources (28%) and preservation (28%). It is interesting to note that the management of research data (35%) is considered both a core competence and an emergent competence: librarians believe that the management of research data is part of the professional profile.","refs":[]},{"text":"Technological skills are also considered important for all librarians. In particular, in order of importance we highlight: institutional repositories (35%), user experience (33%), interoperability (41%), semantic web (46%), information architecture (40%).","refs":[]},{"text":"All management skills are considered important: research methods for user studies and service evaluation (50%), support for institutional services policies (49%), resource management (47%), legal aspects and ethical (42%), costs and business plans (39%). It is interesting to note that many librarians consider the business plan a specialist competence of the data librarian (44%). Even the organizational culture is a competence of common importance and considered fundamental: as an aptitude to work in a group (72%) and ability to network (68%), orientation to problem solving (68%), multiculturalism (55%).","refs":[]},{"text":"Other skills that have been added by respondents concern aspects that had been neglected in the questionnaire such as: statistics, humanistic skills to understand the social value of research results, knowledge of international good practices, information literacy, empathy, ability to delegate and to ask questions if something is not known.","refs":[]}]},{"title":"FAIR Research Data Management Summer School","paragraphs":[{"text":"The planning of the \"Fair Research Data Management\" Summer School in Parma began during a management meeting of the ROMOR Project in Brighton (16-18 January 2019) with an initial discussion of the learning objectives from the partner institutions. Since the Summer School would take place in the last year of the ROMOR project (http://romor.iugaza.edu.ps), the partners agreed on the dual objective of consolidating the knowledge of Open Access Institutional Repositories (OAIR) topics and developing the data stewards skills on more advanced topics. From the Stel-line Seminars survey on learning needs and from documentary research, it was highlighted that currently no training offer is available in Italy on the management of research data. In agreement with the ROMOR Project coordinator, it was decided to open the Summer School also to external participants.","refs":[]},{"text":"The purpose of this paper is to evaluate what has been done for the Italian participants and discuss how to improve the curriculum of the Summer School in the next experience.","refs":[]}]},{"title":"Learning Objectives","paragraphs":[{"text":"In developing the Summer School program, there were some actions that had a prominent role, both as a process of self-learning of the Parma team and as an outcome of the ROMOR project (Awadallah et al. 2019), where the Parma team had the opportunity to collaborate with the most experienced European and Palestinian partners in the management of research outputs.","refs":[{"start":184,"end":207,"marker":"bibr","target":"#b1"}]},{"text":"One of the first activities was an applied documentary research (benchmarking) on the teaching of \"data management\" and \"FAIR principles\", together with conversation with experts involved in teaching in ROMOR (Peter Burnhill, Janet and David Anderson, Susanna Mornati, Joseph Torn, Ilaria Fava, Marialaura Vignocchi, Marisol Occioni, Emma Lazzeri) and together with Paola Gargiulo, Elena Giglia: all of them allowed us to identify different education and training proposals on the management of research data, which was a key point for analysis of the needs and the planning phase of the program.","refs":[]},{"text":"The broad context of the Summer School at the University of Parma covered the FAIR principles relating to interoperability and re-use of research data.","refs":[]},{"text":"FAIR data are data which meet standards of findability, accessibility, interoperability, and reusability. The expected learning outcomes were:","refs":[]},{"text":"-Planning a management campaign of research results -Re-use of research data for the entire research life cycle.","refs":[]}]},{"title":"Learning Material","paragraphs":[{"text":"The materials and the bibliography of the Summer School were selected from various sources: the reference materials of the previous training courses of the ROMOR Project and the presentations used for the lessons that were regularly taught. A variety of educational material has been used for the study schools, such as videos, links, documents to adhere to the learning objectives and the expected outcomes.","refs":[]},{"text":"Copyright was taken into consideration, providing all the material that the students of the Summer School could be used in open access with a CC-By license. All teaching material was available from the FAIR RDM Study School website (http://fair-rdm. unipr.it).","refs":[]}]},{"title":"Course Content","paragraphs":[{"text":"A combination of frontal and laboratory lessons has been planned. The first day was an introduction to the FAIR principles for the quality of research data together with a focus on the user of the data and the needs for re-use and interoperability. The second day was dedicated to the new generation of institutional repositories and OpenAire with practical exercises for evaluating different types of needs. The third day focused on the legal issues of copyright and privacy together with policy impact on the organization of support services. A \"Data Carpentry\" laboratory was planned and managed in collaboration with Data Carpentry team in the last two days (http://datacarpentry.org).","refs":[]},{"text":"Other mobility activities included visits to the libraries of Italian Universities of Bologna and Venice (the latter visited virtually) to learn about the management of research data.","refs":[]},{"text":"The final assignment (group activity) was based on the planning of an information website for accessing from a single point the support service for the management of research data.","refs":[]},{"text":"The course structure is reported in the Appendix.","refs":[]}]},{"title":"Selection of Participants","paragraphs":[{"text":"Data stewards are support staff and subject-specific experts and often have different skills and knowledge that they bring to the research data management team. However, this also means that data stewards may have varying degrees of understanding of general needs and expectations in the field of research and Open Science data management. However, the Summer School focused on an intensive training program on topics of common interest for different backgrounds.","refs":[]},{"text":"The Summer School was planned for a total of 40 Palestinian participants and a maximum of 20 external participants. Meeting rooms and facilities have been planned based on the expected size of the class. Three tutors (Computer Engineering students with personal interest in the School topics) were also recruited to support laboratory activities, as recommended by the Data Carpentry laboratory methodology.","refs":[]},{"text":"The criteria for the selection of the participants in the School of Study were the following. Staff and researchers from the Palestinian institutions affiliated with ROMOR were selected by the ROMOR partners based on their previous involvement in the project, the role within the university and their knowledge of OAIR issues.","refs":[]},{"text":"The criteria for Italian candidates were based on their background and role (librarians, researchers, IT staff, etc.) declared in their online application, together with their motivation to participate. The applications were accepted according to the order of the applications received. The window for the application of participants remained open for 10 days.","refs":[]},{"text":"A total of 63 qualified applications were received (40 Palestinian participants and 23 Italian participants). All candidates were admitted with an official invitation, as the total number was close to the maximum expected and all candidatures showed adequate motivation and background.","refs":[]}]},{"title":"Attendance","paragraphs":[{"text":"The duration of the Summer School was 5 days, from 1 to 5 July 2019. Participation in the lessons was very constant, despite the hot temperature of the Italian summer and the very dense Summer school program. Participants enthusiastically participated in all the lessons, engaged in discussions, mixed in working groups, were stimulated to active and proactive interactions between them and with the teachers.","refs":[]}]},{"title":"Institutional and Media Coverage","paragraphs":[{"text":"The Summer School was opened with a welcome speech by the Vice-Chancellor for Research of the University of Parma. In the coming days, it included brief statements by the Vice-Chancellor for International Relations and the Director of the Center for International Cooperation at the University of Parma.","refs":[]},{"text":"The Summer School was advertised on the University of Parma website and in specialized mailing lists. The Summer School has also been marked with interviews, photos and articles from local newspapers and TV.","refs":[]}]},{"title":"Summer School Final Evaluation","paragraphs":[{"text":"At the end of the Summer School, two types of assessment were carried out with the 63 participants with differentiated questionnaires for Palestinian participants and Italian participants.","refs":[]},{"text":"All participants were asked to evaluate the general programme structure and organization of the contents on the various aspects of the Summer School to gather their opinions, as well as their advice for future editions of the School.","refs":[]}]},{"title":"Evaluation of Summer School Programme","paragraphs":[{"text":"Many Italian participants declared that they were very satisfied with the open format of the School. As for the relevance of the contents, a great degree of satisfaction has been reported, which allows us to affirm that the topics have been well selected (Figs. 1 and2).  The contents (Fig. 2) that received the highest satisfaction (69% very satisfied) were in the second day in the Next Generation repositories and OpenAire, together with the fourth day (60% satisfied) in Data Carpentry using Open Refine. Both of these sessions were based on practical exercises following a theoretical introduction.","refs":[{"start":262,"end":263,"marker":"figure","target":"#fig_0"},{"start":267,"end":268,"marker":"figure","target":"#fig_1"},{"start":291,"end":292,"marker":"figure","target":"#fig_1"}]},{"text":"The contents proposed in all other days of the Summer School satisfied on the average about 50% of the participants, including the Introduction to FAIR and Copyright and privacy.","refs":[]},{"text":"Some problems can be noticed on the last day, devoted to the application of R, in which satisfaction fell to 24% and very satisfied to 31%, with 31% partially satisfied. This session was somehow more technical and perhaps not fully suitable for all attendees, in the short time available.","refs":[]},{"text":"The Summer School organization received the highest percentage (70%) of satisfaction, together with classroom and accommodation (61%).","refs":[]},{"text":"About the mastering of the subject by the speakers, 60% of the participants stated that they were very satisfied. The pedagogical approach of all the teachers and tutors was highly appreciated. Also the learning material obtained the following evaluation: very satisfied by 46% and satisfied by 36% of respondents, partly satisfied by 15% of respondents.","refs":[]},{"text":"In general, it can be concluded that the School had many positive elements and that it can be repeated making some adjustments, mainly in the distinction between theory and practice.","refs":[]},{"text":"Open comments and suggestions from participants include:","refs":[]},{"text":"-A more practical focus on the long term preservation of digital objects, with example of software and formats to be used. -Other platforms and tools (open and free if possible) for data repository.","refs":[]},{"text":"-More practical applications of RDM on a technical point of view, for instance through case studies, working groups and labs. -Keep technical sessions separated from the rest of the training for those really interested in hands-on training.","refs":[]},{"text":"-Software and tools for data management as lecture on a handful programmes focusing on the concept and tasks or assignment that those tools can accomplish.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"Courses with classes of this size generate many expectations in the participants, who can interact and share experiences and establish contacts with colleagues from different institutions at national and international level. The development of the FAIR RDM Summer School provides the following conclusions, which should be taken into account in other education and training projects of this style:","refs":[]},{"text":"-The role of the data steward is truly international, with FAIR principles and homogeneous organizational criteria that can be applied to various contexts.  ","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Fair Research Data Management\" Summer School in Parma focused on the skills gap in Italy for data stewards. A distinct feature of the Summer School was its aim to bring together participants from different backgrounds and from different countries. The paper is a reflection on the organization of the Summer School and the evaluation received by the participants.","refs":[]}]}}