{"bibliography":{"title":"Digital Libraries in Open Education: The Italy Case","authors":[{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"annamaria.tammaro@unipr.it"},{"person_name":{"surname":"Ciancio","first_name":"Laura"},"affiliations":[{"department":null,"institution":"ICCU Ministero Beni Culturali","laboratory":null}],"email":"laura.ciancio@beniculturali.it"},{"person_name":{"surname":"De Rosa","first_name":"Rosanna"},"affiliations":[{"department":null,"institution":"Università di Napoli Federico II","laboratory":null}],"email":"rderosa@unina.it"},{"person_name":{"surname":"Pantò","first_name":"Eleonora"},"affiliations":[{"department":null,"institution":"CSP Innovazione nelle ICT","laboratory":null}],"email":"eleonora.panto@csp.it"},{"person_name":{"surname":"Nascimbeni","first_name":"Fabio"},"affiliations":[{"department":null,"institution":"Universidad Internacional de La Rioja","laboratory":null}],"email":"fabio.nascimbeni@unir.net"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-68130-6_3","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Open education","Oer","Iccu","Moocs","Internet culturale","Emma","Digital libraries"],"citations":{"b0":{"title":"Supporting growth and jobsan agenda for the modernisation of Europe's higher education systems","authors":[],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://eur-lex.europa.eu/legal-content/EN/ALL/?uri=CELEX:52011DC0567","publisher":"European Commission","journal":null,"series":null,"scope":null},"b1":{"title":"Open Education Europa","authors":[],"date":null,"ids":null,"target":"https://www.openeducationeuropa.eu","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Opening up Education: Innovative teaching and learning for all through new Technologies and Open Educational Resources","authors":[],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":"http://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX%3A52013DC0654","publisher":"European Commission","journal":null,"series":null,"scope":null},"b3":{"title":"UNESCO: Digital Libraries in Education: Analytical Survey","authors":[],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"IITE","journal":null,"series":null,"scope":null},"b4":{"title":"Libraries and e-learning","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Information management and e-learning: some perspectives","authors":[{"person_name":{"surname":"Akeroyd","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Aslib Proc","series":null,"scope":{"volume":57,"pages":{"from_page":157,"to_page":167}}},"b6":{"title":"Europeana Foundation: Europeana for Education and Learning","authors":[],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":"http://pro.europeana.eu/files/Europeana_Professional/Publications/Europeana%20for%20Education%20and%20Learning%20Policy%20Recommendations.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"Biblioteche per la didattica","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2003","month":"04","day":null},"ids":null,"target":"http://www.bibliotecheoggi.it/2003/20030306201.pdf","publisher":null,"journal":"Biblioteche oggi","series":null,"scope":{"volume":null,"pages":{"from_page":62,"to_page":64}}},"b8":{"title":"Digital libraries, learning communities, and open education","authors":[{"person_name":{"surname":"Lynch","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":"http://mitpress.mit.edu/books/chapters/0262033712chap7.pdf","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":105,"to_page":118}}},"b9":{"title":"","authors":[{"person_name":{"surname":"Emma","first_name":null},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"https://platform.europeanmoocs.eu","publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"","authors":[{"person_name":{"surname":"Oerup","first_name":null},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://www.oerup.eu","publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"Librare was co-funded under the ERDF 2007/2013 of the Piemonte Region with the support of European, National and Regional resources of the ERDF","authors":[],"date":null,"ids":null,"target":"http://www.librare.org/","publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"The challenge of open education","authors":[{"person_name":{"surname":"Pantò","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Comass-Quinn","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":"http://www.je-lks.org/ojs/index.php/Je-LKS_EN/article/view/798","publisher":null,"journal":"J. e-Learning Knowl. Soc","series":null,"scope":{"volume":9,"pages":{"from_page":1,"to_page":1}}},"b13":{"title":"Oer nelle Università italiane: risultati di un'indagine conoscitiva","authors":[{"person_name":{"surname":"Tammaro","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":"http://www.rivistauniersitas.it/files/fileusers/Mooc%20QU30.pdf","publisher":null,"journal":null,"series":"cura di M. Cinque, Universitas Quaderni","scope":{"volume":30,"pages":{"from_page":53,"to_page":66}}}},"sections":[{"title":"Introduction: Key Drivers","paragraphs":[{"text":"In Europe, in the context of the Higher Education modernisation process [1], the European Commission has highlighted how digital technologies represent an opportunity to improve quality of education and to increase access and equality for all. In particular, Open Education promotes the objectives of the Bologna Process for higher education and that of lifelong learning, enhancing internationalization, democratization of education, active and collaborative learning, as well as the co-creation of content by teachers and students. In 2013, the European Commission launched the \"Open Education Europa\" [2] portal to collect and promote existing national initiatives, aiming to exploit the potential of OER by including digital technologies into current practices of university and continuing professional development initiatives. A stimulus in this direction came in 2013 with the Communication Opening Up Education [3], promoting those approaches removing barriers to participation in education at all levels through use of ICT. The approaches \"Open\" serve as an example for Open Education policies at the level of EU member states.","refs":[{"start":72,"end":75,"marker":"bibr","target":"#b0"},{"start":604,"end":607,"marker":"bibr","target":"#b1"},{"start":918,"end":921,"marker":"bibr","target":"#b2"}]},{"text":"Open Education represents a key strategy to meet the growing need for connections between the worlds of formal, non-formal and informal learning towards lifelong learning, and can contribute to learning modernisation towards educational systems that are:","refs":[]},{"text":"• Centered on the learner, • Based on collaborative learning; • Combined with constructivist pedagogy;","refs":[]},{"text":"• Personalized in various training programs;","refs":[]},{"text":"• Focused on continuous training on competencies (such as information literacy).","refs":[]},{"text":"In order to achieve the ambitious goal of continuous learning, the availability of OER and MOOC is not enough, however, and a favorable context that can facilitate learning, such as digital libraries, is needed. Digital libraries can become incubators and instructional hubs, where learning can be enhanced.","refs":[]}]},{"title":"Digital Libraries in Open Education","paragraphs":[{"text":"The Report \"Digital Libraries in Education: analytical survey\" published by UNESCO in 2003 [4] emphasizes the need to coordinate the development of Open Education initiatives with the growth of Digital libraries. In the definition given by UNESCO Digital libraries are distinguished from \"hybrid\" libraries and even from traditional libraries. According to UNESCO, the benefits that digital libraries can bring to Open Education developments are very ambitious: \"as a way of restructuring the current higher-education enterprise into a global\" knowledge and learning \"industry\" [4, p. 7]. Instead of being tied to the traditional metaphor of libraries, UNESCO explains that Digital libraries are intended as advanced tools for collaborative construction of: \"knowledge and learning\". The definition of the Digital library which is adopted is the following: \"… an environment bringing together collections, services, and people to support the full cycle of creation, dissemination, discussion, collaboration, use, new authoring, and preservation of data, information, and knowledge\" [4, p. 7].","refs":[{"start":91,"end":94,"marker":"bibr","target":"#b3"},{"start":578,"end":587,"marker":"bibr","target":null},{"start":1082,"end":1091,"marker":"bibr","target":null}]},{"text":"Digital libraries as suggested in the UNESCO report, can offer essential features:","refs":[]},{"text":"• They are made for specific users' learning needs;","refs":[]},{"text":"• They offer re-use of a large amount of educational resources;","refs":[]},{"text":"• They allow open access to anyone, anytime and anywhere.","refs":[]},{"text":"How do Digital libraries have achieved this ambitious goal of enhancing learning? Best results can be evidenced for the technological infrastructure. Digital libraries are, however, quite behind when it comes to the objectives of applying a constructivist pedagogy and facilitating collaboration.","refs":[]}]},{"title":"Digital Libraries as Infrastructure","paragraphs":[{"text":"From a technological point of view, the experiences of European Digital libraries in relationship with Open Education have experimented two possible ways of collaboration. First, Digital libraries as collections of educational resources (learning object) integrated into the OER management platforms and MOOC (LMS-Learning Management System); second, Digital libraries as learning platforms themselves (VLS -Virtual Learning System). Both approaches are based on Web technology (standards and protocols) that are transversal to Digital libraries and Open Education.","refs":[]},{"text":"In the UNESCO view, Digital libraries should indeed become essential components of the basic infrastructure for research, learning and teaching: learning incubators, pillars of \"knowledge and learning\". What has been achieved since the publication of the UNESCO report? ELAG (European Library Automation Group) in 2005 and in 2006 established a working group to understand the technological and organizational issues of the possible cooperation between the libraries community (not just Digital) and education (not just Open). The research question which was investigated was:\"..a student is working in the e-learning environment and is recommended to read a given article, which is within a licensed database or a library repository; how can this be enabled with minimum effort and minimum confusion on the part of the user?\" [5, p. 1].","refs":[{"start":827,"end":836,"marker":"bibr","target":null}]},{"text":"Three models were identified:","refs":[]},{"text":"1. Content and support: this model is essentially that of the integration of the additional resources indicated by UNESCO, in which the digital content is static and is delivered through link to the resource; 2. Wrap around: this model provides a dynamic resources pool, with which students can interact, becoming themselves content creators; 3. Integrated: this model indicates a learning community facilitated by a platform that can be the digital library itself, where there is an explicit reference to the OER, with the student's ability to interact with resources and with a learning community with the same interests [6].","refs":[{"start":623,"end":626,"marker":"bibr","target":"#b5"}]}]},{"title":"Model 1: Content and Support","paragraphs":[{"text":"The quality of educational content is definitely the strong point of Digital libraries, since these provide a set of resources that are selected, organized, preserved and maintained, along with a set of metadata that describe the content of educational resources and general support (Fig. 1). Access to resources of Digital libraries is accompanied (within copyright limits) by the capability of re-using and combining resources, stimulating creativity and innovation. This opportunity is made possible by specific metadata that describe the educational value of the resource within a specific learning context. This value is usually assigned by the teachers, who select the resources in a Resource Based Learning (RBL) educational approach (abandoning the obsolete textbook), but it can also be left to the selection of the learners, in order to make them more responsible and constructive in their learning process. Even in the case where there is not a default path orienting the user, the Digital library value stands in its selection of high quality resources, as well as in the curation of the digital collection, which distinguishes the digital library from the Web in general. Digital libraries are therefore \"information spaces\" which can revolutionize the concept of the classroom: here a learner can find the high-quality resources that match his/her research needs but also meets with teachers and peers learners, with which he/she can learn collaboratively. They can also be combined with other platforms and tools that are classified as social media, to facilitate social interaction of digital libraries with teachers and learners, and among learners. This is the model that has been adopted by Europeana [7], for example, which has launched with the European Schoolnet, EUROCLIO and EMMA platforms the possibility of direct access to digital resources retrieved through its search engine.","refs":[{"start":289,"end":290,"marker":"figure","target":"#fig_0"},{"start":1720,"end":1723,"marker":"bibr","target":"#b6"}]}]},{"title":"Model 2 and 3 Wrap Around and Integrated","paragraphs":[{"text":"Models 2 and 3 of ELAG WG can be considered equivalent to the model called by UNESCO VLE (Virtual Learning Environment), in which digital libraries are themselves platforms for continuing education. In this Open Education advanced scenario (Fig. 2), the OER resources are represented in the Digital Library, in the e-learning environment and accessible through the Internet, while learners and teachers (including stakeholders) are proactive in choosing and creating learning paths. The National Science Digital Library (NSDL) is an example of a Digital Library as an integrated platform where OERs are organized for educational purposes and where users are stimulated to be creators of content. Some private companies such as Questia have also tried to realize this typology of digital library with an advanced role in learning support [8].","refs":[{"start":246,"end":247,"marker":"figure","target":"#fig_1"},{"start":837,"end":840,"marker":"bibr","target":"#b7"}]},{"text":"However, despite the attention that the research on Digital library has given to VLS (Virtual Learning Systems), Digital libraries as platform for learning \"compete\" with many other services and platforms. The integration of Digital libraries within the contexts of e-learning platform and the relationship with Open Education has been and still is difficult. The lack of educational metadata in organizing the collection is an obvious example of the difficulty of Digital libraries to take on an educational role.","refs":[]},{"text":"The reason for this is to point to the weakness of the digital libraries for pedagogy. Following the distinction made by Lynch [9], it is evident that digital libraries do not play an educational role because they are not able to educate, but only to support lifelong learning.","refs":[{"start":127,"end":130,"marker":"bibr","target":"#b8"}]}]},{"title":"Digital Libraries and Pedagogy","paragraphs":[{"text":"The difficulty for Digital libraries is to integrate new educational theories, according to the vision of the constructive approach of Open Education indicated above. Lynch [9] distinguishes between learning needs for training and for education, indicating that digital libraries are not for education. While Thomas Carlyle in the last century could say \"true university today is a collection of books\" Lynch affirms that today it would not be possible to state that the Digital library would be the university, given the amount of educational resources freely available on the Internet in the forms of MOOCs and OERs. In other words, access to information should not be confused with access to education! To become themselves platforms for education and training, Digital libraries should become able of promoting meaningful educational approaches, stimulating some form of social interaction among teachers and learners and administering the assignments on which then give feedback. The interaction with the learners should also seek to involve the participants and motivate them to be engaged in learning, interacting with resources and with other learners.","refs":[{"start":173,"end":176,"marker":"bibr","target":"#b8"}]},{"text":"The negative opinion of Lynch is only partly contradicted by the advanced experiences of Digital libraries in education nominated before, such as within the collaboration between European Schoolnet and Europeana, or the US National Science Digital Library (NSDL) project, which is working with communities of teachers and learners in the science area. These advanced experiences depict a digital library environment which is human-teacher intensive, in which digital libraries not only facilitate the interaction of teachers and learners, but are meaningfully supporting teaching, for example by adding metadata on learning outcomes, providing tutorials, preparing bibliographical guides. And above all Digital libraries should be giving the opportunity to the learning community to be participatory, offering the capability to create content and to foster the re-use of digital assets, in an Open Education philosophy. The collaboration with teachers is fundamental. Europeana [7] has produced in 2015 the Policy Recommendations for Education and Learning, focusing on the need to improve dialogue between teachers and Digital libraries.","refs":[{"start":978,"end":981,"marker":"bibr","target":"#b6"}]},{"text":"One aspect to which Digital libraries cannot provide support is the assessment and validation of learning achievements, since a feedback to the learners on their learning results, as well as the support and guide towards learning outcomes, cannot be achieved with the simple administration of self-assessment tests and other certification devices such as badges. The collaboration with teacher and their assessment role is in this way crucial for Digital libraries.","refs":[]},{"text":"In conclusion, an educational role of digital libraries seems to be the weakest part of the Digital libraries in Open education, they cannot replace the university education and advanced training. Digital libraries are well positioned instead for lifelong learning and adult education, to provide support for developing professional skills.","refs":[]}]},{"title":"Digital Libraries and Open Education: State of the Art in Italy","paragraphs":[{"text":"A number of recent developments related to Open Education in Italy must be mentioned.","refs":[]},{"text":"Given the exponential growth of the MOOC phenomenon, at the beginning of 2016 the Conference of Italian University Rectors (CRUI) has launched a set of shared guidelines for the preparation of high quality MOOC by Italian universities. Also, CRUI has developed an institutional framework for the mutual recognition of credits by universities and finally has established a system of benchmarking for the evaluation of MOOCs quality. This ambitious project on the one hand has the merit of turning the spotlight on the little known OER phenomenon in Italian universities, while on the other tends to pursue an overly regulatory approach for a start-up phase that would require greater freedom to experiment. EDUOPEN and RUIAP are university networks which have been created to offer MOOCs both for university students and for professional and have reached a higher degree of consolidation. Other Italian institutions are active in a number of European projects dealing with Open Education, such as EMMA [10] and OER-Up [11].","refs":[{"start":1001,"end":1005,"marker":"bibr","target":"#b9"},{"start":1017,"end":1021,"marker":"bibr","target":"#b10"}]},{"text":"In the Italian scenario, there are also private players that offer free online courses, such as the ILO project, which started in 2009 as a platform specifically dedicated to high school students and funded by private investors. ILO Website gives an explicit reference to the Creative Commons license BY-NC-ND 2.5, applicable unless otherwise specified: for example, the 3000 lessons offered by Umberto Eco Encyclomedia project have copyrights reserved to the publisher EM Publishers Srl.","refs":[]},{"text":"Finally, in a context in which the audiovisual format is becoming more and more dominant, it becomes crucial the role of RAI, the national television broadcasting services. RAI Education offers thematic channels on history, philosophy, art and a service to create collections of videos on the portal RAI School which, however, are not exportable or downloadable.","refs":[]},{"text":"Parallel to these Open Education development, starting from the late '90 s Digital libraries have become important in Italy,","refs":[]},{"text":"The Italian Digital Library was officially born in 2001, during the National Conference of Libraries in Padua. The development of digital libraries in Italy has been slow but steady, connected from its inception to EUROPEANA and European projects (many with an Italian coordination) but characterized by fragmentation of initiatives as it can be evidenced in the professional literature.","refs":[]},{"text":"Collaboration between Digital libraries and Open Education is still in its initial state in Italy, and to describe it, we can list some initiatives of digital libraries in the Open Education field and some Open Education initiatives that are run in collaboration with libraries.","refs":[]}]},{"title":"Initiatives Connecting Digital Libraries and Open Education","paragraphs":[{"text":"Starting in 2010, the portal Internet Culturale has been developed as a search engine giving integrated access to catalogues and to digital content of the collections of Italian libraries. Internet Culturale is working across the various collections of Italian libraries, linking various digital assets and for any discipline. Internet Culturale aims to promote Italian culture and was the first Digital library initiative to put clearly the goal of being a support to learning. In the new version (released in 2017), Internet Culturale gives more and more value to a participatory approach in digital content, opening to the collaboration of accredited users, such as teachers, \"students\" or other content provider partners, in order to create content for the digital library. These \"special\" users may agree with the Internet Culturale portal management, to contribute particular collections. Students can give their editorial contributions, experiencing a participatory experience and achieving knowledge of digital tools.","refs":[]},{"text":"In particular, teachers have the possibility of finding digital resources for their research, students can take special paths, those selected by the teachers, and those selected by the Internet Culturale portal. The features that are provided for inexperienced students are: \"similar documents\" and \"suggested documents\" which are \"search\" features that guide to bibliographical lists, exhibitions, texts and other resources. Media resources are also available, such as 3D objects, classified according to thematic areas and classes of indexing.","refs":[]},{"text":"Also the 2016 Piano Nazionale Scuola Digitale (PNSD) has included innovative school libraries which promotes the use of digital collection. These are defined as: \"biblioteche scolastiche capaci di assumere (…) la funzione di centri di documentazione e alfabetizzazione informativa, (…) aperti al territorio circostante, nei quali moltiplicare le occasioni per favorire esperienze di scrittura e di lettura, anche con l'ausilio delle tecnologie e del web. Le reti saranno anche centri di formazione per i docenti sulle tematiche della gestione di risorse informative cartacee e digitali (…)\" [12, p. 100].","refs":[]},{"text":"The access to digital resources is seen by school libraries primarily as a \"digital lending\" service for reading, especially entrusted to MLOL (Media Library OnLine) platform as a service aggregator for school libraries.","refs":[]},{"text":"In the Librare Project [13] another approach was adopted, working on the \"book\", imagining that the books will have a leading role in the digital world, overcoming the paper-digital dichotomy through the interaction between people, objects, tools and knowledge. The underlying idea of the Librare research project (2015-2016) was to \"transform\" books from paper volumes in virtual objects, following the model of the Internet of Things, becoming traceable objects, collecting more and more information entered by users, according to the pattern of the Internet of Persons. At the same time, in Librare the interaction between paper books and online digital content was facilitated, allowing a better integration of activities that take place on the Web and out of the school, with educational activities that take place in the flipped classroom. These activities have been realized following the Living Labs approach where students, teachers, citizens were involved in the innovation processes. In Librare, students and teachers from all the degrees of schools (Primary and Secondary) were involved in Torino, and in other parts of Italy: a core group of about five classes carried out all the activities proposed by the project. What have been developed, concretely? First of all a Web platform (server side) was set up to manage data flows and interactions that take place in \"informal libraries\" (i.e. school libraries or book crossing places). Second, reading activities were stimulated, individually or collaboratively, with paper books or online editions. On the client side, two mobile applications (Librare and Librando) were provided to the users, a geographic mapping system (FirstLife), and a Web app for online collaborative reading (the Cbook).","refs":[{"start":23,"end":27,"marker":"bibr","target":"#b11"}]},{"text":"Barriers and obstacles to the use of digital libraries must be highlighted. In Librare many challenges were encountered: schools (mostly primary, but also some secondary professional schools) were not totally equipped with wi-fi connection in the classroom and with tablets; some secondary schools have important library but others have no library at all, or very poor and not managed library; students and family were very concerned about their privacy and the possibility of being tracked, and the project managed very carefully the data, and also many corrective actions (creation of closed group) were put in place. Cbook was very appreciated by teachers and students, but the scarcity of digital resources titles (mostly Italian classics like Divina Commedia, Promessi Sposi) limited the adoption but increased the awareness of intellectual property rights [14].","refs":[{"start":862,"end":866,"marker":"bibr","target":"#b12"}]}]},{"title":"Initiatives Connecting Open Education and Digital Libraries","paragraphs":[{"text":"EMMA is the first experience of Open Education which tried to work with Digital libraries. The EMMA technological approach was to enter the digital resources of Europeana into the platform, in order to allow the interaction of learners with the resource (Wrap around Model). The approach wants to be a bridge between EMMA and EUROPEANA and to strengthen the definition of a European Area of Higher Education (European Higher Education Area). One of the MOOC proposed by EMMA (Digital Library in Principle and Practice, MOOC in Italian, English and Spanish) has been specifically addressed to K12 teachers in schools of all types and levels for giving the capability to build and use Digital libraries in flipped classrooms. EMMA has organized a Webinar with EUROPEANA to analyze the opportunities and challenges of collaboration of the MOOC with EUROPEANA.","refs":[]},{"text":"The Italian landscape of Open Education [15] is trying, also if not in a systematic way, to offer tools and open resources in Italian language, available to be re-mixed and re-used for educational purposes. Even if the National Plan for Digital School (PNSD) indicates a specific action on the OER, it provides no funding and have had to be concluded in March 2016. It will be interesting to see the result of the recent Call for Digital Curricula, for the creation of resources released in open format to facilitate their reuse.","refs":[{"start":40,"end":44,"marker":"bibr","target":"#b13"}]}]},{"title":"Conclusions and Next Steps","paragraphs":[{"text":"The opportunities offered by OER and MOOCs and other Open Education approaches are especially relevant from the point of view of lifelong learning and innovative teaching, because more easily adaptable to the time constraints of adult learners as well as the ability to connect open learning resources to effective pedagogical approaches methods. The use then of systems that allow the students to control their own learning and their performance contribute to strengthen the autonomy and willingness to learn, with the resulting enhancement of OER in institutional policy.","refs":[]},{"text":"The integration of Digital libraries within Open Education approaches remain at an early stage in Italy, with limited exchange of metadata and with a traditional vision of the library as a repository of resources. With the experience gained from the Internet Culturale and the pioneer experiences of Digital library as advanced systems for the construction of knowledge we have described, we must now be able to do more.","refs":[]},{"text":"The vision is that of Digital libraries as \"knowledge and learning\" open hubs. What is missing? First of all, we would need a real partnership between teachers, students and Digital libraries, so to close the gap -not just digital -that is preventing the full exploitation of the current possibilities offered by digital libraries in Italy and the real experience of teachers and students who use them. In parallel, with the definition of technological infrastructure, we need to concentrate on the real possibilities of collaboration between the Digital library and the teachers, following the most advanced model of integration indicated by UNESCO \"knowledge and learning\". This implies the need to analyze the pedagogical and organizational problems of the realization of the integrated model, starting from the design of the course and its learning objectives, to include a participatory approach of the learning community.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Open Education strategies, and specifically MOOC (Massive Open Online Courses) and OER (Open Educational Resources), play an important role in supporting policies for educational innovation, lifelong learning, and, more generally, the enlargement of educational opportunities for all. While there is an increasing interest in Open Education, there is little awareness about the role of Digital Library as learning incubators for learning enhancement. The paper presents briefly the state of art of Digital libraries in the light of the most recent initiatives of Open Education in Italy, towards an integrated model of Digital libraries as \"knowledge and learning open hubs\".","refs":[]}]}}