{"bibliography":{"title":"Digital Scholarship Innovation and Digital Libraries: A Survey in Italy","authors":[{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":"UNIPR CoLab Centre","institution":"University of Parma","laboratory":null}],"email":"annamaria.tammaro@unipr.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-56300-8_4","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Open science","Digital libraries","Digital scholarship"],"citations":{"b0":{"title":"E-science and data support services: a study of ARL member institutions Association of Research Libraries","authors":[],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":"http://www.arl.org/storage/documents/publications/escience-report-2010.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Digital Scholarship Blog","authors":[{"person_name":{"surname":"Bailey","first_name":"C"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://digital-scholarship.org","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"101 Innovations in Scholarly Communication -the Changing Research Workflow","authors":[{"person_name":{"surname":"Bosman","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Kramer","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":"https://figshare.com/articles/101_Innovations_in_Scholarly_Communication_the_Changing_Research_Workflow/1286826","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"The Fourth Paradigm: Data-Intensive Scientific Discovery","authors":[{"person_name":{"surname":"Hey","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Tansley","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Tolle","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"http://research.microsoft.com/en-us/collabora-tion/fourthparadigm/4th_paradigm_book_complete_lr.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Jim Gray on eScience: a transformed scientific method","authors":[{"person_name":{"surname":"Hey","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Tansley","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Tolle","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"http://research.microsoft.com/en-us/collaboration/fourthparadigm/4th_paradigm_book_comple-te_lr.pdf","publisher":"Microsoft Corporation","journal":null,"series":null,"scope":null},"b5":{"title":"","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":"http://libereurope.eu/committees/scholarly-research/research-data-management-case-studies/","publisher":"Research Data Management","journal":null,"series":null,"scope":null},"b6":{"title":"","authors":[{"person_name":{"surname":"Lodlam","first_name":null},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://lodlam.net/about/","publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"The Once and Future Publishing Library. Council on Library and Information Resources","authors":[{"person_name":{"surname":"Okerson","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Holzman","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":"http://www.clir.org/pubs/reports/pub166/Pub166-pdf","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"A profound change is happening in the world of scholarly communication, where the object of scientific communication is no longer a linear text, although digital, but an object-centric network, consisting of text, data, images, videos, blogs, etc.","refs":[]},{"text":"\"Digital scholarship\" is the term defining the innovation of scholarly communication and it is invoked by those advocating for open access to scholarly knowledge such as. Charles Bailey's Digital Scholarship 1 [2] as well as those promoting collaborative research methodologies in the research lifecycle. Science has entered a \"fourth paradigm\" that is more collaborative, more computational, and more data intensive [5,6] than the previous experimental, theoretical, and computational paradigms. This emerging scientific paradigm is often referred to as Open Science, e-science or e-research [5,6].","refs":[{"start":210,"end":213,"marker":"bibr","target":"#b1"},{"start":417,"end":420,"marker":"bibr","target":"#b3"},{"start":420,"end":422,"marker":"bibr","target":"#b4"},{"start":593,"end":596,"marker":"bibr","target":"#b3"},{"start":596,"end":598,"marker":"bibr","target":"#b4"}]},{"text":"This change is likely to deeply modify the nature and the role of the digital libraries and its relationship with the national academic research platforms (such as CRIS Current Research Information System), publishers and/or thematic data center. This paper advocates that connectivity is the technological foundation of digital scholarship and argues that the characteristics of modern science are data-centric, multidisciplinary, open, network-centric and heavily dependent on internet technologies. A Digital Library that supports scholars should be composed of interconnected discipline-specific data spaces, to enable more effective scholarly communication, to include, for example, enhanced papers and books, better links to data, the publication of software tools, mathematical models, protocols and workflows, and facilitating research collaboration by means of social media channels. The main functionality of a digital library as \"knowledge and learning\" infrastructure should have the ability to effectively and efficiently support a linking environment, openness, resource sharing and collaboration.","refs":[]}]},{"title":"Background","paragraphs":[{"text":"Issued in 2011, the Future of Research Communication and e-Scholarship [4] group is a community of scholars, librarians, archivists, publishers and research funders. The group published a Manifesto2 offering a comprehensive vision of post-Gutenbergian scholarly communication. It forecasts: \"a future in which scientific information and scholarly communication more generally become part of a global, universal and explicit network of knowledge can be explicitly represented, along with supporting data, software, workflows, multimedia, external commentary and information about provenance. In this world of networked knowledge objects, it would be clear how the entities and discourse components are related to each other, including relationships to previous scholarship\".","refs":[{"start":197,"end":198,"marker":null,"target":"#foot_0"}]},{"text":"The Manifesto also outlines six key problems that prevent scholarly communication from achieving its full potential:","refs":[]},{"text":"• how scholarship is evaluated; • current copyright constraints; • the financial aspects of scholarly publishing; • the mechanisms for assessing the quality and value of researchers;","refs":[]},{"text":"• how scholarly data, information, and knowledge are (or could be) represented; • how readers, users, authors, editors and computers can interact with these representations; • and how different knowledge representations could be combined, queried, stored and reused.","refs":[]},{"text":"Force11 is collaborating with the Digital Library Federation DLF to provide their unique perspectives in scholarly communication. Understanding the new workflow of the scholars is important for digital libraries that want to support the innovation of digital scholarship.","refs":[]},{"text":"An online complement to the Force11 Manifesto, the European Web site \"101 Innovations in Scholarly Communication -the Changing Research Workflow\"3 , has been prepared by Jeroen Bosman and Bianca Kramer4 , both from Utrecht University Library in the Netherlands [3]. The website and the infographic with the same name visualize how innovation is taking place across the research cycle, according to 6 phases of the research workflow: For example, a traditional workflow would use Web of Science, SPSS, Endnote 7 and Microsoft Word, Nature, ResearcherID, and Journal Citation Reports at each stage, respectively. However, modern, innovative workflows would use different tools such as Google Scholar, Google Books, Figshare, and Altmetrics. Furthermore, the most important developments in the six research workflow phases are discussed by Bosman and Kramer in the visualization. Some of the developments include:","refs":[{"start":145,"end":146,"marker":null,"target":"#foot_1"},{"start":201,"end":202,"marker":null,"target":"#foot_2"},{"start":261,"end":264,"marker":"bibr","target":"#b2"}]},{"text":"• Trends: Increased use of social discovery tools and scholarly social media • Expectations: More use of \"publish first, judge later\" and more open and post-publication peer review • Opportunities: Using repositories for institutional visibility • Technology is disrupting scholarly research and communications with trends like the increased use of social recommendations and circumvention of traditional publishers.","refs":[]},{"text":"This overview of the Bosman and Kramer infographic evidences the current processes of innovation, disruption, diffusion, consolidation, competition and success of digital scholarship, including Altmetrics and other tools for research assessment.","refs":[]}]},{"title":"New Opportunities for Digital Libraries","paragraphs":[{"text":"Digital libraries are designed to improve the methods of collecting, storing, and organizing information in digital forms and to make information available for searching, retrieval, and dissemination via communication networks. They cover information creation, access, sharing and reuse, and archiving and preservation for information and data. Libraries have always been at the intersection of research, publishing, career advancement and technical advancement within the academy. Often they act however as intermediary, instead of gaining insight into patrons' research practices, and to be embedded in the research cycle in a \"proactive\" way.","refs":[]},{"text":"Bosman and Kramer [3] have also evidenced the current and expected services that digital libraries can offer to digital scholars, distributed in the workflow of the research: preparation, discovery, analysis, writing, publication, outreach, assessment. In this workflow, digital libraries can do more than the present intermediary role in discovery services. The authors have classified the innovative and traditional digital libraries services in four classes: Many digital libraries have also turned towards advancing new models and platforms for knowledge dissemination either in conjunction with or in addition to their local university presses [10]. Library Publishing Coalition [8]5 is an independent, communityled membership association to support an evolving, distributed range of library publishing practices and to further the interests of libraries involved in publishing activities on their campuses. Some examples di digital libraries supporting digital scholarship include: publishing activities, research data curation, opening catalogue data using semantic technologies. The principal transformations in digital libraries are now being enabled by advanced linking and semantic technologies. SHARE consortium of university libraries coordinated by the University of Naples is involved in linked open data publishing together with university presses tools. Linked Open Data in libraries, archives and museums (LODLAM6 ) [9] continues to be a fast growing area of organizational and technological change, having a major impact on the way digital libraries are transforming themselves adapting to new seeking behaviour of faculty and opening the services to new typologies of research, discovery and access tools (Fig. 1).","refs":[{"start":18,"end":21,"marker":"bibr","target":"#b2"},{"start":649,"end":653,"marker":"bibr","target":"#b7"},{"start":687,"end":688,"marker":null,"target":"#foot_5"},{"start":1430,"end":1431,"marker":null,"target":"#foot_6"},{"start":1434,"end":1437,"marker":"bibr","target":"#b6"},{"start":1731,"end":1732,"marker":"figure","target":"#fig_0"}]},{"text":"Research Data Management (RDM) is now part of the research process, and aims to make the research process as efficient as possible, with two objectives: to support the University community's visibility of scholarship and to extend the University's research results outreach, in the context of the third mission. Research data curation is important for institutions as well as for researchers. RDM roles exist in almost every university today and many digital libraries are supporting the changing scenario of the research data management. In the U.S. and Canada, individual large academic research libraries often lead these activities [1]. In 2014, the Scholarly Communication and Research Infrastructures Steering Committee of LIBER in Europe published 11 case studies on Research Data Management7 [7].","refs":[{"start":636,"end":639,"marker":"bibr","target":"#b0"},{"start":798,"end":799,"marker":null,"target":"#foot_7"},{"start":800,"end":803,"marker":"bibr","target":"#b5"}]}]},{"title":"Aims and Objectives","paragraphs":[{"text":"The paper supports the vision of the digital library as a virtual research space, that would enable scalable and innovative research of scholars, within digital collections and using innovative tools. Very much intended as a conversation starter, the paper is presenting the first findings of a survey investigating how digital scholarship is evolving in Italy. The survey is a follow up of a Workshop held in Parma in 2013, trying to understand the transformation of digital scholarship. The survey is conducted with the aim to better understand how current digital libraries in Italy could effectively and efficiently support the digital scholarship transformation. The objectives are:","refs":[]},{"text":"• to describe the digital scholarship growth in Italy,","refs":[]},{"text":"• the new types of digital objects, • how digital scholars afford Open Access and Open Science,","refs":[]},{"text":"• and how research data curation process is currently done.","refs":[]}]},{"title":"Methodology","paragraphs":[{"text":"The The invitation to fill the questionnaire has been distributed to the University of Parma internal list and other academic lists (such as AIUCD Digital Humanities Association) together with promotion using the social media tools.","refs":[]},{"text":"The data collected can be explored through a user-friendly dashboard on the Silk platform8 to view the full data sets as charts, and filtering on discipline, research role, country and career stage.","refs":[{"start":89,"end":90,"marker":null,"target":"#foot_8"}]}]},{"title":"Findings","paragraphs":[{"text":"In this paper we will show the preliminary results from the national survey on digital scholars and the research tools they use, illustrating which tools (including altmetrics tools) are actually used by scholars.","refs":[]},{"text":"The worldwide respondents to Kramer and Bosman Project \"101 Innovations in Scholarly Communication\" were 22.663. The Italian scholars responding to the questionnaire were 525, covering all disciplines as illustrated by the Fig. 2: Areas of the Italian respondents.","refs":[{"start":228,"end":229,"marker":"figure","target":null}]},{"text":"Results have been grouped according to the level of innovation of the processes compared to the traditional organization; innovation is defined by Bosman and Kramer [3] in this way:","refs":[{"start":165,"end":168,"marker":"bibr","target":"#b2"}]},{"text":"Actually change 'the way it's Always Been done' -e.g. user-driven, different business models, changes in the sequence of research activities, shifting stakeholder roles\".","refs":[]}]},{"title":"Open Science in Italy","paragraphs":[{"text":"The \"openess\" paradigm is definitely the most important challenge for the transformation of scholarly communication, involving not only open ways of publication but also changing the traditional flow of research and involving various actors with different responsibilities from traditional organization.","refs":[]},{"text":"Results show (Fig. 3) that there is a positive attitude of Italian scholars towards the Open Access (72%) and the Open Science (77%). However the most used type of publication (Fig. 4) continues to be the journal article in academic journals, with peer review and impact factor, while Open Access journals (Gold and Green road) remain a minority experience. The preferred publishing channels depend on disciplinary differences, with IEE the favorite channel, ACM and ACS for the Areas of Science and Technology. The humanistic Area continues to prefer books as typology of publication, with the favorite channels of publication indicated in Casalini Digital and the University Press (Fig. 4). Interestingly, the open cycle of scholarly communication has already had an impact on Italians scholars for sharing and collaborating with research results and for the ways of storage that are used. For archiving research publications the preference is for institutional repositories and Department website (Fig. 5), together with ResearchGate, Academia.edu, Dropbox, etc. For data and code sharing (Fig. 6), all respondents use non-institutional platforms, with preferences ranging from Github and Fligshare to include Academia.edu, Research-Gate, Dropbox and Google Drive. The only exception is the preference for the Department website as institutional infrastructure. ","refs":[{"start":19,"end":20,"marker":"figure","target":null},{"start":182,"end":183,"marker":"figure","target":null},{"start":689,"end":690,"marker":"figure","target":null},{"start":1006,"end":1007,"marker":"figure","target":null},{"start":1098,"end":1099,"marker":"figure","target":"#fig_4"}]}]},{"title":"Discovery and Access Tools","paragraphs":[{"text":"For research and access to publications, Italian scholars now have several possibilities. It is surprising to note that the first search is done in Google Scholar, followed by other tools such as Scopus and Web of Science. The library catalog is one of the last source: the Italian scholars listed Worldcat-OCLC, which the Italian academic libraries are participating to (Fig. 7). Instead, the access behavior to the identified academic literature still continue to prefer the library, through access to licensed digital resources. In some cases scholars even prefer to pay publishers for the needed item (Fig. 8). Other access tools include Google books and other specific bibliographical tools of the discipline, together with the preference of direct contact with author by mail or in presence. ","refs":[{"start":377,"end":378,"marker":"figure","target":null},{"start":611,"end":612,"marker":"figure","target":null}]}]},{"title":"Dissemination and Outreach","paragraphs":[{"text":"The infrastructure for the dissemination of the research results, seems to depend almost totally from the three academics favorite social media: Blog, Twitter, and Wikipedia (Fig. 9). The personal Web site and the site of the Department continue to be the only preferred institutional channels for this activity. ","refs":[{"start":180,"end":181,"marker":"figure","target":"#fig_6"}]}]},{"title":"Discussion","paragraphs":[{"text":"Trying to reply to the research objectives of the survey, the survey has given evidence:","refs":[]},{"text":"• to describe the digital scholarship growth in Italy,","refs":[]},{"text":"• the new types of digital objects, • how digital scholars afford Open Access and Open Science,","refs":[]},{"text":"• and how research data curation process is currently done.","refs":[]}]},{"title":"Digital Scholarship Growth","paragraphs":[{"text":"The findings have given a picture of the transformation of the scholarly communication in Italy, adapting to the Open Science paradigm, with clear trends very similar to the international innovation workflow. Evaluation of research results however is not changing and this is an organizational challenge in Italy.","refs":[]}]},{"title":"New Types of Digital Objects","paragraphs":[{"text":"Journals article and books remain the preferred typology of publications respectively in Science and Technology and in Humanities sectors. There are however also new channels of collaboration and dissemination such as Blog, Research Data repositories, personal and departmental website, academic social media.","refs":[]},{"text":"Disciplinar, contextual and individual differences need to be further researched.","refs":[]}]},{"title":"Research Data Curation Process","paragraphs":[{"text":"The infrastructure weakness for archiving and sharing research data seems evident, due to the digital libraries absence. Digital libraries will need a strong re-organization for participating to the new scholarly communication process.","refs":[]}]},{"title":"Copyright Issue","paragraphs":[{"text":"The Open Access and Open science movement does not seem to have much opposition among Italians scholars who participated in the survey, while it seems that there is a positive attitude for sharing research results, now carried out through tools like ResearchGate and Academia.edu.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"In conclusion, digital libraries are now absent from the digital scholarship workflow. The digital libraries' mission could be that of how different knowledge representations could be combined, queried, stored and re-used, in virtual collaborative spaces. From a more traditional concept of library they have to transform toward the vision of digital libraries integrated in the research workflow. The digital library concept could be that of virtual collaborative spaces, where different knowledge representations could be combined, queried, stored and re-used.","refs":[]},{"text":"Digital libraries have very many opportunities to participate in the transformation of scientific communication, and above all can bring added value to the communication of science and improve the impact of the research results obtained in their institutions. Further study could investigate the many opportunities of digital libraries to participate \"proactively\" in the transformation of scientific communication, and bringing added value to the scholarly communication, improving the impact of the research results achieved in their institutions.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"A profound change is happening in the world of scholarly communication, where the object of scientific communication is no longer a linear text, although digital, but a networked digital object-centered that consists of text, data, images, videos, blogs. This is stimulating the innovation of scholarly communication workflow also called \"Digital scholarship\". This change is likely to deeply modify the nature and the role of digital libraries and their relationship with the national research platforms (CRIS), thematic data center and other stakeholders. The paper presents the findings of a survey about the needs and practices of scholars in Italy, as part of the international Project 101 Innovations in Scholarly Communication. The impact of digital scholarship on digital libraries has to be understood and the digital libraries' mission could be that of how different knowledge representations could be combined, queried, stored and re-used, in virtual collaborative spaces.","refs":[]}]}}