{"bibliography":{"title":"Future trends in digital libraries and scientific communications","authors":[{"person_name":{"surname":"Appleton","first_name":"Gaby"},"affiliations":[{"department":"Elsevier BV","institution":null,"laboratory":null}],"email":null}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.004","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital","Trends","Communications","Library"],"citations":{},"sections":[{"title":"Growth in R&D spending drives number of researchers and research activity","paragraphs":[{"text":"Global expenditure on Research & Development (R&D) has consistently risen in real terms over many years. This includes both spending by companies and in academic and government institutions. This increase in spend has also resulted in an annual increase of nearly 3% in the number of researchers to almost 7 million (OECD), and a higher increase in the number of articles published of close to 6% in the period 2000 to 2012 (see Figure 1). ","refs":[{"start":436,"end":437,"marker":"figure","target":"#fig_0"}]}]},{"title":"In Italy, R&D spending growth is slower than global average, but Italy is a highly productive research nation","paragraphs":[{"text":"Expenditure on R&D in Italy has risen by a compound annual growth rate (CAGR) of 1.8% over the period 2000-13, which is slightly slower than average (source OECD, Elsevier analysis). The number of researchers has risen slightly faster than this at 2.7% from 2000-2012 (source: OECD, Elsevier analysis). However analysis of publications by Italian researchers shows that Italy is a highly productive research nation in line with the UK and Canada, and Italy's productivity is improving over time (see Figure 2). ","refs":[{"start":507,"end":508,"marker":"figure","target":"#fig_1"}]}]},{"title":"Open access has grown rapidly over the past decade but remains a small proportion of total articles published (7% in 2012)","paragraphs":[{"text":"A key trend in scientific publishing has been the emergence of several forms of open access publishing. Analysis based on Scopus shows that the so-called \"gold\" open access route, where authors pay a publication charge to cover the costs of publishing, has grown rapidly to reach 7% of all articles published by 2012. The dominant model remains therefore the subscription route to publication. The \"green\" route to open access, where authors can post a copy of their manuscript or pre-print, has also grown over the same period. Uptake of the green and gold routes varies significantly by discipline depending on researcher preferences and levels of funding in each discipline.","refs":[]}]},{"title":"Publishers have traditionally supported researchers in the publication process","paragraphs":[{"text":"Elsevier, like other publishers, invests in several areas to support researchers in disseminating the results of their research. Its role in the publication process includes facilitating and investing in peer review to improve research findings, enhancing research articles, providing access, and making them visible to readers, and guarding the integrity of research. Elsevier tends to publish more new articles every year, at steady or increasing overall levels of quality, as a result of the previously mentioned trend of increasing number of articles published globally. Elsevier also invests substantially in improving the functionality on its ScienceDirect platform in order to help researchers find the information they need.","refs":[]},{"text":"Furthermore publishers run a number of access programs to ensure researchers have access to high quality information, such as providing free ScienceDirect and Scopus access to reviewers, editors and post-docs, running Publishing Connect author training workshops, providing access for researchers in developing countries through Research4Life, and for patients through Patient Access programs.","refs":[]}]},{"title":"Key trends in research information","paragraphs":[{"text":"There are a number of key trends emerging in scientific communications that have implications not only for publishers but also for digital libraries. These include:","refs":[]},{"text":"• The increased importance of research objects other than the article, for example research data sets, or conference presentations. Considerable energy is being devoted by research funders to try to make data sets available for other researchers to use, while conference proceedings have become very important vehicles for communications in some disciplines such as computer sciences. Libraries can play a role in supporting researchers to meet funder requirements in areas such as data openness, as well as tracking and monitoring compliance with such requirements to support grant applications. • Use of multiple sources of data to improve analytics and tools. Elsevier has had some success with improving search results by using signals from multiple sources of information about the searcher and his or her context. One example is the recommendation engine on the Science Direct platform. Such tools can improve the value obtained from existing library spend on various information sources. Libraries themselves also sit on multiple sources of data about their institutions and can create value for their institutions by combining these -for example by linking up researcher profile data with institutional repositories to showcase researchers' work. • Use of supercomputers and big data techniques. The growing quantity of research information, together with information about user behavior, social network analysis, and other forms of data, can increasingly be processed using big data techniques to generate new insights and services to support researchers. An example of this is Elsevier's SciVal product which uses supercomputing and big data techniques to allow research managers to slice and dice in real time data about an institutions' performance compared to its peers. Secondly the increasingly computational nature of research is generating ever-larger data sets which need to be stored and analysed. In some institutions libraries are employing data scientists to work together with high performance computing centres and researchers to manage these growing datasets. • Wide variety of players and providers supporting researchers. Information provision to researchers used to be primarily the domain of traditional publishers. More recently, a wide variety of technology providers, internet","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Growth in R&D spending drives number of researchers and research activity. In Italy, R&D spending growth is slower than global average, but is Italy is a highly productive research nation. Key trends in research information include more articles published as a result of more R&D spend and more researchers; rapid growth of open access over the past decade but remaining a small proportion of total articles published (7% in 2012); increased importance of non-article research objects such as datasets; use of multiple sources of data to improve analytics and tools, supported by supercomputers and big data techniques. A wide variety of participants now support the researcher in his/her journey to create new knowledge","refs":[]}]}}