{"bibliography":{"title":"The EAGLE Europeana Network of Ancient Greek and Latin Epigraphy: A Technical Perspective","authors":[{"person_name":{"surname":"Mannocci","first_name":"Andrea"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A. Faedo\"","institution":"Consiglio Nazionale delle Ricerche","laboratory":null}],"email":"andrea.mannocci@isti.cnr.it"},{"person_name":{"surname":"Casarosa","first_name":"Vittore"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A. Faedo\"","institution":"Consiglio Nazionale delle Ricerche","laboratory":null}],"email":"vittore.casarosa@isti.cnr.it"},{"person_name":{"surname":"Manghi","first_name":"Paolo"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A. Faedo\"","institution":"Consiglio Nazionale delle Ricerche","laboratory":null}],"email":"paolo.manghi@isti.cnr.it"},{"person_name":{"surname":"Zoppi","first_name":"Franco"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"A. Faedo\"","institution":"Consiglio Nazionale delle Ricerche","laboratory":null}],"email":"franco.zoppi@isti.cnr.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1_8","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Data harmonization","Data infrastructure","D-net","Data interoperability","Aggregation system","Epigraphy","Metadata formats"],"citations":{"b0":{"title":"The EAGLE project","authors":[],"date":null,"ids":null,"target":"http://www.eagle-network.eu/","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"A conceptual model for inscriptions: harmonizing digital epigraphy data sources","authors":[{"person_name":{"surname":"Casarosa","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Manghi","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Mannocci","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Ruiz","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Zoppi","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2014","month":"10","day":"01"},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"D-NET Software Toolkit","authors":[],"date":null,"ids":null,"target":"http://www.d-net.research-infrastructures.eu","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"The D-NET software toolkit: a framework for the realization, maintenance, and operation of aggregative infrastructures","authors":[{"person_name":{"surname":"Manghi","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Artini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Atzori","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Bardi","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Mannocci","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"La Bruzzo","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.1108/PROG-08-2013-0045","arXiv":null},"target":null,"publisher":null,"journal":"EmeraldInsight Program","series":null,"scope":{"volume":48,"pages":{"from_page":322,"to_page":354}}},"b4":{"title":"The EAGLE aggregation infrastructure","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"The EAGLE Project","paragraphs":[{"text":"Ancient inscriptions are a valuable source of information about otherwise undocumented historical events and past laws and customs. However, centuries of unregulated collection by individuals and by different institutions has led to an extremely fractioned situation, where items of the same period or from the same geographical area are presently scattered across several different collections, very often in different cities or countries.","refs":[]},{"text":"One of the main motivations of the project EAGLE (Europeana network of Ancient Greek and Latin Epigraphy [1], a Best Practice Network partially funded by the European Commission) is to restore some unity of our past by collecting in a single repository information about the thousands of inscriptions now scattered across all Europe.","refs":[{"start":105,"end":108,"marker":"bibr","target":null}]},{"text":"The collected information (about 1,5 million digital objects at project's end, representing approximately 80 % of the total amount of classified inscriptions in the Mediterranean area) are to be ingested into Europeana, as they represent the origins of the European culture. That information is also made available to the scholarly community and to the general public, for research and cultural dissemination, through a user-friendly portal supporting advanced query and search capabilities.","refs":[]},{"text":"The EAGLE project comprises 19 partners from 13 European countries. Fifteen partners (called Content Providers) are cultural institutions owning collections of Latin and Greek inscriptions, and are the ones actually providing the data to EAGLE and to Europeana. Four partners (called the Technology Providers) are the ones in charge of setting up the aggregation infrastructure, connecting with Europeana, de-duplicating the received data (the same inscription can appear in the collections of more than one Content Provider) and developing the services available at the EAGLE portal.","refs":[]},{"text":"In addition to the \"normal\" query capabilities (full text search a la Google, fielded search, faceted search and filtering), the EAGLE portal supports two applications intended to make the fruition of the epigraphic material easier and more useful. The Mobile Application will enable a (mobile) user to get information about one visible epigraph by taking a picture with a mobile device, and sending it to the EAGLE portal specifying the recognition mode. In Exact Match mode, the EAGLE system will return all the information associated with the recognized image, or a message indicating that the image was not recognized. In Similarity Search mode, the EAGLE system will return a list of the most visually similar epigraphs, ranked in order of similarity.","refs":[]},{"text":"The Story Telling application will provide tools for an expert user (say a teacher) to assemble epigraphy-based narratives providing an introduction to themes and stories linking various inscriptions together (e.g. all the public works done by an emperor). The stories are then made available at the EAGLE portal, and are (usually) intended for the fruition of the epigraphic material by less knowledgeable users or young students.","refs":[]},{"text":"Along the same lines, in order to make the epigraphic material more interesting and usable also by non-epigraphists, EAGLE, in collaboration with the Italian chapter of the Wikimedia Foundation, is leading an effort for the enrichment of the epigraphic images and text with additional information and translations into modern languages. This additional material, residing on Wikimedia, is periodically harvested and included in the information associated with each epigraph.","refs":[]}]},{"title":"The EAGLE Aggregation Infrastructure","paragraphs":[{"text":"As mentioned before, EAGLE aggregates content provided from 15 different archives from all over Europe. While most of them are providing records based on EpiDoc (an application profile of TEI, today the de-facto standard for describing inscription), some archives are supplying records in \"personalized\" formats. EAGLE aggregates data also from two other different sources: Mediawiki pages, containing translations of inscriptions, and \"Trismegistos records\", containing information about inscriptions that appear in more than one collection.","refs":[]},{"text":"The need for expressing queries against such heterogeneous material has led to the definition of a data model being able of relating separate concepts and objects in a seamless way, thus allowing both the scholarly research and the general public to achieve results which could hardly be obtained with the existing EpiDoc archives.","refs":[]},{"text":"The EAGLE data model [2] consists of an abstract root entity (the Main Object) from which four sub-entities can be instantiated: (i) Artefact (capturing the physical nature of an epigraphy); (ii) Inscription (capturing the textual and semantic nature of a text region possibly present on an artefact); (iii) Visual representation (capturing the information related to the \"visual nature\" of a generic artefact); (iv) Documental manifestation (capturing the description of an inscription's text in its original language and its possible translations in modern languages). All the information to be aggregated in EAGLE will find its place into one or multiple instances of such sub-entities.","refs":[{"start":21,"end":24,"marker":"bibr","target":"#b1"}]},{"text":"The EAGLE Aggregation Infrastructure is built on top of the D-NET software [3], developed by ISTI-CNR in the course of its participation in a number of European projects. D-NET is an open source solution specifically devised for the construction and operation of customized infrastructures for data aggregation, which provides a service-oriented framework where data infrastructures can be built in a LEGO-like approach, by selecting and properly combining the required services [4]. For EAGLE, D-NET has been extended with image processing services to support the Mobile Application(see bottom of Fig. 1). The aggregation process consists of four main phases (see top of Fig. 1):","refs":[{"start":75,"end":78,"marker":"bibr","target":"#b2"},{"start":479,"end":482,"marker":"bibr","target":"#b3"},{"start":603,"end":604,"marker":"figure","target":null},{"start":677,"end":678,"marker":"figure","target":null}]},{"text":"1. Metadata mapping. The definition of the metadata mapping covers two key aspects:","refs":[]},{"text":"(i) a structural mapping from the archives' local schema to the EAGLE common schema and (ii) a semantic mapping from the local vocabularies to the EAGLE ones. In cooperation with domain experts from the archives providing records, the structural and semantic rules to map the incoming records into the EAGLE common metadata schema are encoded in the form of XSLT scripts. 2. Metadata transformation and cleaning. Metadata records are collected (via FTP, OAI-PMH or other protocols) and processed (using the transformations defined in phase 1) to generate the \"EAGLE objects\", thus creating the Pre-production Information Space. 3. Metadata quality control. The EAGLE records are inspected and validated to identify mapping errors and possible mistakes (e.g., typos). This quality control process may lead to the redefinition of the mapping rules (in Phase 1) and the repetition of Phase 2. 4. Metadata provisioning. The EAGLE records that pass Phase 3 are indexed and become available for querying and browsing through the EAGLE portal, or for ingestion to Europeana (after a further transformation to make them compliant with EDM, the Europeana Data Model) or for harvesting through standard APIs by other (external) applications.","refs":[]},{"text":"In D-NET, data processing is specified by defining workflows (i.e. a graph of elementary steps, with optional fork and join nodes) and meta-workflows (i.e. a sequence of workflows). A (meta)workflow can be easily configured, scheduled and started through a D-NET tool with a graphical user interface, while the implementation of the elementary steps is done by writing programs actually executing the needed","refs":[]},{"text":"The EAGLE Europeana Network of Ancient Greek and Latin Epigraphy processing. For example, the metaworkflow for processing EpiDoc documents consists of the sequence of the following workflows (where each workflow consists in a set of more elementary steps):","refs":[]},{"text":"• collect (records from an archive); • transform (the collected records into the EAGLE metadata format); • clean (metadata quality control); • index (build the index of the final records for querying and browsing); • provision (put the final records in the format required by an OAI-PMH harvester).","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The project EAGLE (Europeana network of Ancient Greek and Latin Epigraphy, a Best Practice Network partially funded by the European Commission) aims at aggregating epigraphic material provided by some 15 different epigraphic archives (about 80 % of the classified epigraphic material from the Mediterranean area) for ingestion to Europeana. The collected material will be made available also to the scholarly community and to the general public, for research and cultural dissemination. This paper briefly presents the main services provided by EAGLE and the challenges encountered for the aggregation of material coming from heterogeneous archives (different data models and metadata schemas, and exchange formats). EAGLE has defined a common data model for epigraphic information, into which data models from different archives can be optimally mapped. The data infrastructure is based on the D-NET software toolkit, capable of dealing with data collection, mapping, cleaning, indexing, and access provisioning through web portals or standard access protocols.","refs":[]}]}}