{"bibliography":{"title":"3D Average Common Submatrix Measure","authors":[{"person_name":{"surname":"Franco","first_name":"Federica"},"affiliations":[{"department":"DIMES","institution":"University of Calabria","laboratory":null}],"email":null},{"person_name":{"surname":"Amelio","first_name":"Alessia"},"affiliations":[{"department":"DIMES","institution":"University of Calabria","laboratory":null}],"email":"a.amelio@dimes.unical.it"},{"person_name":{"surname":"Greco","first_name":"Sergio"},"affiliations":[{"department":"DIMES","institution":"University of Calabria","laboratory":null}],"email":"s.greco@dimes.unical.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-39905-4_4","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Image similarity","Pattern matching","D objects"],"citations":{"b0":{"title":"Approximate matching in ACSM dissimilarity measure","authors":[{"person_name":{"surname":"Amelio","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":96,"pages":{"from_page":1479,"to_page":1488}}},"b1":{"title":"A new axiomatic methodology for the image similarity","authors":[{"person_name":{"surname":"Amelio","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Appl. Soft Comput","series":null,"scope":{"volume":81,"pages":{"from_page":105474,"to_page":105474}}},"b2":{"title":"Average common submatrix: a new image distance measure","authors":[{"person_name":{"surname":"Amelio","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Pizzuti","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-642-41181-6_18","arXiv":null},"target":"https://doi.org/10.1007/978-3-642-41181-6","publisher":"Springer","journal":null,"series":null,"scope":{"volume":8156,"pages":{"from_page":170,"to_page":180}}},"b3":{"title":"A patch-based measure for image dissimilarity","authors":[{"person_name":{"surname":"Amelio","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Pizzuti","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Neurocomputing","series":null,"scope":{"volume":171,"pages":{"from_page":362,"to_page":378}}},"b4":{"title":"CT image registration in acute stroke monitoring","authors":[{"person_name":{"surname":"Amelio","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Amelio","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2018","month":"05","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1527,"to_page":1532}}},"b5":{"title":"Content-based video retrieval","authors":[{"person_name":{"surname":"Gurrin","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":{"DOI":"10.1007/978-0-387-39940-9","arXiv":null},"target":"https://doi.org/10.1007/978-0-387-39940-9","publisher":"Springer","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":466,"to_page":473}}},"b6":{"title":"A survey on visual content-based video indexing and retrieval","authors":[{"person_name":{"surname":"Hu","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Xie","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Li","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Zeng","first_name":"X"},"affiliations":[],"email":null},{"person_name":{"surname":"Maybank","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IEEE Trans. Syst. Man Cybern. Part C (Appl. Rev.)","series":null,"scope":{"volume":41,"pages":{"from_page":797,"to_page":819}}},"b7":{"title":"Application potential of multimedia information retrieval","authors":[{"person_name":{"surname":"Kankanhalli","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Rui","first_name":"Y"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Proc. IEEE","series":null,"scope":{"volume":96,"pages":{"from_page":712,"to_page":720}}},"b8":{"title":"Graph matching networks for learning the similarity of graph structured objects","authors":[{"person_name":{"surname":"Li","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Gu","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Dullien","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Vinyals","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Kohli","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":"http://arxiv.org/abs/1904.12787","publisher":null,"journal":null,"series":null,"scope":null},"b9":{"title":"A survey on context based similarity techniques for image retrieval","authors":[{"person_name":{"surname":"Patel","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Gandhi","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2017","month":"02","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":219,"to_page":223}}},"b10":{"title":"Towards a better comprehension of similarity measures used in medical image registration","authors":[{"person_name":{"surname":"Roche","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Malandain","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Ayache","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Prima","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"1999","month":null,"day":null},"ids":{"DOI":"10.1007/10704282_60","arXiv":null},"target":"https://doi.org/10.1007/1070428260","publisher":"Springer","journal":null,"series":null,"scope":{"volume":1679,"pages":{"from_page":555,"to_page":566}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"In multimedia retrieval, a similarity measure is used on a digital library of 2D images, 3D objects of medical imaging, and other data for finding the k-most similar items to a query item. The problem of automatically computing the similarity in the context of the digital libraries is still challenging, due to the gap between the human perceived appearance of the data and their features which are captured by the machine (semantic gap) [10].","refs":[{"start":439,"end":443,"marker":"bibr","target":"#b9"}]},{"text":"In the last years, different approaches based on the concept of common sub-matrix have flourished for similarity computation in image retrieval tasks, whose advantages versus competing methods have been deeply investigated in the literature [1,2,4]. Specifically, [3] introduced the Average Common Submatrix (ACSM) measure for computing the similarity of images represented as matrices. ACSM computes the similarity between two images as the average area of the largest sub-matrices matching in the two images. A more efficient version of ACSM was proposed in [4] using a tree data structure for indexing the sub-matrices. To avoid the time and space requirements of constructing the tree index, [1] introduced an approximate version of ACSM, where the match between two sub-matrices is only verified for a portion of pixels at regular intervals, with any additional data structure. Finally, [2] framed ACSM within a new framework laying the theoretical foundations of the common sub-matrix concept and extending it. It noticeably reduced the temporal cost of computing the similarity without using additional data structures or omitting the match of a portion of pixels.","refs":[{"start":241,"end":244,"marker":"bibr","target":"#b0"},{"start":244,"end":246,"marker":"bibr","target":"#b1"},{"start":246,"end":247,"marker":"bibr","target":null},{"start":264,"end":267,"marker":"bibr","target":"#b2"},{"start":696,"end":699,"marker":"bibr","target":"#b0"},{"start":892,"end":895,"marker":"bibr","target":"#b1"}]},{"text":"The common sub-matrix -based methods have been introduced for 2D objects so far, thus making not possible their usage in multidimensional contexts, including video retrieval [6] where the semantic gap still remains an open problem, medical image registration [11], and extensions in the context of multidimensional network analysis [7][8][9]. Especially in medical image registration, the correct selection of a similarity measure is a key aspect for reliably monitoring the time evolution of a patient's state for critical pathologies (e.g. stroke lesions) [5].","refs":[{"start":174,"end":177,"marker":"bibr","target":"#b5"},{"start":259,"end":263,"marker":"bibr","target":"#b10"},{"start":332,"end":335,"marker":"bibr","target":"#b6"},{"start":335,"end":338,"marker":"bibr","target":"#b7"},{"start":338,"end":341,"marker":"bibr","target":"#b8"},{"start":558,"end":561,"marker":"bibr","target":"#b4"}]},{"text":"In this paper, we focus on extending the concept of common sub-matrix revisited in [2] for 3D objects, which is a brand new idea in the state-of-the-art. In particular, we provide the following contributions: (i) the ACSM measure is extended for objects in three dimensions, (ii) the match is verified in a neighbourhood of the objects, (iii) the match is approximate and computed in terms of the Hamming similarity extended in three dimensions. Accordingly, we aim to provide in progress results of our research.","refs":[{"start":83,"end":86,"marker":"bibr","target":"#b1"}]}]},{"title":"The Proposed Method","paragraphs":[{"text":"In this section, we present 3D Average Common Submatrix (3D-ACSM), a new similarity measure for 3D objects extending the revisited version of ACSM introduced in [2]. Specifically, we use this new measure for computing the similarity between data in three dimensions, which can be represented as parallelepipeds.","refs":[{"start":161,"end":164,"marker":"bibr","target":"#b1"}]}]},{"title":"3D Average Common Submatrix","paragraphs":[{"text":"Intuitively, let A, B and C be three parallelepipeds of volume v = n × p × m defined on the same alphabet Σ. Then, A can be considered as more similar to B than to C if the average volume of sub-cubes of A matching approximately in B is larger than the same average volume in C [5].","refs":[{"start":278,"end":281,"marker":"bibr","target":"#b4"}]},{"text":"More specifically, for each position (i, j, z) of A, 3D-ACSM finds the largest sub-cube in A starting at that position and with edge length greater than or equal to α approximately matching with a sub-cube in B within an ε-neighbourhood from (i, j, z). Restricting the area of search makes the similarity evaluation more efficient while it preserves the accuracy. The parameter α represents the minimum edge length of the sub-cubes to consider for the match. The parameter ε is related to the size of the neighbourhood with centre in (i, j, z) where a sub-cube can be found. Two sub-cubes approximately match to each other if the number of identical elements at the same positions exceeds or is equal to a given similarity threshold τ . From all aforementioned, 3D-ACSM between A and B is computed as follows:","refs":[]},{"text":"where W (i, j, z) is the volume of the largest sub-cube starting at position (i, j, z) in A of edge length greater than or equal to α approximately matching a subcube of B within an ε-neighbourhood from (i, j, z) in B.","refs":[]},{"text":"Algorithm 1. 3D-ACSM algorithm","refs":[]},{"text":"3: A value SN α (A, B) between 0 (minimum similarity) and 1 (maximum similarity) can be obtained as the ratio of S α (A, B) with S α (A, A), which is the similarity of A with itself.","refs":[]}]},{"title":"Algorithm","paragraphs":[{"text":"The Algorithm 1 shows the steps for computing the 3D-ACSM similarity between two parallelepipeds A and B, given the minimum edge length of the sub-cube α, the similarity threshold τ and the ε size of the neighborhood. We denote with A k i,j,z the sub-cube at position (i, j, z) in A whose edge length is k.","refs":[]},{"text":"Firstly, for each position (i, j, z) (lines 3-5), the algorithm computes the ideal matching at that position. This value, denoted by W α (A, A), is given by the volume of the maximal sub-cube matching itself, whose value is k 3 (line 7).","refs":[]},{"text":"The global match of parallelepipeds A and B is denoted by W α (A, B) and is computed by accumulating at each step the values of the matching between subcubes of A and B, respectively. In particular, at each step, the algorithm looks for the maximal sub-cube A k i,j,z in A, with size k and start position (i, j, z), having a match with a sub-cube of B, with size k and start position in a neighbourhood of position (i, j, z) of size ε (lines 8-15). To determine the maximal size of the sub-cube k, it starts with a maximal size k = min{i, j, z} and, at each step, if the matching value (computed by function matchApproximate) is not greater than or equal to a given threshold τ , decrements the size of the sub-cube k. If a feasible match is not found, the position (i, j, z) gives no contribution to W α (A, B).","refs":[]},{"text":"Finally, the ratio of W α (A, B) with W α (A, A) is returned (line 19). The core of Algorithm 1 is given by the method matchApproximate, which finds the match of a sub-cube A k i,j,z in B. The match is verified in a neighbourhood with centre at (i, j, z) in B and extent of ε hops along the three dimensions (where possible). Also, the match is approximate and resembles to the notion Table 1. CPU time of Algorithm 1 on the first dataset with m = {15, 20}. For ε = {1, 3}, Δα is the average absolute time difference between α = 3 and 1, and α = 5 and 3. For α = {1, 3, 5}, Δε is the average absolute time difference between ε = 3 and 1 of Hamming similarity [2] and its direct extension to 3D objects. Specifically, a match between two sub-cubes exists if their Hamming similarity (number of identical elements at the same positions) is greater than or equal to a threshold parameter τ , 0 ≤ τ ≤ 1.","refs":[{"start":391,"end":392,"marker":"table","target":null},{"start":659,"end":662,"marker":"bibr","target":"#b1"}]}]},{"title":"Experiments","paragraphs":[{"text":"Preliminary experiments have been conducted for testing the performances of 3D-ACSM on two different datasets. The experiments have been performed in Matlab R2017a on a computer laptop with CPU Quad-Core 2.30 GHz, 8 GB RAM and Windows 7 (64 bit) operating system. The first dataset includes a set of randomly generated numerical parallelepipeds of size n = p varying from 4 to 512 and depth m varying from 5 to 20 with steps of 5. The size of the alphabet |Σ| is set to 2. This dataset is used for testing the CPU time (in seconds) of Algorithm 1 at different values of the input parameters ε = {1, 3}, α = {1, 3, 5}, and τ = 0.5.","refs":[]},{"text":"The second dataset includes a set of synthetic parallelepipeds each composed of three greyscale illusory and colour miscellaneous images of size 128 × 128 (n = p = 128 and m = 3). The used images are extracted from the online database of the Computer Vision Group, University of Granada1 . They represent synthetic objects with frequent patterns and shapes useful for assessing the effectiveness of the similarity measure. The 3D-ACSM similarity is computed for each pair of parallelepipeds at different values of the input parameters ε = {1, 2, 3}, α = {1, 4, 8}, and τ = {0.5, 0.6, 0.7}. In the end, the obtained 3D-ACSM similarity is compared with the visual similarity, which is the similarity as perceived by the human eye.  ","refs":[{"start":286,"end":287,"marker":null,"target":"#foot_0"}]}]},{"title":"Results and Discussion","paragraphs":[{"text":"Table 1 reports the CPU time of Algorithm 1 on the first dataset of randomly generated numerical parallelepipeds with m = {15, 20}. It is worth noting that changing ε determines a higher time variation than changing α (the average absolute time difference Δ ε is higher than Δ α ), which confirms the need of restricting the match within a neighbourhood. Also, Fig. 1 shows the CPU time difference between ε = 3 and 1 for α = {1, 3, 5}. It is worth noting as the time difference increases when the 3D objects become larger (higher size n, p and depth m) regardless of the α value. It confirms that restricting the neighbourhood can be time-saving especially for large 3D objects for which the CPU time has the tendency to normally increase (see Table 1).","refs":[{"start":6,"end":7,"marker":"table","target":null},{"start":366,"end":367,"marker":"figure","target":null},{"start":751,"end":752,"marker":"table","target":null}]},{"text":"Finally, Table 2 reports the 3D-ACSM similarity values for three sample parallelepipeds from the second dataset (see Fig. 2). From a visual inspection, it can be observed that A is more similar to B than to C, since the first and second slices of A and B are exactly the same. From Table 2, it is worth noting that 3D-ACSM similarity is compliant with the human perception of similarity, since SN α (A, B) is higher than SN α (A, C) for all parameters' combinations. It confirms that reducing the neighbourhood size still obtains reliable results with the advantage of reducing the execution time.","refs":[{"start":15,"end":16,"marker":"table","target":null},{"start":122,"end":123,"marker":"figure","target":null},{"start":288,"end":289,"marker":"table","target":null}]}]},{"title":"Conclusions","paragraphs":[{"text":"This paper introduced the 3D-ACSM measure as an extension of the ACSM similarity measure for 3D objects. Preliminary experiments were presented as a part of an ongoing work employing 3D-ACSM in the medical context of CT images. In such a context, an efficient 3D similarity measure is required in the registration process for monitoring the correct evolution of a patient's state [5]. Also, a comparison of 3D-ACSM similarity is being performed with other state-of-the-art measures. Finally, the Matlab code of the project is going to be available in open source for the scientific community.","refs":[{"start":380,"end":383,"marker":"bibr","target":"#b4"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper introduces a new measure for computing the similarity among 3D objects as the average volume of the largest sub-cubes matching in the objects. The match is approximate and only verified within a neighbourhood from the position of the sub-cubes. Preliminary tests performed on random and synthetic datasets prove the efficacy of the similarity measure in capturing the visual similarity among the 3D objects and a reduction in the execution time when the neighbourhood is considered.","refs":[]}]}}