{"bibliography":{"title":"The Evaluation Approach of IPSA@CULTURA","authors":[{"person_name":{"surname":"Agosti","first_name":"Maristella"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"agosti@dei.unipd.it"},{"person_name":{"surname":"Manfioletti","first_name":"Marta"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"manfioletti@dei.unipd.it"},{"person_name":{"surname":"Orio","first_name":"Nicola"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"nicola.orio@unipd.it"},{"person_name":{"surname":"Ponchia","first_name":"Chiara"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"ponchiachiara1@gmail.com"},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"silvello@dei.unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Different categories of users","Ipsa digital collection","Case study","Digital cultural heritage","Cultura project"],"citations":{"b0":{"title":"IPSA: A Digital Archive of Herbals to Support Scientific Research","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":2911,"pages":{"from_page":253,"to_page":264}}},"b1":{"title":"User Requirements for Effective Access to Digital Archive of Manuscripts","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Multimedia","series":null,"scope":{"volume":7,"pages":{"from_page":217,"to_page":222}}},"b2":{"title":"Engaging the User: Elaboration and Execution of Trials with a Database of Illuminated Images","authors":[{"person_name":{"surname":"Ponchia","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":354,"pages":{"from_page":207,"to_page":215}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"A multidisciplinary team of the University of Padua, constituted by researchers in both Computer Science and Humanities, is currently involved in the European project CULTURA 1 , a STREP project that aims to involve and engage new user categories in Humanities digital collections through the development of new adaptive tools.","refs":[{"start":175,"end":176,"marker":null,"target":"#foot_0"}]},{"text":"The CULTURA project started in February 2011. In the first year efforts were mainly directed towards figuring out the best way of opening up a database developed specifically with highly specialized users in mind to new kinds of users with different levels of knowledge and interest in the collection. As a case study we used IPSA (Imaginum Patavinae Scientiae Archivum) 2 , an online digital archive of illuminated manuscripts created during a previous collaboration between the Department of Information Engineering and the Department for the History of Visual Arts and Music of the University of Padua [1]. The IPSA digital archive is accessible through a web application.","refs":[{"start":371,"end":372,"marker":null,"target":"#foot_1"},{"start":605,"end":608,"marker":"bibr","target":"#b0"}]}]},{"title":"Evaluation Approach","paragraphs":[{"text":"Right from the first year of the CULTURA project IPSA was evaluated by both professional researchers and students. Professional researchers were shown the system first and asked to interact freely with it, after which an interview was held addressing their particular research needs, wishes and preferences [2]. Evaluations with students were conducted in November and December 2011 with two different cohorts of students -both undergraduates and postgraduates -who were involved in two different trials. The students were asked to interact with the system in different ways for almost an hour. Afterwards, they were asked to give their feedback by filling in an online questionnaire specifically prepared by a team of psychologists from the University of Graz, a partner of the CULTURA project. The results of these evaluations were reported in [3].","refs":[{"start":307,"end":310,"marker":"bibr","target":"#b1"},{"start":846,"end":849,"marker":"bibr","target":"#b2"}]},{"text":"In the subsequent months other interactions were carried out, of various types and with different kinds of users, following a schema of loop-interaction, structured in a first phase of eliciting user requirements, then modifying the IPSA web application accordingly and subsequently evaluating the modifications made. Firstly, a reengineered version of the IPSA web application, improved according to the results of the November and December evaluations, was presented to a different cohort of students. Then IPSA was modified according to the feedback received from this evaluation and afterwards presented to a small group of professional researchers, involving both researchers already familiar with the system and researchers who interacted with IPSA for the very first time.","refs":[]},{"text":"Recently, part of the IPSA metadata has been integrated in the CULTURA environment, which offers users tools and functions different from those available in the IPSA web application. In December 2012 IPSA within CULTURA was evaluated by a new group of students. Similarly to the November and December 2011 evaluations these students were asked to interact with the system for a reasonable amount of time, and then they were asked to fill in an online questionnaire. The analysis of their feedback is still ongoing. Furthermore, we are also planning to extend the user categories involved in the evaluation of IPSA within CULTURA, and a number of trials with interested people belonging to the general public will be held during the last year of the project. Then it will be possible to compare user perceptions of a specialized digital archive modified to be suitable for new user categories and a system developed from the very beginning to address all kinds of users.","refs":[]}]},{"title":"Trial with Students","paragraphs":[{"text":"The IPSA trial with students was conducted in April 2012. It was developed specifically for a cohort of 25 postgraduate students in Management of Archival and Bibliographic Heritage and in Modern Languages, who were attending the course on Databases and Internet. We chose this sample because we thought that users with different fields of expertise are more likely to focus their attention on details that may not have been considered by Computer Scientists or Art Historians.","refs":[]},{"text":"The trial was divided in two parts, which took place within two weeks (2-16 April 2012). Students were asked to carry out a series of tasks which required them interact with the main functions of IPSA, such as establishing links between two images considered to be related in different ways (described as: copied in, not related to, same tradition of, sibling of, similar to). Notwithstanding the short timespan in which the two parts of the trial were carried out, we were able to collect students' feedback from the first part and immediately insert the requested changes in the system, thus making them ready for the second part of the evaluation. In this way, the users still remembered the previous issues of the system and were better able to assess the solutions proposed. For example, one of the issues in the first part of the trial was establishing a link between two images. In the previous version of the system, the creation of a link was barely intuitive. The user began with the image of interest and did a search to find a second image of interest. During the entire process, a box with the status of the operation was visible at the top of the page. Since finding the second image may require several searches and a certain amount of time, in the meantime users could forget with which image they had started. Following the observations of the students, this box was enlarged and (what is most useful) now includes the thumbnails of the selected starting-image, some helpful text and large, selfexplanatory buttons for completing the link or deleting the operation. The new way of creating a link was presented in the second part of the trial and it received positive feedback. Furthermore, students felt that their suggestions were effectively taken into account, and were more motivated to carry out the second part of the trial.","refs":[]},{"text":"One change in the interface between the first and the second trials involved the insertion of a drop-down menu at the bottom of the wall of images that allows for an intuitive search through all the illuminations contained in the manuscripts of interest.","refs":[]},{"text":"Another relevant change that we introduced between the two parts of the trial was the normalization of the plant names. The IPSA collection refers to old manuscripts and it is well known that in earlier times botanical names had no standard form. Moreover, the manuscripts held within the archive are written in different languages (Latin, Italian, Venetian dialect etc.), so it is not uncommon to find a number of variations in the name of the same plant. This is problematic, since such a variety entails difficulties in making consistent queries. Two major problems were addressed: spelling and lexical issues. In terms of spelling, graphic variants need to be aligned, i.e. what we call today absinth in English is found in IPSA as absinthium, absenço, abscinthium, and there is no explicit link between all these variants, even though they look similar to the human eye. By contrast lexical issues are even trickier than spelling issues as they need philological and linguistic research in order to be solved. For example, consider the plant today known in English as cucumber: within IPSA this plant is called citrollo in one manuscript and cogombaro in another. Human intervention is clearly needed to establish an explicit link between these two names, allowing users to find both in a single query. During the first evaluation session students used a system in which plant names were not normalized. This means they were unable to find images of the same plant within different manuscripts; in contrast, in the second session they experienced a system in which names had been standardized; in fact the original name was maintained and useful metadata were added to also keep track of the other name variants present in the archive. In this way students were able to appreciate the importance of having a standard nomenclature, which allows consistent and functional queries to be made.","refs":[]},{"text":"The feedback received from the trial clearly shows that the desire for a simplified way to set the link between two images reveals the need of nonprofessional users to be guided through such a specialist collection. This also emerged from the questionnaires they filled in.","refs":[]},{"text":"Another aspect to consider is that lack of confidence towards the collection also leads to the desire for a more collaborative environment in which users can share their opinions and reflections and benefit from expert users' help. Students would also like to be able to open their research from the collection to the web, in order to easily get more information for the purposes of their research.","refs":[]},{"text":"As we will see in the next section, many of the desires expressed by students match professional researchers needs for different reasons. Section 5 instead shows how the CULTURA environment addresses these requirements.","refs":[]}]},{"title":"Interaction with Professional Researchers","paragraphs":[{"text":"In the same way that different student groups were chosen for the evaluation, it was decided for the interaction with professional users to involve three researchers in History of Art specialized in different domains. Because IPSA was created expressly for specialists in History of Illumination, two of the professional users chosen for the interview were scholars expert in this research area, while the third was a researcher in History of Medieval Painting. The interviews took place in May 2012, so slightly after the evaluations with students, and were carried out on a group basis. The interaction was preceded by a short introduction, which aimed to present the results of the work done until then, especially the trial with the students. Particular emphasis was given to the fact that the students' suggestions had been immediately taken into account and that IPSA had been subsequently modified according to their feedback, to make the three interviewees aware of the importance of their opinions and suggestions and to spur open discussion. The new image search procedure in a manuscript catalogue file was introduced and how it works was explained: the user selects the image from the dropdown list -e.g. f. 11v, nux muscata -and then a wall of some 30 images which includes the searched-for image is shown an image wall containing the searched-for image is shown. The three interviewees were delighted with this function, but observed that the searched-for illumination -in this case, the nux muscata image -should be underlined in the results to make it easier to find, or it should be the first of the image wall. They also suggested improving the image wall by making it numerically smaller (approximately 20 images) with larger images. Indeed, images are the main research subject of Art Historians, which is why the main concern of experts in this field is to have a set of tools available that allow an in-depth analysis of images. The three interviewees were also shown another improvement made after the evaluation with the students: the new way of setting a link between two illuminations. The attention of the professional researchers was deeply focused on the image also in this case, and they asked to be able to zoom in on the illuminations while setting the link. This highlights once again professional user's need of image investigation tools. One important issue which arose during the discussion was the need for a more collaborative environment. In particular, professional researchers would like to be able to create one or more personal folders, to save the results of their queries and searches and to decide which results can be seen by other users and by which user. Such a tool could be used by different research groups, and for teaching purposes as well. It can be seen how this particular element matches the students' need for a collaborative environment where they can be helped by experts in the domain. One useful teaching tool would be the possibility of bookmarking images, so that lecturers could bookmark the images shown in their lectures and students could then find them easily in the digital archive.","refs":[]},{"text":"Professional researchers also expressed the desire for links to other websites, in order to offer the user quick access to different resources that could improve their research, another requirement that matches students' needs.","refs":[]}]},{"title":"5","paragraphs":[{"text":"Evaluation of IPSA within the CULTURA Environment","refs":[]},{"text":"Between May and October 2012 a subset of metadata from IPSA was imported into the CULTURA environment for use as a case study to test the new environment and its functions. The first evaluation of the new system was carried out on 11 December with a group of postgraduate students both of Linguistics and Communications Theories. Students were asked to interact with the system for approximately one hour, accomplishing some easy tasks that made them interact with most of the CULTURA tools: advanced search, annotations, bookmarks, two different kinds of visualization (called \"wheel\" and \"octopus\", see Fig. 1) that show the connections between the image of interest and other elements held in the database, and links to other websites Fig. 1. Wheel visualization in the CULTURA Environment (Wikipedia, Google, Bing). The task was structured as follows. Firstly, each student was assigned a plant name and had to search for the image of that plant, and then annotate it. Annotations can be made in two different ways: by creating a note or by directly annotating a portion of the illumination. Students were asked to use both the tools, and possibly to bookmark the image. Afterwards, they had to choose one of the two possible visualizations which allow the user to see all the different relations that the image has in the database, e.g. in which manuscript it is held, or who the illuminator that painted it is. In this case, students were asked to find other manuscripts in which the same plant is represented. By doing so, they found at least another illumination of the same plant, which they were asked to annotate.","refs":[{"start":610,"end":611,"marker":"figure","target":null},{"start":743,"end":744,"marker":"figure","target":null}]}]},{"title":"Conclusions","paragraphs":[{"text":"As the new evaluation trials are still an on-going process, it is not currently possible to analyse users' feedback about the CULTURA environment. Nonetheless, some considerations can still be made.","refs":[]},{"text":"First of all, it must be considered that the CULTURA environment offers users a wide range of tools that provide an easy and engaging approach to the collection and that address the users requirements elicited in the interactions described above. For example, professional researchers, who are mainly interested in analysing the images, are enabled to annotate images of interest in two different ways: by creating a note or by directly annotating a part of the image, e.g. a detail painted with great skill.","refs":[]},{"text":"The user can choose to keep the annotation private or to make it public. Clearly this matches both students' and professional researchers' needs: a professor in History of Illumination can annotate images with his observations and thoughts, and annotations can be an effective tool to involve students in the research process of professional users', making it extremely clear to them how an expert in the field proceeds in approaching the images.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper reports on the original approach envisaged for the evaluation of a digital archive accessible through a Web application, in its transition from an isolated archive to an archive fully immersed in a new adaptive environment.","refs":[]}]}}