{"bibliography":{"title":"Evaluating Cultural Heritage Information Access Systems (Panel)","authors":[{"person_name":{"surname":"Catarci","first_name":"Tiziana"},"affiliations":[{"department":null,"institution":"Sapienza Università di Roma","laboratory":null}],"email":null},{"person_name":{"surname":"Guercio","first_name":"Maria"},"affiliations":[{"department":null,"institution":"Sapienza Università di Roma","laboratory":null}],"email":"maria.guercio@uniroma1.it"},{"person_name":{"surname":"Santucci","first_name":"Giuseppe"},"affiliations":[{"department":null,"institution":"Sapienza Università di Roma","laboratory":null}],"email":"santucci@dis.uniroma1.it"},{"person_name":{"surname":"Tomasi","first_name":"Francesca"},"affiliations":[{"department":null,"institution":"University of Bologna","laboratory":null}],"email":"francesca.tomasi@unibo.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"Visual analytics: Definition, process, and challenges","authors":[{"person_name":{"surname":"Keim","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Andrienko","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Fekete","first_name":"J.-D"},"affiliations":[],"email":null},{"person_name":{"surname":"Görg","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Kohlhammer","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Melançon","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":4950,"pages":{"from_page":154,"to_page":175}}},"b1":{"title":"The eyes have it: a task by data type taxonomy for information visualizations","authors":[{"person_name":{"surname":"Shneiderman","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"1996","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":336,"to_page":343}}},"b2":{"title":"Visual analytics challenges","authors":[{"person_name":{"surname":"Keim","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Kohlhammer","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Santucci","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Mansmann","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Wanner","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Schaefer","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Humanities computing as digital humanities","authors":[{"person_name":{"surname":"Svensson","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Digital Humanities Quarterly","series":null,"scope":null},"b4":{"title":"Evaluation of digital libraries","authors":[{"person_name":{"surname":"Fuhr","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Tsakonas","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Aalberg","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Hansen","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Kapidakis","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Klas","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Kovács","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Landoni","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Micsik","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal on Digital Libraries","series":null,"scope":{"volume":8,"pages":{"from_page":21,"to_page":38}}},"b5":{"title":"The organization of information","authors":[{"person_name":{"surname":"Taylor","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Joudrey","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Libraries Unlimited","journal":null,"series":null,"scope":null},"b6":{"title":"Palimpsestes","authors":[{"person_name":{"surname":"Genette","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"1982","month":null,"day":null},"ids":null,"target":null,"publisher":"Seuil","journal":null,"series":null,"scope":null},"b7":{"title":"The need for a faceted classification as the basis of all methods of information retrieval","authors":[{"person_name":{"surname":"Broughton","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":"Emerald Group Publishing Limited","journal":null,"series":null,"scope":{"volume":58,"pages":{"from_page":49,"to_page":72}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"IRCDL 1 is a yearly deadline for Italian researchers on Digital Libraries related topics. This year the focus of IRCDL 2013 was on emphasizing the multidisciplinary nature of the research on digital libraries which not only goes from humanities to computer science but also crosses among areas in the same field ranging, for example, from archival to librarian sciences or from information systems to human-computer interaction.","refs":[]},{"text":"The panel on \"Evaluating Cultural Heritage Information Access Systems\" was also characterized by this interdisciplinary flavour. Indeed, the panelists reflected the perspective of different fields, ranging from computer science (Prof. Giuseppe Santucci), to archival and librarian sciences (Prof. Mariella Guercio and Dott. Maurizio Messina) and digital humanities (Dott.ssa Francesca Tomasi).","refs":[]},{"text":"It is evident that in these last years there is a growing and persistent demand for more and more digital content in many different areas and for diverse purposes, with a particular emphasis in the cultural heritage sector. Typically, raw digital content is assembled in digital collections, but only the curation and enrichment of the raw material make it usefully available for working with it and exploiting it, and this subsequent embellishment phase is carried out in digital libraries. Digital libraries basically consist of large digital collections plus a set of tools that make content alive, that help the users to find it, make sense out of it, annotate it, comment it, share it in a community, collaborate on it, and so on. Thus, the evaluation of digital libraries and information access systems has to consider not only the quality of the digital collections and the preservation approach, but also the effectiveness and efficacy of the user-oriented tools they provide, in an overall user experience, having the ultimate goal of creating new knowledge.","refs":[]},{"text":"Following the above idea, the panelists were presented with four specific topics:","refs":[]},{"text":"-Cultural Heritage Information Access System vs Digital Library: similarities and differences ","refs":[]}]},{"title":"A Contribution from the Archival Domain","paragraphs":[{"text":"The presentation has focussed the attention to only one specific aspect of the complex issues under discussion in the panel: the capacity of representing the archival cultural heritage when the representation has to be included as part of a large and multidisciplinary digital library. In particular the presentation has analysed the challenges which always emerge when a cross-domain heritage is involved and variegated and rich contexts and provenance have to be described and, even more, rendered in large web environments. This aspect have been considered from the perspective of the archival heritage and its main (and not avoidable) complexity but, as mentioned, the presentation has not underestimated the general need for cultural heritage collections (of any kind) to be represented and made available within their original structure and relations.","refs":[]},{"text":"From this point of view, the archival attention for the provenance and the contextual information can provide a fruitful methodology for future qualified solutions, for a better structured information representation and for a higher degree of intelligibility of the digital resources made available on the web. As discussed in the panel, the limits of the present evolution is partially due to the lack of participation of digital curators other than librarians in the processes related to the communication processes of digital heritage: the archivists but also the professionals active in the cultural heritage sector have not realized the strategic relevance of this cooperation and have not sufficiently contributed to the definition of a more comprehensive integrated approach to the digitization process and to the interoperability of descriptive metadata. The consequences of this absence have been: too granular and flat solutions, no capacity of collecting relations and supporting contexts and provenance information, a very limited number of innovative proposals in the field. Among others, the presentation has discussed:","refs":[]},{"text":"the key questions still unsolved for defining the quality of a digital library according to the DELOS requirements like a not yet well defined assessment framework, the lack of attention for an efficient capacity of retrieving and managing digital library contents when peculiar representations and information structures have to be supported, the limits of the available solutions to support the complex translation into the web of archival finding aids systems and resources with reference to their uniqueness and to the complexity of their reciprocal relations (strategic for making them understandable), but also in consideration of the massive volumes (approximately 8000 km in Italy of unique resources) which limit the role of the digitization process in this area (the finding aids system will necessarily focus, at least for the next decade, on analogue records to be accessed in the traditional reference services and only few resources will have the \"privilege\" to be digitized), the risk of fragmentation and arbitrary criteria for selection: the thematic approach generally supported by the digital library environment can be useful for attracting users but not for providing qualified and inclusive services to the scientific communities and to the citizens needs, the ambiguity of the concepts involved which has prevented the archival sector by using even the terms involved in this new environments: archival websites or archival information systems are the preferred terms and the preferred scenarios for developing services and functionality, while the term digital library is at the moment rarely used for proposing online publication of digital archival resources in dedicated environments.","refs":[]},{"text":"For providing concrete and technical elements for a more detailed analysis, the presentation had considered best research projects and, if possible, good practices already available at national level to sustain future cooperation in this field (just as examples of promising services for future development and a more comprehensive analysis). They have included the following cases:","refs":[]},{"text":"-SIAR (Sistema informativo archivistico regionale del Veneto), created with the aim of integrating distributed archives by using both standards, methodology and tools developed for digital libraries and for specific domain, but also for exchanging or sharing metadata, even if, at the moment, the integration for research services is not explicit and the catalogues are maintained separate, -Biblioteca digitale della Lombardia, whose aim is the digitization and online publication of cross-domain cultural resources able to testify the regional cultural heritage and whose basic requirements are: the acquisition and online availability (through a regional web portal) of significant resources of regional culture, the integration of resources preserved and created in different environment, including archival documents, the capacity of ensuring the long-term preservation of digital resources, in compliance with the main standards and in cooperation with the main national and international projects (Europeana, CulturaItalia and Sistema archivis-tico nazionale), -Sapienza Digital Library, whose ambitious goals are: The critical state of art of the Italian projects has been also briefly examined and some conclusions made, as here summarized:","refs":[]},{"text":"provenance and context are not always identified as crucial components; archival standards are recognized for their general value, but not yet completely implemented outside the archival information systems, compliance with European standards is generally stated and partially ensured but mainly as a static and flat model for representation, the main difficulties concern: the differentiation of digital resources (many projects are limited to the identification of single resources and have developed simple research interfaces), the low level of integration and cooperation among institutions both at regional and at national level and of course and the lack of financial resources the integration (and not convergence) among heterogeneous cultural information access systems is here the key term, but a balance is required between specificity, details and general perspective: the functionality for retrieval must be easy to use but not trivial and new forms for intermediation are required (particularly when digital resources are complex and articulated).","refs":[]}]},{"title":"Evaluating Cultural Heritage Information Access Systems through Visual Analytics","paragraphs":[{"text":"The evaluation of an Information Access System is a non trivial task and several research activities focus on supporting it (see, e.g., Participative Research labOratory for Multimedia and Multilingual Information Systems Evaluation (PROMISE)). Different systematic methodologies and techniques are used in such a context and all of them share a common outcome: they produce a lot of complex data, whose interpretation is a challenging activity by itself. Lessons learned point out some key areas that can improve the overall process:","refs":[]},{"text":"-Building a community focused on common objectives: that allows for better shaping methodologies and techniques, sharing ideas, experiences, and test cases. Moreover that allows for a sound and productive comparison of evaluation results; -Using a robust infrastructure: computer support is mandatory for managing and providing access to the scientific data produced during evaluation activities, with the final goal of supporting the organization and the execution of evaluation activities, increasing the automation in the evaluation process;","refs":[]},{"text":"-Visualizations: suitable visual analysis can foster and improve the usage and the interpretation of the managed evaluation data. Visualizations must be integrated in the system and an overall methodology like Visual Analytics (VA) is needed.","refs":[]},{"text":"VA [1] is an emerging multi-disciplinary area that takes into account both adhoc and classical Data Mining (DM) algorithms and Information Visualization IV (IV) techniques, combining the strengths of human and electronic data processing. Visualisation becomes the medium of a semi-automated analytical process, where human beings and machines cooperate using their respective distinct capabilities for the most effective results. Decisions on which direction analysis should take in order to accomplish a certain task are left to the user. Although IV techniques have been extensively explored [2], combining them with automated data analysis for specific application domains is still a challenging activity [3].","refs":[{"start":3,"end":6,"marker":"bibr","target":"#b0"},{"start":594,"end":597,"marker":"bibr","target":"#b1"},{"start":708,"end":711,"marker":"bibr","target":"#b2"}]},{"text":"In order to apply VA techniques to Cultural Heritage Information Access Systems (CHIAS) evaluation, improving the visualizations, analysis, and interpretation of experimental data, it is mandatory to understand the structure of the data that are actually used for evaluation purposes. A full discussion of this aspect is out of the scope of this panel. Here we report some results coming from the PROMISE NoE project, whose experimental datasets rely on the idea of evaluation campaigns and have a quite broad validity.","refs":[]},{"text":"An evaluation campaign provides large test collections (like multimedia, multilingual, text, images), specifying a set of topics and a relevance assessment.","refs":[]},{"text":"Participants evaluates their searching algorithm(s) (i.e., experiments) against a specific collection, producing a (ranked) result set on which different metrics are computed and stored. These data can be represented by the TME (Topics-Metrics-Experiment) cube shown on Figure 1.","refs":[{"start":277,"end":278,"marker":"figure","target":"#fig_0"}]},{"text":"Starting from this cube, it is possible to aggregate or manipulate data in different ways, according to different evaluation needs that, roughly speaking,  According to these two evaluation analysis patterns a VA prototype has been developed within PROMISE, implementing two visual analysis patterns, namely Per topic analysis and Per experiment analysis. In the following we describe such a prototype to provide a practical example of how a suitable visual analysis can foster and improve the usage and the interpretation of the managed evaluation data. Per topic analysis Per topic analysis allows for comparing a set of search engines on each topic with respect to a chosen metric. Therefore the first step for an evaluator is to choose a metric m and, because the analysis implies a comparison on each topic, we represent topics on the x-axis in each available visualization. We foresee four coordinated visualizations: a table, a boxplot chart, a bi-dimensional scatter plot, and a stacked bar chart. The evaluator can change the metric under analysis and restrict his or her focus on data subsets. As an example, Figure 3 shows three topics highlighted in all the four visualizations.","refs":[{"start":1126,"end":1127,"marker":"figure","target":"#fig_2"}]},{"text":"Per experiment analysis Per experiment analysis allows for analyzing a search engine as a whole and/or comparing the performances of a set of search engines with respect to a chosen descriptive statistics. As an example, on Figure 4, left side, the table chart represents a search engine in each row, showing the descriptive statistics of the metric average precision (min, max, median, etc.). The box plot chart on Figure 4, right side, shows the percentile values of the observed metric for each experiment represented through boxplots.","refs":[{"start":231,"end":232,"marker":"figure","target":"#fig_3"},{"start":423,"end":424,"marker":"figure","target":"#fig_3"}]},{"text":"Summarizing, we have introduced VA, a new, challenging metodology for analyzing large and complex dataset showing how apply it in the context of the evaluation of CHIAS, dealing with data structure and visualization requirements. We have used the European NoE PROMISE and the Cross-Language Evaluation Forum (CLEF) conference series as bed tests, but the ideas and the results presented in this panel have a quite broader scope. DH is a label that only recently started to identify a field historically known as \"humanities computing\" or \"humanities computer science\"; that is \"computing\" was replaced with digital. This terminological shift [4] corresponds to a new method of thinking about cultural objects as resulting from media integration. We assisted to the migration from a text-based computability process (i.e. markup languages, vocabularies and schemas like TEI, text analysis, text mining, text processing) to a process of representation and description of each informational resource in a social dimension (images, audio and video and their integration in computational systems for information retrieval/extraction/mining).","refs":[{"start":642,"end":645,"marker":"bibr","target":"#b3"}]},{"text":"The purpose of DH is conceptualization, modelization, formalization of humanistic data/content (that is the domain); the goal of DH is to define methods and develop strategies of domain representation in order to computability. In this perspective the Cultural Heritage (CH) is a multimedia humanistic domain that requires to deal with formats and data types, to manage metadata and controlled vocabularies, to define procedures regarding these data selection and dissemination. The information access system, instead, is connected to Digital Library (DL) and regards the choice of the infrastructure, the definition of the services offered, the digital objects (in this case deriving from the CH domain) and the final users [5].","refs":[{"start":725,"end":728,"marker":"bibr","target":"#b4"}]},{"text":"In this scenario, DH is procedure of modeling heterogeneous data, that is of managing information organization methods [6], in order to produce complex digital objects with the aim to acquire knowledge. This means that DH works by abstraction, enucleating the hermeneutical pertinent elements of a collection, for what concerns the computational objectives; this abstraction requires then to reflect on the data model and finally on the information architecture, i.e. user access/interface and user needs.","refs":[{"start":119,"end":122,"marker":"bibr","target":"#b5"}]},{"text":"In this context the user has a crucial role. A good data model potentially allows a good user access. Reading, browsing, tagging, query are examples of services offered by the DL; they depend both on the modelization at information system level and, consequently, the DL access criteria. The browsing method is one of the main evaluation methods of a CH information access system. In particular, browsing by relationships is an essential issue. It depends on both the data model and the user access. The data model, that is the ontological representation of the domain, is fundamental, because semantic relationships constitute the most exhaustive exploration method. Different levels of relationships, semantically declared, could be established: lexical networks (hyponyms; hyperonyms; synonyms; meronyms; related terms), structural connections (intertext, paratext, hypertext, architext, metatext, following the Genette classification [7]), concepts and topics (overlapping meanings, discipline and the object of study, persons and occupations, products and institutions). A good CH information system has to provide methods for acquiring knowledge through browsing concepts explicitly related at a certain level. The user access finds a method of exploration of the modeled collection by a \"faceted navigation\" [8]. Facets represent classes and the data filtering is expression of the predicates. The data model could find a classification output through facets, that control heterogeneous data expressed by different media.","refs":[{"start":938,"end":941,"marker":"bibr","target":"#b6"},{"start":1315,"end":1318,"marker":"bibr","target":"#b7"}]},{"text":"One last consideration. Both the data model and the facets are expression of a specific point of view. The interpretation of the collection not only determines the user satisfaction but also fulfills the user needs. User log is a gold mine useful to understand effectiveness and efficiency of an information system both at data model level as well as at navigation behavior level.","refs":[]}]}],"tables":{"tab_2":{"heading":"4 Modeling Heterogeneous Humanistic Data in a User-Oriented Perspective The","description":"primary step in the evaluation of a cultural heritage information access system from a digital humanist researchers point of view, consists in state clear what Digital Humanities (DH) is. DH is the name given to the alliance between associations involved in the study of relations between humanities and computer science (ADHO (Alliance of Digital Humanities Organizations); DH is a word referring to the main conference 2 in the field; DH is a open-access peer-reviewed electronic journal (Digital Humanities Quarterly 3 ); DH is the title of publications, centers, blogs, projects and tools (see the \"guide to digital humanities & arts\" 4 ).","rows":[]}},"abstract":{"title":"Abstract","paragraphs":[]}}