{"bibliography":{"title":"Political Roles Ontology (PRoles): enhancing archival authority records through Semantic Web technologies","authors":[{"person_name":{"surname":"Daquino","first_name":"Marilena"},"affiliations":[{"department":"Department of History and Cultures","institution":"University of Bologna","laboratory":null}],"email":null},{"person_name":{"surname":"Peroni","first_name":"Silvio"},"affiliations":[{"department":"Department of Computer Science and Engineering","institution":"University of Bologna","laboratory":null},{"department":"Institute of Cognitive Sciences and Technologies","institution":"Consiglio Nazionale delle Ricerche","laboratory":"STLab"}],"email":null},{"person_name":{"surname":"Tomasi","first_name":"Francesca"},"affiliations":[{"department":"Department of Classical Philology and Italian Studies","institution":"University of Bologna","laboratory":null}],"email":"francesca.tomasi@unibo.it"},{"person_name":{"surname":"Vitali","first_name":"Fabio"},"affiliations":[{"department":"Department of Computer Science and Engineering","institution":"University of Bologna","laboratory":null}],"email":null}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.012","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Eac(cpf) ontology","Isdf","Pro","Provenance","Prov-o","N-ary participation ontology pattern"],"citations":{"b0":{"title":"Authority control in organizing and accessing information: definition and international experience","authors":[{"person_name":{"surname":"Taylor","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Tillett","first_name":"B"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"","authors":[{"person_name":{"surname":"Binghamton","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Haworth Information Press","journal":null,"series":null,"scope":null},"b2":{"title":"EAC-CPF Ontology and Linked Archival Data","authors":[{"person_name":{"surname":"Mazzini","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Ricci","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://ceur-ws.org/Vol-801/","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"OWL 2 Web Ontology Language: Structural Specification and Functional-Style Syntax","authors":[{"person_name":{"surname":"Motik","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Patel-Schneider","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Parsia","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"World Wide Web Consortium","journal":null,"series":null,"scope":null},"b4":{"title":"Scholarly publishing and the Linked Data: describing roles, statuses, temporal and contextual extents","authors":[{"person_name":{"surname":"Peroni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Shotton","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Vitali","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":9,"to_page":16}}},"b5":{"title":"Faceted documents: describing document characteristics using semantic lenses","authors":[{"person_name":{"surname":"Peroni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Shotton","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Vitali","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":191,"to_page":194}}},"b6":{"title":"Reflecting on the Europeana Data Model","authors":[{"person_name":{"surname":"Peroni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Tomasi","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vitali","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":354,"pages":{"from_page":228,"to_page":240}}},"b7":{"title":"Semantic lenses as exploration method for scholarly articles","authors":[{"person_name":{"surname":"Peroni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Tomasi","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vitali","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Zingoni","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":385,"pages":{"from_page":118,"to_page":129}}},"b8":{"title":"The aggregation of heterogeneous metadata in Web-based cultural heritage collections","authors":[{"person_name":{"surname":"Peroni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Tomasi","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vitali","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Int Journal of Web Engineering and Technology","series":null,"scope":{"volume":8,"pages":{"from_page":412,"to_page":432}}},"b9":{"title":"Digital editions as a new model of conceptual authority data","authors":[{"person_name":{"surname":"Tomasi","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"JLIS.it","series":null,"scope":{"volume":4,"pages":{"from_page":21,"to_page":44}}},"b10":{"title":"Collaborative annotations in shared environments: metadata, vocabularies and techniques in the digital humanities (DH-CASE","authors":[{"person_name":{"surname":"Tomasi","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vitali","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1,"to_page":113}}},"b11":{"title":"International Standard for Describing Functions (ISDF)","authors":[],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":"http://www.ica.org/10208/standards/isdf-international-standard-for-describing-functions.html","publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Frammenti semantici. Riflessioni su descrizioni archivistiche e web semantico: il caso dell'archivio Giovanni Testori","authors":[{"person_name":{"surname":"Vassallo","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"https://github.com/svassallo/EAC-F/blob/master/eac-f.rng","publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"Linked archival authority data. Una sperimentazione sui linked open data del sistema informativo regionale IBC Archivi","authors":[{"person_name":{"surname":"Mazzini","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Ricci","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2011","month":"08","day":"26"},"ids":null,"target":"http://digitalia.sbn.it/article/view/484/334","publisher":null,"journal":"DigItalia","series":null,"scope":{"volume":6,"pages":{"from_page":144,"to_page":149}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Among the activities in the archival domain, reflecting on the 'authority control' principle 1 is a charming field of study. Archival authority records move from the consideration that each 'entity' involved in archival collections -e.g., a Corporate body, a Person, or a Family (CPF) -has to be managed according to a standard model. The International Standard Archival Authority Record for Corporate Bodies, Persons and Families or ISAAR(CPF) -http://www.ica.org/ 10203/standards/isaar-cpf-international-standard-archival-authority-record-for-corporate-bodies-persons-and-families-2nd-edition.html -, has been adopted as a standard by the Committee on Descriptive Standards since 2003. This model is based on the assumption that such Corporate body, Person or Family (CPF from now on) -i.e., the entity being described by the authority record -is a multi-faceted object, that has to be: • uniquely identified, in order to establish a common access point for the record of the document; • described, providing information about its nature, context and activities;","refs":[{"start":93,"end":94,"marker":"bibr","target":"#b0"}]},{"text":"• related to other entities and documents as appropriate;","refs":[]},{"text":"• validated for what regards the organisation or individual that created the authority record (the 'provenance' principle).","refs":[]},{"text":"The ISAAR(CPF) standard had been represented as an XML schema by the Encoded Archival Context (Corporate Bodies, Persons, and Families), or EAC(CPF) -http://eac.staatsbibliothek-berlin.de -and subsequently as an OWL ontology 3 . Although both the EAC(CPF) schema and the ontology follow the ISAAR(CPF) principles for the creation of archival authority records, a detailed reflection on some aspects of the EAC(CPF) ontology is needed, in particular according to other models developed in different domains. For instance, the descriptions of roles that CPFs have with respect to documents is an important aspect. Similarly, the identification of the roles held by particular individuals in the context of certain documents is of interest. Carrying on this stream of thought, the link between the particular individuals and the texts that talk about them requires also a reflection on the concept of event, intended as something that happens in a precise interval and place, during which the individual happened to have a certain role. For instance, we might want to describe that in the context of (or, as narrated by) a certain document (e.g., the Italian Wikipedia article about Andrea Costa) a particular individual (e.g., Andrea Costa) held a specific role (e.g., was an anarchist) within a specific event (e.g., during the insurrection of anarchists in Imola in 1874). According to this analysis, the usual archival approach for creating authority records could be expanded by allowing CPFs to be characterised as actors having different roles with respect to the documents contained in the archive, as ascertained through the analysis of agency, intended here as being an agent, i.e., being an occurrence of an individual within a document, and the related roles as can be mined from full-text sources.","refs":[{"start":225,"end":226,"marker":"bibr","target":"#b3"}]},{"text":"In this paper, we would like to define a model that takes into account the following scenarios: • there is a relationship between an agent and the role that the agent holds;","refs":[]},{"text":"• each role is identified uniquely and a taxonomy of typologies is defined;","refs":[]},{"text":"• the agent-role relationship is characterised by a time interval, (including open and unbounded intervals) and an applicability context; • the agent-role relationship can be linked to related events that happened in a certain time interval and geographical place; • the agent-role relationship and the description of the related events have a meta-context of provenance data, composed of the document that attests these relationships and/or events and of the actor that harvests this information from the text itself.","refs":[]},{"text":"Applying this model to traditional approaches on authority records allows one to verify and enrich them bringing to light new kinds of relationship between the resources involved.","refs":[]},{"text":"An ontological formalisation of the aforementioned model requires a careful use of Semantic Web technologies. By means of such technologies, any information about CFPs, roles, events, and related resources can be expressed with precise ontological assertions and released as Linked Open Data. This enables the navigation of archival authority records in more expressive, interlinked and dynamic ways than by simply considering the assertions within the mere authority record (i.e., without looking at the outside Web information).","refs":[]},{"text":"In the past, several works tried to address this issue in the context of the archival domain. For instance, the ReLoad project (Repository for Linked Open Archival Data: http://labs.regesta.com/progettoReload) provides a set of ontologies for describing archival environment: however, while the OAD Ontology (Ontology of Archival Description: http://labs.regesta.com/progettoReload/oad-ontology/) sophisticatedly represents levels of description on archival materials and the OCSA Ontology (Ontology of Cultural Organizations' Services and Access: http://labs.regesta.com/ progettoReload/wp-content/uploads/2013/08/ocsa.html) supplies good information about cultural organizations, the EAC(CPF) Ontology does not model adequately the role of CPFs involved in archival materials -which in our view is the core of a network of relations connecting all elements (authority records, roles and functions, external resources, places, and time) that create 'the archival context'. In particular, the EAC(CPF) Ontology in archival descriptive systems suffers from some lack of formalisation in extending possible access points to the archive, such as the description of CPF's administrative functions or agents' roles as attested in source documents, which, in our view, have important roles in explaining multi-level relationships.","refs":[]},{"text":"There exist various ways to extend the current EAC(CPF) Ontology to address multilevel relationships in a way that is at the same time sophisticated and compliant with the OWL 2 DL specification 4 . One possible way is to separate CFPs from their roles, and to consider the relationships between CFPs and roles as individuals of a class of relationships within a time interval and an applicability context, similarly to what we suggested in 5 and 6,7 , and later in 8,9 within the cultural heritage domain.","refs":[{"start":195,"end":196,"marker":"bibr","target":"#b4"},{"start":447,"end":449,"marker":"bibr","target":"#b6"},{"start":449,"end":450,"marker":"bibr","target":"#b7"},{"start":466,"end":468,"marker":"bibr","target":"#b8"},{"start":468,"end":469,"marker":"bibr","target":"#b9"}]},{"text":"While the Publishing Roles Ontology (PRO) 5 -http://purl.org/spar/pro -can be used to describe successfully these roles, in this paper we focus on extending that ontology to describe agent-role relationships and related events within a domain of interest, i.e., the definition of the political roles of agents as attested in source documents. To this end, we have developed the Political Roles (PRoles) Ontology -http://www.essepuntato.it/2013/10/politicalroles -to explore new possibilities in the representation of archival authority records and to formalise complex relationships, such as agents' political roles and related events, as attested in full-text sources.","refs":[{"start":42,"end":43,"marker":"bibr","target":"#b5"}]},{"text":"In our opinion, the archival authority records represent an environment that, if adequately enriched with related information, could be used fruitfully in cultural heritage fields that manage access points to information: by adopting the model we propose here, libraries and museums can improve their descriptions and provide additional interesting access points to their material.","refs":[]},{"text":"The rest of the paper is structured as follows. In Section 2 we list some of the most relevant works related to our research. In Section 3 we introduce the PRoles Ontology, showing how it can be used to describe a real scenario and how it can be integrated inside the EAC(CPF) Ontology. In Section 4 we discuss the importance of describing the agents roles emerging from a source text with regards to the archival domain. Finally, in Section 5 we conclude our paper, sketching out some future works.","refs":[]}]},{"title":"Related works","paragraphs":[{"text":"The PRoles ontology moves from works reflecting on roles as fundamental access point to records: in order to enhance cultural heritage description in digital libraries collections, as Europeana 7,9 ; in managing publishing roles through 'semantic lenses' 6,8 ; in using digital editions as full-text documents 10 ; in analysing other metadata models and vocabularies 11 as TEI (http://www.tei-c.org), CIDOC-CRM (http://www.cidoc-crm.org/), DC (http://dublincore.org/), EDM (http://pro.europeana.eu/edm-documentation). The aim of PRoles is to dialogue with other ontological model, in order to guarantee interoperability and interchange between conceptual models. So an analysis of existing ontologies was the starting point, in order to understand what the existing models propose, which problems are noticed and which solutions are possible, as regards to the specific task of the ontological representation of political roles.","refs":[{"start":194,"end":196,"marker":"bibr","target":"#b7"},{"start":196,"end":197,"marker":"bibr","target":"#b9"},{"start":255,"end":257,"marker":"bibr","target":"#b6"},{"start":257,"end":258,"marker":"bibr","target":"#b8"},{"start":310,"end":312,"marker":"bibr","target":"#b10"},{"start":367,"end":369,"marker":"bibr","target":"#b11"}]},{"text":"The EAC(CPF) Ontology 3 provides two object properties to relate CPF descriptions with other CPFs and external resources (eac-cpf:cpfRelation and eac-cpf:resourceRelation) and a data property to relate CPFs to a textual description of their functions/roles (eac-cpf:function).","refs":[]},{"text":"Related entities and resources, but not functions, are regarded as individuals of eac-cpf:relation (sic) class: each individual is provided with a data property which explicates kind of relationship (eac-cpf:cpfRelationType, eaccpf:resourceRelationType). Thus, functions/roles are implemented like 'attributes' that don't further contribute to the explanation of the archival context (linking entities and resources), neither are considered relations.","refs":[]},{"text":"ISDF 12 , the ICA standard for describing functions, defines rules to relate functions (activities/occupations/roles) with entities owning or performing them and with resources created by entities. Functions also means to relate indirectly entities and resources: a specific relation, like the production of archival materials in the exercise of entity's duties, should be intended as 'medium' node through an entity and a resource that can't be formally expressed, simply and completely, with a data property, like eac-cpf:function, neither with a hypothetical object property.","refs":[{"start":5,"end":7,"marker":"bibr","target":"#b12"}]},{"text":"Actually, in the archival community discussion, is not foreseen a XSD formalization of ISDF standard yet 13 and furthermore, there aren't unanimous accepted choices to how use these access points: as a consequence, the lack of formalization in EAC(CPF) Ontology.","refs":[{"start":105,"end":107,"marker":"bibr","target":"#b13"}]},{"text":"Instead, time-indexed and contextualized roles (or functions) are subject in other study cases, like the SPAR ontologies (Semantic Publishing and Referencing Ontologies: http://purl.org/spar) for describing bibliographic environment, particularly in PRO 5 . The Publishing Roles Ontology -PRO (http://purl.org/spar/pro) describes CPFs' publishing roles on documents involved in editorial processes. Although this ontology had been thought in principle for an application in the publishing domain, it has been developed so as to accommodate any kinds of specification of roles, independently from the domain of interest. In particular, it defines a class to specify roles an agent can holds, pro:Role, and a class for representing role attributions as reified relationships represented by pro:RoleInTime, which allows to describe CPFs having a role in a precise interval and within a particular context (such as in some organisation, on a document or with respect to other CPFs).","refs":[{"start":254,"end":255,"marker":"bibr","target":"#b5"}]},{"text":"Although PRO provides a primary context for relationships describing someone holding some roles within a particular context, the description of political roles needs an additional level of contextualisation, due to the need of describing agents participating to events (located in time and in space) with a particular role.","refs":[]},{"text":"In order to enable such descriptions, another model was reused to include agents with political relationships in events, i.e., the N-ary Participation ontological pattern: http://ontologydesignpatterns.org/wiki/Submissions:Nary_Participation.","refs":[]},{"text":"This pattern describes, mainly, individuals of the class nary:NaryParticipation, which allows to model any object as a participant in an event, i.e., an agent who participates for a specific period of time in an event, holding a time-indexed political role and relating with other objects (agents, places, sources, etc.). The possibility of specifying provenance data for any kinds of ontological assertions has a crucial value for claiming the validity of such representation.","refs":[]},{"text":"In our domain, the ontological description of political roles and related events, there is always a matter of opinion, since interpretation is an editorial activity. A larger context for political roles/relationships implies a restriction on validity of assertions. In fact, a particular description, since this have been deduced from the full-text of a source which declares a specific context for agents' activities, couldn't be unanimously accepted as the only correct assertion/interpretation, because this has been deduced by someone from a particular source (e.g., a webpage). For instance, a particular assertion about a role/relation (declared by anyone) could be in disagreement with another editor, who wants to identify the same political role within another context (mined from the same source), or attests it with some variation in another source.","refs":[]},{"text":"Thus, a meta-contextual level is aimed to supply information about provenance of assertions. This can be provided by using two object properties from the Provenance Ontology PROV-O (http://www.w3.org/TR/prov-o) -i.e., prov:wasAttributedTo -to specify the person that provides a particular OWL characterization of a political role held by someone and of the event in which the person is involved -and prov:hadPrimarySource, -that allows to indicate the source from which the ontological description has been derived.","refs":[]}]},{"title":"The Political Roles Ontology","paragraphs":[{"text":"The Political Roles (PRoles) Ontology is an OWL 2 DL ontology that allows one to represent political role attributions and their possible links to related events by means of particular classes and properties, some of them we have already introduced in the previous sections. As said above PRoles imports and uses several concepts from PRO, n-ary participation pattern and PROV-O. In particular, we use:","refs":[]},{"text":"• instances of the class foaf:Agent (The Friend of a Friend -FOAF -project: http://www.foaf-project.org/) to represent either the agent holding a particular political role or the person responsible for the translation of a source text into ontological assertions; • instances of the class proles:PoliticalRole (subclass of pro:Role) to define the political role considered;","refs":[]},{"text":"• instances of the class proles:PoliticalRoleInTime (subclass of pro:RoleInTime) that represent the (reified) relationship between the agent holding a role and the role itself, within the boundaries of a particular time-interval and applicable context for that role; • instances of the class proles:ParticipationWithPoliticalRole (subclass of nary:NaryParticipation) that describe an agent's participation in an event with a particular political role; • instances of the class proles:Source that identify the source/document from which the ontological assertions were extracted.","refs":[]},{"text":"The PRoles Ontology is organized according different level of abstraction, as shown in Figure 1: agents-roles relationships, role attributions and events, and provenance information. In the following sections we introduce, step by step, all these layers and explain how these are related between them through working examples.","refs":[{"start":94,"end":95,"marker":"figure","target":"#fig_0"}]}]},{"title":"Describing political roles","paragraphs":[{"text":"The first level of abstraction concerns the role attribution scenario: an agent (i.e., foaf:Agent) holds a time-indexed political role (i.e., proles:PoliticalRole) and has another ontological entity (e.g., a person, an organization, a document, a place) as primary context. This situation has been modelled in PRoles using the class proles:PoliticalRoleInTime, while relations with the considered role, the time interval and the context of application of the agent-role relationships are described, respectively, by the object properties pro:withRole, tvc:atTime and pro:relatesToEntity (which has pro:relatesToPerson, pro:relatesToOrganisation, pro:relatesToDocument and proles:relatesToPlace as subproperties). For instance, using classes and properties introduced above, we can assert that Andrea Costa was active in Italy as anarchist from 1867 to 1874 as follows:","refs":[]},{"text":":andrea-costa a foaf:Person ; pro:holdsRoleInTime :andrea-costa-anarchist . # foaf:Person subclass of foaf:Agent :andrea-costa-anarchist a proles:PoliticalRoleInTime ; pro:withRole proles:anarchist ; proles:relatesToPlace :italy ; tvc:atTime [ a ti:TimeInterval ; ti:hasIntervalStartDate \"1867-01-01T00:00:00\"^^xsd:dateTime ; ti:hasIntervalEndDate \"1874-12-31T23:59:59\"^^xsd:dateTime ] ] .","refs":[]}]},{"title":"Events involving political roles","paragraphs":[{"text":"Sometimes, a particular role attribution may need to be described within a particular event which involves an agent acting a particular role. In PRoles, the time-indexed participation of an agent in events is defined by the class proles:ParticipationWithPoliticalRole. The agent involved in the event and his role are specified through the object properties proles:includesAgent and proles:includesPoliticalRoleInTime. Finally, the event in consideration and the duration of agent's participation in the event are both linked through the object property nary:participationIncludes.","refs":[]},{"text":"For instance, using classes and properties introduced in this layer, we can assert that Andrea Costa was involved in an anarchic insurrection in Imola in 1874 as follows:","refs":[]},{"text":":andrea-costa-in-insurrection a proles:ParticipationWithPoliticalRole ; proles:includesAgent :andrea-costa ; proles:includesPoliticalRoleInTime :andrea-costa-anarchist ; nary:participationIncludes [ a ti:TimeInterval ; ti:hasIntervalStartDate \"1874-01-01T00:00:00\"^^xsd:dateTime ; ti:hasIntervalEndDate \"1874-12-31T23:59:59\"^^xsd:dateTime ] , [ a part:Event ; dcterms:description \"Anarchic insurrection in 1874 in Imola\" ] . ","refs":[]}]},{"title":"Who has made the ontological assertions","paragraphs":[{"text":"As a third level of detail, it is important to identify who has provided ontological description of both role attributions and participations and, in particular, what is the primary source from which these data have been extracted. In PRoles, these provenance information about instances of proles:PoliticalRoleInTime and proles:ParticipationWithPoliticalRole classes are described by means of two properties of PROV-O. We use prov:wasAttributedTo to identify the agent (i.e., an individual of foaf:Agent) responsible for the ontological description of the role attribution/participation, while we use prov:hadPrimarySource to identify the source (i.e., an individual of proles:Source).","refs":[]},{"text":"For instance, using classes and properties introduced in this layer, we can assert that Marilena Daquino was responsible of the ontological assertion related to the description of Andrea Costa as anarchist, while Silvio Peroni was responsible of the ontological assertion related to the involvement of Andrea Costa in the anarchic insurrection in 1874, both of which are derived from the Italian Wikipedia article on Andrea Costa:","refs":[]},{"text":":andrea-costa-anarchist prov:wasAttributedTo :marilena-daquino ; prov:hadPrimarySource <http://it.wikipedia.org/wiki/Andrea_Costa> . :andrea-costa-in-insurrection prov:wasAttributedTo :silvio-peroni ; prov:hadPrimarySource <http://it.wikipedia.org/wiki/Andrea_Costa> . :marilena-daquino a foaf:Person . :silvio-peroni a foaf:Person .","refs":[]},{"text":"Of course, while information about a particular role attribution could be obtained from a source, other data, such as the agent with a political role participation in events, could be abstracted from another source, which completes the former data. Then, to pull out any possibilities in the model, different provenance statements are specified.","refs":[]}]},{"title":"Enabling inferences","paragraphs":[{"text":"PRoles could be translated as a relationship between an agent and a resource through a political role/function, as required by ISDF rules, without specifying paternity on that document, just providing a generic relation with a source giving information about agent's role or related in other ways. This explanation of relationship stretch the point, so a political role should be related to sources using provenance meta-context, the second level of description; an agent having a political role/relation in a context (like militancy in a party, having influence on a person, exercising institutional role in some place) has been seen as a complex information deduced from a source by a responsible agent. The structure adopted in the PRoles Ontology, the instantiation of a complexity of bonds, has been borrowed from PRO and results an efficient and expressive model to describe completely a situation that could not be represented neither just through a generic single object property between an agent and a role, nor with a data property as proposed in EAC(CPF) Ontology.","refs":[]},{"text":"However, direct links between agents and their roles can has its own advantages. First, these direct links are commonly used, and thus expected, in cultural heritage data models. In addition, they can be very useful when querying or browsing the data.","refs":[]},{"text":"In order to guarantee the existence of direct links, PRoles includes some mechanisms, namely the definition of property chains, to enable automatic inferences of some direct relations. Moreover, each individual of classes above mentioned has part in property chains. The main idea is creation of links from the classes foaf:Agent and proles:Place to the class proles:Source (through the object property proles:hasRelatedSource) and to specific kinds of foaf:Agent, namely foaf:Person and foaf:Organization (through the object property proles:hasRelatedAgent). These two properties are, thus, implemented as follows (in Manchester Syntax): For instance, considering again the examples introduced in the previous section, these property chains allow us to infer the following assertions about the source document:","refs":[]},{"text":":andrea-costa proles:hasRelatedSource <http://it.wikipedia.org/wiki/Andrea_Costa> . :italy proles:hasRelatedSource <http://it.wikipedia.org/wiki/Andrea_Costa> .","refs":[]}]},{"title":"Improving a model for ISDF standard","paragraphs":[{"text":"Modelling in archival context means, as a first step, to translate standards, e.g. the ISDF standard 12 , for describing main resources (CPFs, archival materials, functions/roles, cultural organizations) respecting mandatory elements required. Of course, PRoles doesn't represent the formal representation of ISDF. However, it presents lots of congruent elements. PRoles just provides by means of PRO an expressive solution for information about CPFs' activities and features and relates them in some way to documents, improving the model with new specifications. In addition, one of the main features of PRoles is to allow the link between an agent's role attribution and/or participation to events and the source attesting these information, which is close to one's required in ISDF.","refs":[{"start":101,"end":103,"marker":"bibr","target":"#b12"}]},{"text":"In ISDF standard there is not a specific definition respectively of functions and roles: it just ascribes functions (activities, occupations) to corporate bodies and roles to persons, but it doesn't establish how to distinguish their descriptions and what kind of roles a person may have (nor which relation a role may have with archival materials or other resources). It provides a broad-spectrum of possibilities without defining a range of categories for roles, living users' multiple interpretations, like considering roles just as mirror image of functions but also covering with any other bond between a person and a resource. Consequently, a future development of an official ISDF ontology may take into account an agent's role which produces or generally relates to a resource: a future ontology based on the standard could reuse PRoles, or PRO, as a starting point for representing functions/roles as medium (reified) nodes between agents and their related resources.","refs":[]}]},{"title":"Mapping EAC(CPF) and PRoles","paragraphs":[{"text":"PRoles is an autonomous ontology for describing agents, roles and related objects and reuses explicitly previous well-known models and patterns. However, the final aim of PRoles is to be integrated in and to enrich models developed in principle to describe the archival domain such as the EAC(CPF) Ontology, which has inspired this research, seems a befitting model to test PRoles. A complete mapping between PRoles and EAC(CPF) Ontology does not exist yet. Currently, an equivalence relation has been specified between eac-cpf:entity and foaf:Agent, proles:hasRelatedAgent has been declared using a property chain (linking a couple of individuals of eac-cpf:entity), and proles:hasRelatedSource has been declared using another similar property chain (linking an individual of eaccpf:entity to an individual of oad:uod). Object properties of EAC(CPF) have been related to those generic relationships in PRoles relates directly agents and sources, to convey associative bonds between OWL entities and leaving roles' description as a not hierarchical second level of detail.","refs":[]},{"text":"In addition to this preliminary mapping, is interesting to notice how PRoles main classes do/may have fitted in EAC(CPF): proles:PoliticalRoleInTime could be considered subclass of eac-cpf:relation class, if an hypothetical object property eac-cpf:functionRelation would exist, allowing the declaration of pro:holdsRoleInTime and proles:isIncluded-InParticipationWithPoliticalRole as its sub-properties. If it be so, we should have ISDF hoped situation, where an agent holds a role/function, described as a relation, and then entertaining mediated relations with resources and other agents involved with the exercise of that role.","refs":[]}]},{"title":"Why political roles? Importance of full-text","paragraphs":[{"text":"Study cases for PRoles started on politicians' biographies involved in Andrea Costa's life, abstracted from IBC-xDams records of Andrea Costa's fonds archives 14 . These records have been the first field of application for EAC(CPF) Ontology and then have been appeared an interesting use case for PRoles, maintaining continuity with previous works.","refs":[]},{"text":"Generally in Italy, archival materials concerning political relationships shows as personal and public documents blend into archives: lots of official documents appear in private collections, merging them with personal histories and making more difficult arrangements.","refs":[]},{"text":"Creating a common thread among people, their functions or roles and sources giving information about them (scattered all in archives, libraries, personal collections, but also digital born documents) could represent a better way to virtually collapse documentation and to increase elements proper of CPFs' description.","refs":[]},{"text":"Choosing to describe political roles attested in sources, we tried to represent an example in which full-text of sources creates new links among several objects of different kinds, with the aim to enrich the archival context, giving to archival authority records a further reason to have been defined as 'reference files', i.e., richer and autonomous sources of information for historical research.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"PRO provides a model for describing a particularly situation, editorial process, but other scenarios can be defined just adding individuals in pro:Role class without modifying TBox of the ontology. In this paper, we presented the Political Roles (PRoles) Ontology. PRoles extends PRO with subclasses to describe specific situation about political relationships involved in events and related to sources which attest information about these situations. Although PRoles was developed to describe the political relationships domain, it can be generalised to describe other kinds of roles.","refs":[]},{"text":"The possibility to work on the full-text of archival documents is a fundamental step in the direction of authority records enriching, by extracting information regarding people mentioned in documents. Enlarging access points to documents thought this approach will allow a better access to cultural heritage objects. The analysis of the provenance as 'paternity attribution' in declaring assertion will provide a method able to let scholars to compare multiple interpretations of documents.","refs":[]},{"text":"The next step of the work will be to classify the possible political roles of agents in order to extend the ontology and provide a deeper conceptualisation. The final aim is then to define a data set, starting from the application of PRoles to the Andrea Costa's fond, that will be our future work in collaboration with IBC, making us able to deeply reflect on possibile emerging inferences.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"In this paper we present the Political Roles (PRoles) ontology, an OWL 2 DL ontology for the description of political relationships between persons. Building upon existing ontological models, such as the Publishing Roles Ontology (PRO), the Provenance Ontology (PROV-O) and the N-ary Participation ontology design pattern, PRoles provides a clear ontological characterisation of political roles and related events, establishing a link between the description of such concepts and the documents from which this information is distilled.","refs":[]}]}}