{"bibliography":{"title":"","authors":[{"person_name":{"surname":"Aloia","first_name":"Nicola"},"affiliations":[{"department":"Institute for Information Science and Technologies","institution":"Italian National Research Council (ISTI-CNR)","laboratory":null}],"email":"nicola.aloia@isti.cnr.it"},{"person_name":{"surname":"Concordia","first_name":"Cesare"},"affiliations":[{"department":"Institute for Information Science and Technologies","institution":"Italian National Research Council (ISTI-CNR)","laboratory":null}],"email":"cesare.concordia@isti.cnr.it"},{"person_name":{"surname":"Meghini","first_name":"Carlo"},"affiliations":[{"department":"Institute for Information Science and Technologies","institution":"Italian National Research Council (ISTI-CNR)","laboratory":null}],"email":"carlo.meghini@isti.cnr.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{},"sections":[{"title":"Introduction and Motivation","paragraphs":[{"text":"Europeana v1.0 is the successor network to the EDLnet thematic network which created the EDL Foundation and the Europeana prototype. The thematic network is coordinated by the EDL Foundation, which was formed to be responsible for the operation of the European Digital Library called Europeana [1]. It started in March 2009 and will end in July 2011.","refs":[{"start":294,"end":297,"marker":"bibr","target":null}]},{"text":"Following the launch of the prototype of Europeana, the EDL Foundation goal is to continue to develop the operational service of Europeana. This includes the development and implementation of all the necessary back end processes to run such an operation and a full-scale business development operation to ensure a steady stream of content is made available. Additionally dissemination efforts to end users are also executed to ensure take up and continuous involvement of end users in order to achieve and sustain such a service. An important effort has been also made in the development of services that allows others to re use and re purpose the data stored in the Europeana information space.","refs":[]},{"text":"The main objectives of the Europeana v1.0 are:","refs":[]},{"text":"putting into practice the decisions on how to attract and maintain content into the service building the back end systems needed to manage the delivery and access of this content managing the channels enabling other environments to use the content made interoperable by Europeana, via web services or API's deploy the most usable levels of multilingual search and retrieval disseminate the service to end users and provide tools to involve them actively.","refs":[]},{"text":"N. Aloia, C. Concordia, and C. Meghini","refs":[]},{"text":"The areas that this Thematic Network address are as follows:","refs":[]},{"text":"1. Continued and proactive involvement of partners 2. Participation of new partners, particularly from publishing in the arts and humanities 3. Creation of license and partnership agreements 4. Rights management and IPR integration into Europeana the operational service 5. Management of partner content and continuous access to that content 6. Technical building of the service functional specification implementation 7. Hardware, storage and bandwidth connected with running the service 8. Service agreements with bodies involved in running the service 9. Implementation of new technologies 10. Implementation of new data and object models 11. Promotion of standards and data models 12. Dissemination to partners, stakeholders and end users 13. Distribution to other channels for mash ups and re-use 14. Policy development 15. Fund raising.","refs":[]}]},{"title":"Scientific Challenges","paragraphs":[{"text":"A thematic area addressed by Europeana v1.0 that presents a major scientific challenge is the one concerning the conceptual modeling of the Europeana information space. Each of the different heritage sectors represented in Europeana uses different data models, some of which adhere to domain standards, while others are proprietary formats. This poses a very serious semantic interoperability problem. Moreover, Europeana is expected to exploit in the best possible way the information on cultural heritage objects provided by the contributing providers, in order to support sophisticate functionality, semantic search above all. The main challenge of the project is therefore to enable different formats to be interoperable at semantic level, while retaining the original expressivity and richness of the data.","refs":[]},{"text":"In order to meet this challenge, Europeana v1.0 has developed a data model, the Europeana Data Model (EDM, for short). The EDM is an attempt to transcend the respective information perspectives of the different sectors that are represented in Europeana the museums, archives, audiovisual collections and libraries. In particular, it makes a distinction between the intellectual and technical creation that is submitted by a provider (a bundle of resources about an object curated by the provider), the object this structure is about, and the digital representations of this object, which can be accessed over the web. Also, EDM adheres to the modelling principles that underpin the approach of the Web of Data (\"Semantic Web\"). EDM has been released for internal purposes on May 2011, and will soon be made public.","refs":[]},{"text":"Other important challenges in Europeana are tackling multilingualism and finding innovative ways of presenting tremendously large result sets (this is also referred to as info-graphics).","refs":[]}]},{"title":"Key Technologies","paragraphs":[{"text":"Technically speaking, Europeana is primarily perceived as a portal exposing search and browse functionalities enabling users to access a large collection of cultural heritage objects. Even though this perception is not entirely misleading, it does not capture the essential characteristics of what the Europeana really is: the Digital Library System (DLS) implementing Europeana is an open services platform enabling users and cultural institutions to access and manage the information space via an Application Program Interface (API). The Europeana DLS is built as a set of separate software components interacting through the Europeana API. The Europeana API enables Europeana developers to extend the DLS by adding new components, and third party developers to easily embed Europeana functionalities in their applications. To hide the complexity of the underlying system, the Europeana API are published as a set of callable methods, API endpoints and calling conventions. The actual implementation of the DLS components has been made using multiplatform languages and technologies (mainly Java related) and using the Web as underlying communication infrastructure.","refs":[]},{"text":"The Europeana foundation is currently organizing informal workshops to showcase the potential of the API usage for data providers, partners and endusers [2].","refs":[{"start":153,"end":156,"marker":"bibr","target":null}]}]},{"title":"Contribution by Italian Research Community","paragraphs":[{"text":"The contribution of national research community to Europeana v1.0 relates to two main aspects.","refs":[]},{"text":"A major contribution has been done in defining the Europeana Data Model; the EDM is the result of the work of an international and multi disciplinary team of researchers leaded by the ISTI-CNR team, who has been responsible for editing the specification of the model, obtained through a complex process, involving a team core experts and a community with hundreds of members.","refs":[]},{"text":"Another important contribution has been the implementation at ISTI-CNR of a development infrastructure called Europeana Labs. The Europeana Labs is a set of servers that are used by the community of developers working in Europeana or in other related projects in order to test or showcase to a limited audience their applications or tools. The Europeana Labs also hosts the servers used for the cooperative working.","refs":[]},{"text":"1. http://europeana.eu/ 2. http://www.europeana-libraries.eu/web/api/ hackathons","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The Europeana v1.0 is a Thematic Network project funded under the Commission's eContentplus programme 2008 and is the successor network to the EDLnet thematic","refs":[]}]}}