{"bibliography":{"title":"Digital Curators' Education: Professional Identity vs. Convergence of LAM (Libraries, Archives, Museums)","authors":[{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":null},{"person_name":{"surname":"Madrid","first_name":"Melody"},"affiliations":[{"department":"International Master DILL","institution":"University of Parma","laboratory":null}],"email":null},{"person_name":{"surname":"Casarosa","first_name":"Vittore"},"affiliations":[{"department":null,"institution":"ISTI-CNR","laboratory":null}],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital library education. 1","Preservation","Digital curation"],"citations":{"b0":{"title":"American Association of Museums. Curators Committee, Code of ethics for curators","authors":[],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":"http://www.curcom.org/_pdf/code_ethics2009.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Digital curation for science, digital libraries, and individuals","authors":[{"person_name":{"surname":"Beagrie","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal of Digital Curation","series":null,"scope":{"volume":1,"pages":null}},"b2":{"title":"Puzzling over digital preservation -identifying traditional and new skills needed for digital preservation","authors":[{"person_name":{"surname":"Bahr","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://conference.ifla.org/past/ifla77/217-bahr-en.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Training for Digital Preservation in the context of the European project PLANETS","authors":[{"person_name":{"surname":"Casarosa","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://conference.ifla.org/past/ifla77/217-casarosa-en.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Digital Curation/Digital Archiving: A View from the National Archives of Australia","authors":[{"person_name":{"surname":"Cunningham","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"American Archivist","series":null,"scope":{"volume":71,"pages":{"from_page":530,"to_page":543}}},"b5":{"title":"Digital Curation Centre, What is digital curation?","authors":[{"person_name":{"surname":"Dcc","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":"http://ils.unc.edu/digccurr/digccurr-functions.html","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"The Long-Term Preservation of Accurate and Authentic Digital Data: The INTERPARES Project","authors":[{"person_name":{"surname":"Duranti","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":"http://www.jstage.jst.go.jp/article/dsj/4/0/4_106/_article(retrieved","publisher":null,"journal":"Data Science Journal","series":null,"scope":{"volume":4,"pages":null}},"b7":{"title":"Cyberinfrastructure, Data, and Libraries, Part 1 A Cyberinfrastructure Primer for Librarians","authors":[{"person_name":{"surname":"Gold","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":"http://www.dlib.org/dlib/september07/gold/09gold-pt1.html","publisher":null,"journal":"DLib Magazine","series":null,"scope":{"volume":13,"pages":null}},"b8":{"title":"Digital curation: a how-to-do-it manual","authors":[{"person_name":{"surname":"Harvey","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Neil Schuman Publishers, Inc","journal":null,"series":null,"scope":null},"b9":{"title":"Out of the Classroom and into the Laboratory: Teaching Digital Curation Virtually and Experientially","authors":[{"person_name":{"surname":"Harvey","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Bastian","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://conference.ifla.org/past/ifla77/217-harvey-en.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"Understanding electronic incunabula: a framework for research on electronic records","authors":[{"person_name":{"surname":"Hedstrom","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"1991","month":null,"day":null},"ids":null,"target":"http://www.digitalpreservation.gov","publisher":"Information Technology","journal":null,"series":null,"scope":{"volume":54,"pages":{"from_page":334,"to_page":354}}},"b11":{"title":"Digital Data Curation Task Force","authors":[{"person_name":{"surname":"Lord","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Macdonald","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2002","month":"11","day":"26"},"ids":null,"target":"http://www.jisc.ac.uk/uploaded_documents/CurationTaskForceFinal1.pdf","publisher":null,"journal":null,"series":null,"scope":{"volume":1,"pages":null}},"b12":{"title":"Matrix of Digital Curation Knowledge and Competencies","authors":[{"person_name":{"surname":"Lee","first_name":"C"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://www.ils.unc.eduldigccurrdigccurr-matrix.html","publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"e-Science curation report: Data curation for e-science in the UK -an audit to establish requirements for future curation and provision","authors":[{"person_name":{"surname":"Lord","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Macdonald","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":"http://www.jisc.ac.uk/uploaded_documents/e-ScienceReportFinal.pdf","publisher":"JCSR","journal":null,"series":null,"scope":null},"b14":{"title":"A Study of Digital Curator Competences: A survey of experts","authors":[{"person_name":{"surname":"Madrid","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b15":{"title":"Comparing curricula for digital library and digital curation education","authors":[{"person_name":{"surname":"Pomerantz","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Oh","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Wildemuth","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Hank","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Tibbo","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Fox","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b16":{"title":"Managing the Digital World: The role of Digital Curation","authors":[{"person_name":{"surname":"Ray","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"http://www.imls.gov/pdf/JRay_Edinburgh.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b17":{"title":"Education and training for digital repositories manager","authors":[{"person_name":{"surname":"Repanovici","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":"http://conference.ifla.org/past/ifla77/217-repanovici-en.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b18":{"title":"The Institutional Repositories: Staff and Skills Set","authors":[{"person_name":{"surname":"Robinson","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"http://www.sherpa.ac.uk/news/staffandskillssecondrevision.html","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The problem of digital preservation is a new area of study, in which converge the activities and research of different disciplinary sectors, which can be identified as computer science, digital archives, digital museums and libraries. The literature developed in various areas of research offers different definitions of the area of study, due to diverse interpretation and meaning given by professional communities to the words \"preservation\", \"archiving\", \"information\" and \"data\". To overcome (to some extent) the communication problems between the different disciplinary and professional sectors, a new term \"digital curation\" was recently adopted, which joins two preexisting terms \" curation\" and \"digital preservation\".","refs":[]},{"text":"Curation is a term used both by cultural institutions, such as libraries, archives and above all museums as well as by scholars and creators of large databases such as Genome. It indicates those activities that add value and knowledge to the collections, and the added value is usually given by the curator or manager of the cultural institution. The curator is often a specialist in the field and through her competence she enriches the collection in a variety of ways. First of all the curator is an expert in the activity of selecting the collection items, so that the value of the whole collection is greater than the sum of the values of its items. The services provided (by the curator) give evidence to this added value, and also, since the curator is able to interpret the significance of the collection and to communicate it to the users, the services can assume an edu-cational and personalized role. The curator has also technical competences, such as the indexing of the collection to facilitate browsing and retrieval, and the enrichment of the documentation (metadata) to provide for the single objects additional information about their descriptive and historical context. In smaller institutions, the curator offers general support to users.","refs":[]},{"text":"The American Association for Museums Curators describes the curator's role in this way:","refs":[]},{"text":"\"Regardless of their situation, curators have distinctive responsibilities that focus upon: 1) the interpretation, study, care, and development of the collection, and 2) the materials, concepts, exhibitions, and other programs central to the identity of their museum. Because of their direct responsibilities for the collection and their role in the development of interpretive material, curators are ambassadors who represent their institution in the public sphere\".","refs":[]},{"text":"The term Digital preservation is used by the Library of Congress (http://www. digitalpreservation.gov) with this meaning: \"Digital preservation is the active management of digital content over time to ensure ongoing access\".","refs":[]},{"text":"The focus of digital preservation is upon the collection, management and permanent access to digital resources, in particular those which are \"born digital\" and therefore have no physical counterpart. In 2010 the Library of Congress conducted a survey of the educational needs for digital preservation and identified three levels of competences: practical, managerial, executive. The practical competences are essentially technical, based upon standards and the technology applications necessary for the management and preservation of digital objects. The management competences are mainly those related to the management of digitization projects, and the executive competences are those related to a strategic vision and the continuous updating of the preservation activities. For libraries, it is interesting to note in some of the answers received during interviews that the activity of preservation is not considered a competence needed by all librarians, but rather it is perceived as a specialized competence for a small group or even to be left in the hands of specialists outside the library. The term preservation, as well as the similar one \"archiving\", is in fact traditionally perceived as an activity at the end of the workflow for the management of digital resources and thus considered separated or isolated from the vital flow of the creation, organization and circulation of the resource.","refs":[]},{"text":"The present paper intends to define the state of the art of the convergence for \"digital curation\" and is based upon the acts of recent IFLA Conferences in which sessions dedicated to Digital Curation were held, and upon the results of a Delphi study carried out in the research thesis of Melody Madrid, a student of the International Master DILL (Digital Library Learning). The paper does not attempt to be exhaustive, but is limited only to outlining the problems which emerge from the meeting of different disciplinary communities, although in the convergence of a common area of interests. Surely the study of the convergence of archives, libraries, museums, together with other professional sectors such as computer science, must be elaborated on with further research.","refs":[]},{"text":"The convergence has a notable impact on the teaching to new professionals as well as on the retraining of the staff in service. For this reason, the paper concentrates on the problem of competences which are deemed to be necessary for digital curation in an interdisciplinary approach.","refs":[]}]},{"title":"Digital Curation: History of the Concept and Competences","paragraphs":[{"text":"The term \"digital curation\" was used for the first time during the Seminar \"Digital curation: digital archives, libraries and e-science\" held in London in 2001 by the Digital Preservation Coalition and British National Space Center (Beagrie 2006). The term digital curation was later adopted by JISC (http://www.jisc.ac.uk/), which established the Digital Curation Centre (DCC 2004). The Digital Curation Centre ( 2004) so defines the concept, introducing the notion of \"adding value\": \"Digital curation broadly interpreted is about maintaining and adding value to a trusted body of digital information for current and future use\" Beagrie N. (2006) in his paper \"Digital curation for science, digital libraries and individuals\", widens the concept by introducing the notion of \"entire life cycle\":","refs":[{"start":232,"end":246,"marker":"bibr","target":"#b1"},{"start":372,"end":382,"marker":"bibr","target":null},{"start":414,"end":418,"marker":"formula","target":null},{"start":631,"end":648,"marker":"bibr","target":"#b1"}]}]},{"title":"\"Actions needed to maintain digital research data and other digital materials over their entire life cycle and over time for current and future generations of users\"","paragraphs":[{"text":"The concept of digital curation was thus born with the idea of building bridges between different disciplinary approaches and arises from the initial knowledge of the scholars that a new approach is necessary for the care and preservation of digital assets during their life span. As Harvey (2011) has written, the new approach is characterized by new competences:","refs":[{"start":284,"end":297,"marker":"bibr","target":"#b9"}]}]},{"title":"\"Among these are the ability to function comfortably in both digital and physical mediums, to move seamlessly and efficiently between both mediums, to recognize and respect the core differences between information disciplines as well as between the information content itself, and to negotiate the ways in which digital environments can overcome information silos to create a universe of access across institutionalized boundaries\"","paragraphs":[{"text":"The first concept which unifies the different disciplinary approaches is the life cycle of the digital resources. This common approach to the life cycle brings with it two aspects: 1) the first is that preservation should no longer be perceived as a final phase separated from the creation and access to the digital resource; 2) the second brings forward the need for collaboration among all the stakeholders who participate in various roles and in different phases of this life cycle.","refs":[]},{"text":"A first curriculum for digital curation was promoted in 2008 by NARA, the US National Archives and Records Administration. DIGCCURR, the project that followed this stimulus, has developed a matrix of knowledge and competences based on 23 functionalities, which are pragmatically based on the work flow (Lee, 2009) (http://ils.unc.edu/digccurr/digccurr-functions.html). The life cycle of digital resources which was taken as a model was the one defined in the OAIS model. Among others, one of the results of the DIGCCURR project has been to show the need for internships and hands-on experience for digital curators.","refs":[{"start":302,"end":313,"marker":"bibr","target":null}]}]},{"title":"Operational Competences of Digital Curator","paragraphs":[{"text":"The operational competences of the digital curator are essentially related to the technical functionalities described in the OAIS model. Is the digital curator a computer scientist, or rather a professional who collaborates with a computer scientist?","refs":[]},{"text":"The presentations at the IFLA Conferences have proposed this problem again, where the discussion was opened. Casarosa (2011) has pointed out that the professionals must be aware of the technologies and standards necessary for digital preservation, together with other competences which regard trust and trustworthiness in the context of digital preservation, and appreciation of the roles and responsibilities involved in digital preservation activities. Repanovici (2011) has proposed a curriculum on digital curation to Engineering and LIS students asking them to quantify their preferences, with the following results:","refs":[{"start":109,"end":124,"marker":"bibr","target":"#b3"},{"start":455,"end":472,"marker":"bibr","target":"#b17"}]},{"text":"\"Both ENG and LIB students are interested in the following courses: Conservation by digitization and Archiving web pages. The students from ENG are interested in Techniques of security against electronic theft, while the LIB students are interested in Methods of press monitoring, Legislation on culture\". Bahr (2011) relates the results of a survey on the educational needs of the staff involved in the Leibniz Project, pointing out that both librarians and information technicians involved in the project indicate basic educational needs:","refs":[{"start":306,"end":317,"marker":"bibr","target":"#b2"}]}]},{"title":"\"Profound knowledge of content related criteria and technology related criteria exists. However, applying this knowledge in the context of digital preservation is not always integrated into digital curation practice of content experts and information technology experts alike\"","paragraphs":[{"text":"The technical competences described by DIGCCURR are listed in the table below:","refs":[]}]},{"title":"Theme","paragraphs":[{"text":"Outline DIGCCURR","refs":[]}]},{"title":"Document and artefact management -physical and virtual","paragraphs":[{"text":"Focus can be at level of organization/institution, information system (e.g. recordkeeping system), collection, or individual items. ","refs":[]}]},{"title":"Management Competences of Digital Curator","paragraphs":[{"text":"The professional competences characterizing the different profiles are those which are usually considered the core of the profession. These competences in fact are considered to be the identity of the profession, as they are based upon the basic principles and the specific mission of each profession. What is the impact of the convergence on this professional identity?","refs":[]},{"text":"The different identities of the information professions are still present, but there is a trend towards their change and technological convergence. In \"Cyberinfrastructure, Data, and Libraries, Part 1 A Cyberinfrastructure Primer for Librarians\" Anna Gold (2007) discusses the need for librarians to extend their competences to the phase preceding publication, while traditional background concentrates on the phase of dissemination and access, following publication. This knowledge is added to the needed technical skills, which may include data management, data archiving, digital preservation, the semantic web, and the linked open data.","refs":[{"start":251,"end":262,"marker":"bibr","target":"#b7"}]},{"text":"From the world of archives, Margareth Hedstrom in 1991 highlighted the problems of digital archiving, many of which are still relevant. The first problem that was highlighted was the lack of technological competences, of which (at that time) the archivists had no knowledge due to the novelty of digital resources. Other more conceptual problems are also described in the work, such as the necessary collaboration with other professions for the gathering of contextual information, up to the point of questioning some pillars of the traditional archival theory. In synthesis, digital archiving is different from record keeping and record management.","refs":[]},{"text":"In \"The Institutional Repositories: Staff and Skills Set \", Robinson (2009) describes the knowledge and skills needed by repository managers and administrators and arranged them into nine categories: management; software; metadata; storage and preservation; content; advocacy, training and support; liaison (internal); and liaison (external); and current awareness and professional development.","refs":[]}]},{"title":"Strategic Competences of Digital Curator","paragraphs":[{"text":"The strategic competences of the digital curator are competences at an upper level, directed at describing and defining the policy of an institu-tion, and at a national level contributing the strategies of information policy and administration, finalized to the management and the preservation of the digital collections (Harvey, 2010(Harvey, , 2011)), including also high-level categories of digital curation functions (Lee, 2008). Pomerantz et al. (2009) have compared the competences of the digital librarian and of the digital curator, coming to the conclusion that there are no major differences. Both curricula begin with the same model of the information cycle, and analyzing both the impact that the context has on the actors, and the instruments and the functionalities that are necessary, no major difference is evidenced. What seems different is only a diverse focus on the preservation of the collection and the care of the digital objects. Harvey (2011) describes the necessity of beginning with the users and their access needs in order to obtain the balance between the different disciplinary approaches, since although they are different, they all focus on access:","refs":[{"start":321,"end":334,"marker":"bibr","target":"#b8"},{"start":334,"end":351,"marker":"bibr","target":"#b9"},{"start":420,"end":431,"marker":"bibr","target":null},{"start":433,"end":456,"marker":"bibr","target":"#b15"},{"start":953,"end":966,"marker":"bibr","target":"#b9"}]},{"text":"\"Balancing these user needs with respect for the core theories that ground the various aspects of the heritage the materials come from requires a deep understanding of different disciplines as well as of the digital options for convergence and display of the materials of that heritage. The fundamental principles of cultural heritage convergence should relate to maintaining the balance, so that the very different, but equally relevant, missions of libraries, archives and museums are not lost or subsumed in the desire to bring cultural materials and other in-formation together\"","refs":[]}]},{"title":"Delphi Study: Core Competences of Digital Curators","paragraphs":[{"text":"In \"A Study of Digital Curator Competences: A survey of experts\", Madrid (2011) defined and validated competence statements for Libraries, Archives and Museums (LAM) digital curators through a Delphi research technique. The research intended to get an equal number of participants from the Library, Archives and Museum sectors, but no reply was received from expected participants in the Museum sector. However, the panel members who responded to this study were university professors or researchers concerned with digital curation and preservation in the LAM sector, which is now considered an interconnected profession. Using a modified Delphi method, three rounds of questionnaires with controlled feedback and space for comments and/or suggestions were sent to the panel members. The questionnaire was requesting to assess, on a five point Likert scale, the agreement with a set of statements about competences needed in Digital Curation. Consensus was determined when a competence statement received a rating higher than 3, an average value greater than 3.5, and a standard deviation smaller than 1.0. Response rates for rounds I, II and III were: 70% (n=16), 87.5% (n=14), and 94% (n=15) respectively. Of the 18 digital curator competences listed in the first round questionnaire, 13 (70%) achieved consensus as being necessary competences, required for advanced level digital curator. Other input from respondents such as comments and suggestions were also analyzed. An additional 23 digital curator competence statements were also suggested by the panel in round I and further developed in subse-quent rounds. In round II, 12 (30%) competence statements achieved consensus. The final round and editing of competence statements led to 20 statements that describe what a well-prepared digital curator, trained to participate in digital curation work, should be able to do.","refs":[{"start":66,"end":79,"marker":"bibr","target":"#b14"}]},{"text":"The definition of Digital Curator which has been agreed by the experts participating to the Delphi study is:","refs":[]},{"text":"\"Digital curators are individuals capable of managing digital objects and collections for long-term access, preservation, sharing, integrity, authenticity and reuse. In addition, they have a range of managerial and operating skills, including domain or subject expertise and good IT skills\"","refs":[]},{"text":"The list of the 20 statements is divided in Operational and Managerial competences to maintain the structure of this paper, but the statements were the result of an holistic approach.","refs":[]}]},{"title":"Operational Competences","paragraphs":[{"text":"The operational competences of the digital curator which were agreed by the experts participating in the Delphi study are as follows.","refs":[]},{"text":"The Digital Curator:","refs":[]},{"text":"1. Selects and appraises digital documents for long-term preservation.","refs":[]},{"text":"2. Has an expert knowledge of the purpose of each kind of digital entities used within the designated community and its impact on preservation. 3. Knows the data structure of different digital objects and determines appropriate support needed. 4. Understands storage and preservation policies, procedures and practices that ensure the continuing trustworthiness and accessibility of digital objects. 5. Is aware of requirements for information infrastructures in order to ensure proper access, storage and data recovery. 6. Diagnoses and resolves problems to ensure continuous accessibility of digital objects, in collaboration with IT professionals. 7. Monitors the obsolescence of file formats, hardware and software and the development of new ones (e.g. using such tools as PRONOM registry) 8. Ensures the use of methods and tools that support interoperability of different applications and preservation technologies among users in different locations. 9. Verifies the provenance of the data to be preserved and ensures that it is properly documented. 10. Has the knowledge to assess the digital objects' authenticity, integrity and accuracy over time.","refs":[]}]},{"title":"Managerial Competences","paragraphs":[{"text":"What are the main management responsibilities of the digital curator? The managerial competences which were agreed by the experts participating in the Delphi study are as follows.","refs":[]},{"text":"The Digital Curator:","refs":[]},{"text":"1. Plans, implements, and monitors digital curation projects. 2. Understands and communicates the economic value of digital curation to existing and potential stakeholders, including administrators, legislators, and funding organizations. 3. Formulates digital curation policies, procedures, practices, and services and understands their impact on the creators and (re)users of digital objects. 4. Establishes and maintains collaborative relationships with various stakeholders (e.g., IT specialist, information professionals inside and outside the institution, data creators, (re)users and other stakeholders like vendors, memory institutions and international partners) to facilitate the accomplishment of digital curation objectives. 5. Organizes personnel education, training and other support for adoption of new developments in digital curation. 6. Is aware of the need to keep current with international developments in digital curation and understands the professional networks that enable this. 7. Understands and is able to communicate the risk of information loss or corruption of digital entities. 8. Organizes and manages the use of metadata standards, access controls and authentication procedures. 9. Is aware of relevant quality assurance standards and makes a well considered choice whether to employ them or not. 10. Observes and adheres to all applicable legislation and regulations when making decisions about preservation, use and reuse of digital objects in collaboration with legal practitioners.","refs":[]},{"text":"Based on the suggestions and comments received, it is worth mentioning that the members of the panel believed that digital curation workforce has multiple levels or tiers, is multi-disciplinary and includes workers from different sectors.","refs":[]}]},{"title":"Conclusion","paragraphs":[{"text":"Digital curation is a new area of research and education where different professional communities end up facing similar issues and needing similar competences. The digital nature of the resources to be curated and preserved blurs the boundaries between the three traditional professions (librarian, archivist, museum curator). Once that a resource has become (or was born) digital, the challenges, the technologies and the competences needed for its curation and preservation to a large extent do not depend on the nature of the resource.","refs":[]},{"text":"The twenty statements that have been defined and listed in the Delphi study include the operational and managerial competences of the digital curator. In conclusion, different identities of the information professionals can be evidenced, corresponding to different focus and missions of the disciplinary approaches, but the trend of convergence of the operational and some of the managerial competences can be noted.","refs":[]},{"text":"Since a digital curator should be involved in the entire life-cycle of a resource, from its creation to its preservation for \"future generations\", it appears that regardless of the origin and the intended fruition of a resource, large segments of its life cycle are more or less the same in each of the three traditional disciplines. Of course, given the different focus and mission of the three disciplines, the value adding and the access portions of the life cycle will remain different. However, the authors of this paper believe that further collaboration for the development of a common curriculum in digital curation can be built upon the many similarities over the entire life cycle.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Digital curation education is a new subject where the convergence between libraries, archives, museums and computer science seems to build an interdisciplinary bridge, with common competences needed by present and future professionals. The study methodology is based on: the literature review, on the proceedings of the Puerto Rico Conference organised by IFLA on \"Education for Digital Curation\" and on the findings of a Delphi study which has been done for a Thesis of the International Master DILL. Issues and problematic areas for further study and discussions are evidenced.","refs":[]}]}}