{"bibliography":{"title":"Collecting and Controlling Distributed Research Information by Linking to External Authority Data -A Case Study","authors":[{"person_name":{"surname":"Latif","first_name":"Atif"},"affiliations":[{"department":"ZBW -Leibniz Information Center for Economics","institution":null,"laboratory":null}],"email":"a.latif@zbw.eu"},{"person_name":{"surname":"Borst","first_name":"Timo"},"affiliations":[{"department":"ZBW -Leibniz Information Center for Economics","institution":null,"laboratory":null}],"email":"t.borst@zbw.eu"},{"person_name":{"surname":"Tochtermann","first_name":"Klaus"},"affiliations":[{"department":"ZBW -Leibniz Information Center for Economics","institution":null,"laboratory":null}],"email":"k.tochtermann@zbw.eu"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-11226-4_26","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Research information","Digital library","Authority data","Linked open data"],"citations":{"b0":{"title":"Exposing data from an open access repository for economics as linked data","authors":[{"person_name":{"surname":"Latif","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Borst","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Tochtermann","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":"http://www.dlib.org/dlib/september14/latif/09latif.html","publisher":null,"journal":"D-Lib Mag","series":null,"scope":null},"b1":{"title":"The Linked Open Data Cloud","authors":[],"date":null,"ids":null,"target":"https://lod-cloud.net/","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"The LOD landscape in libraries and beyond","authors":[{"person_name":{"surname":"Yoose","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Perkins","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Libr. Metadata","series":null,"scope":{"volume":13,"pages":{"from_page":197,"to_page":211}}},"b3":{"title":"The author challenge: identification of self in the scholarly literature","authors":[{"person_name":{"surname":"Rotenberg","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Kushmerick","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":{"DOI":"10.1080/01639374.2011.606405","arXiv":null},"target":"https://doi.org/10.1080/01639374.2011.606405","publisher":null,"journal":"Cat. Classif. Q","series":null,"scope":{"volume":49,"pages":{"from_page":503,"to_page":520}}},"b4":{"title":"Researcher and author profiles: opportunities, advantages, and limitations","authors":[{"person_name":{"surname":"Gasparyan","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Nurmashev","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Yessirkepov","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Endovitskiy","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Voronov","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Kitas","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":{"DOI":"10.3346/jkms.2017.32.11.1749","arXiv":null},"target":"https://doi.org/10.3346/jkms.2017.32.11.1749","publisher":null,"journal":"J. Korean Med. Sci","series":null,"scope":{"volume":32,"pages":{"from_page":1749,"to_page":1756}}},"b5":{"title":"Authority control: state of the art and new perspectives","authors":[{"person_name":{"surname":"Tillett","first_name":"B"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1,"to_page":48}}},"b6":{"title":"","authors":[{"person_name":{"surname":"Taylor","first_name":"Francis"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"Authority control in the context of bibliographic control in the electronic environment","authors":[{"person_name":{"surname":"Gorman","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":{"DOI":"10.1300/J104v38n03_03","arXiv":null},"target":"https://doi.org/10.1300/J104v38n0303","publisher":null,"journal":"Cat. Classif. Q","series":null,"scope":{"volume":38,"pages":{"from_page":11,"to_page":22}}},"b8":{"title":"Entities and identities in research information systems","authors":[{"person_name":{"surname":"Jörg","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Höllrigl","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Sicilia","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":"http://dspacecris.eurocris.org/handle/11366/102","publisher":null,"journal":null,"series":null,"scope":null},"b9":{"title":"Added value in the context of research information systems","authors":[{"person_name":{"surname":"Nabavi","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Jeffery","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Jamali","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.1108/PROG-10-2015-0067","arXiv":null},"target":"https://doi.org/10.1108/PROG-10-2015-0067","publisher":null,"journal":"Data Technol. Appl","series":null,"scope":{"volume":50,"pages":{"from_page":325,"to_page":339}}},"b10":{"title":"Linked library data: offering a backbone for the semantic web","authors":[{"person_name":{"surname":"Neubert","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Tochtermann","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-642-32826-8_4","arXiv":null},"target":"https://doi.org/10.1007/978-3-642-32826-84","publisher":"Springer","journal":null,"series":null,"scope":{"volume":295,"pages":{"from_page":37,"to_page":45}}},"b11":{"title":"WorldCat Identities","authors":[],"date":null,"ids":null,"target":"https://www.worldcat.org/identities/","publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Discovery and construction of authors' profile from linked data (A case study for open digital journal)","authors":[{"person_name":{"surname":"Latif","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Afzal","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Helic","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Tochtermann","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Maurer","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2010","month":"04","day":"27"},"ids":null,"target":null,"publisher":null,"journal":null,"series":"CEUR Workshop Proceedings","scope":null},"b13":{"title":"ORCID Integration","authors":[{"person_name":{"surname":"Bollini","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":"https://www.econstor.eu/18","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Platforms for digital libraries have become the gateway for the dissemination and provision of scientific publications. However, recent advancements in Open Access and Open Science require digital libraries to transform their publication centered model. At current state of affairs, digital libraries are striving for the acquisition and management of supplementary digital science artifacts such as datasets, software and learning resources. Many of these artifacts are managed by open access repositories that foster the integration with a digital library setup [1]. Open access repositories provide users with barrier free access to scientific resources and already play a significant role in the dissemination of scientific results and the increase of author visibility. However, apart from providing freely available resources, these repositories are not well connected with respect to their metadata.","refs":[{"start":564,"end":567,"marker":"bibr","target":"#b0"}]},{"text":"Basically, we see two challenges for traditional information systems relying on biographical information. The first challenge is that we are facing a landscape of distributed research information residing on different server locations, preventing us from scanning the current information space at a glance. Search engines had been introduced to handle this issue, but they are still quite weak in identifying information in terms of authorship or provenance. This leads us to the second challenge: with information often being redundantly published and distributed, it becomes uncontrolled in the sense that it is often unclear which person in fact is accountable for a piece of scientific information. We therefore suggest to tackle these two challenges by linking distributed research information to external authority data that is preferably exposed as linked open data (LOD). Through this study, we want to emphasize that a well linked and connected open access repository can provide users with author related information that promote persons in their role as contributors.","refs":[]},{"text":"From long, libraries have used authority control files for the unique identification and better organization of bibliographic data. Authority control uses a unique heading or a numeric identifier to identify entities such as persons, subjects or affiliations. It has helped libraries to make bibliographic information less ambiguous and better findable. For instance, the Integrated Authority File (German: Gemeinsame Normdatei, also known as: Universal Authority File) or GND is an authority file particularly used for the organization and cataloging of names, subject terms and corporate bodies.","refs":[]},{"text":"The program of LOD, on the other hand, stresses the significance of open and machine readable structured data for the purpose of unique identification, open data publishing and cross-linkage of (related) digital resources. Throughout the last decade, it has yielded a bunch of open, structured and interlinked heterogeneous datasets [2]. Moreover, it has inspired various national and international libraries to provide their catalog data [3] and authority control files as LOD. These authority data files were subsequently reused and interlinked by popular LOD hubs like DBPedia, Wikidata or FreeBase. In summary, both developments with respect to authority data and LOD converge to solve the problem of identification and reliable linking of resources across different domains.","refs":[{"start":333,"end":336,"marker":"bibr","target":"#b1"},{"start":439,"end":442,"marker":"bibr","target":"#b2"}]}]},{"title":"Related Work","paragraphs":[{"text":"The work of this paper touches several aspects that are subject to ongoing research in information practice and computer science. [4,5] provide an overview of the whole topic, while [6] addresses the topic of authority data for persons from the classic viewpoint of cataloging as a more formal and context independent endeavour. [7] focuses more on potential usage application scenarios where authority data can unfold its full potential. Apart from the decision which descriptive information to be included in an authority record, there are several models for maintaining authority data: from a library-centered approach to automatic clustering to a more community-based effort, giving researchers the opportunity to claim their (suggested) publications [8][9][10]. With respect to identifiers for researchers and related systems for current research information (CRIS), [11] address the need to integrate internal names with external identifiers, while [12] focus more on additional and proprietary data to be managed by CRIS, neglecting the fact that those systems presuppose a certain data infrastructure that must be established yet. [13] identifies the opportunities for authority resp. library data serving as a backbone for the Semantic Web. Pages with scholar profiles already had been introduced approximately ten years ago by libraries [14], search engines [8] and publishers [10], but with a focus on global visibility and access, rather than local and contextual linking [15]. In that sense, there are efforts to conduct author identification already during the early stage of publishing by assigning a temporary ORCID key to a metadata field inside a DSpace system, so that a local researcher profile can be generated and associated with the publication(s) [16].","refs":[{"start":130,"end":133,"marker":"bibr","target":"#b3"},{"start":133,"end":135,"marker":"bibr","target":"#b4"},{"start":182,"end":185,"marker":"bibr","target":"#b5"},{"start":329,"end":332,"marker":"bibr","target":"#b7"},{"start":755,"end":758,"marker":"bibr","target":null},{"start":758,"end":761,"marker":"bibr","target":null},{"start":761,"end":765,"marker":"bibr","target":null},{"start":872,"end":876,"marker":"bibr","target":"#b8"},{"start":955,"end":959,"marker":"bibr","target":"#b9"},{"start":1139,"end":1143,"marker":"bibr","target":"#b10"},{"start":1347,"end":1351,"marker":"bibr","target":"#b11"},{"start":1484,"end":1488,"marker":"bibr","target":"#b12"},{"start":1771,"end":1775,"marker":"bibr","target":"#b13"}]}]},{"title":"Motivation","paragraphs":[{"text":"At our institution, we run an open access repository named EconStor [17]. Currently it comprises more than 150k publications from Economics, most of them being working papers. EconStor has contributions from more than 100k authors, with more than 1000 persons contributing more than 20, and 27 persons contributing more than 100 publications (cf. Fig. 1).","refs":[{"start":68,"end":72,"marker":"bibr","target":null},{"start":352,"end":353,"marker":"figure","target":null}]}]},{"title":"Fig. 1. Distribution of bibliographic databases in EconBiz subject portal","paragraphs":[{"text":"Although EconStor items are mainly crawled by search engines (in particular Google Scholar), the repository provides its own interface with jump off pages, web statistics and a local search engine. To promote its content even better, but also to normalize, to cluster and to enrich it, we decided to introduce author pages into the application, which reflect both a researcher's local output in EconStor and his or her contextual scholarly record that is compiled from our subject portal EconBiz.","refs":[]},{"text":"Before we step into the details of our data processing, we want to point out that this work is primarily not concerned with the classic topic of disambiguating persons, e.g. by their publications, citations or co-author networks. Rather, we take a pragmatic attitude towards this issue by identifying those authors which are already associated with an identifier as part of a larger identifier system and maintenance workflow. In the following, we particularly make use of the GND identifier for persons provided by the German National Library, and the handle URLs of EconStor publications.","refs":[]}]},{"title":"Datasets","paragraphs":[{"text":"Given below are the details of the datasets and authority data which we use in our work.","refs":[]}]},{"title":"EconStor","paragraphs":[{"text":"For the purpose of our analysis and showcase application, we used a EconStor dataset dump from April 2016 that is made available as LOD since 2014 [1]. As of April 2016, the data set consists of 111107 publications with which 218185 author names are associated.","refs":[{"start":147,"end":150,"marker":"bibr","target":"#b0"}]}]},{"title":"Econis","paragraphs":[{"text":"ECONIS is the catalogue of the German National Library of Economics being completely integrated into the EconBiz search portal [18]. It includes title records for indexed literature and subject specific information procured by the German National Library of Economics. ECONIS contains more than five million title records, most of them manually linked to a GND identifier.","refs":[{"start":127,"end":131,"marker":"bibr","target":null}]}]},{"title":"Integrated Authority File (GND)","paragraphs":[{"text":"According to the German National Library (DNB), the GND is a dataset for describing and identifying persons, corporate bodies, conferences and events, geographic information, topics and works [19]. Centrally provided by the DNB, the data is constantly maintained by several other national and university libraries, requiring a mandate to introduce or to update central information on e.g. a new researcher. By cataloging EconStor authors, they will be associated with a GND identifier according to the general cataloging rules. As a national contribution, the GND dataset is integrated into the VIAF authority file.","refs":[{"start":192,"end":196,"marker":"bibr","target":null}]}]},{"title":"Wikidata","paragraphs":[{"text":"Since its launch in 2012, Wikidata has become one of the major connecting data hubs and has been created to support roughly 300 Wikimedia projects. Despite of interlinking all Wikipedia pages to the relevant items, it also connects more than 1500 sources of (national) authority data files. The biographical information aggregated and linked by Wikidata is taken from different sources, in the first place maintained and updated by editors, if not by the communities or the authors themselves (in contrast to GND, which is maintained only by dedicated supporting library staff). Hence, it may prove to be both the most up-to-date and accurate source despite a certain likelihood to provide wrong or even manipulated data. Linking to Wikidata resp. to other connected identifier systems is a means for associating names with persons. Currently, in total Wikidata has more than 4.29 million persons listed as items, from which more than 509K persons have GND identifier and more than 25K persons are listed as economists (according to Wikidata property p106:occupation) with approximately 11743 represented with GND identifier. This distribution is shown in the scattered Venn diagram (Fig. 2). ","refs":[{"start":1189,"end":1190,"marker":"figure","target":"#fig_0"}]}]},{"title":"Study and Showcase Application","paragraphs":[{"text":"Given below are the details of a multi-stage approach which we employed for linking the EconStor authors with external identifiers. It is important to note that the approach is specific with respect to the local data sources (ECONIS, EconStor) and identifiers it processes. On the other hand, it might serve as an example for globalizing and contextualizing those data sources by means of commonly used identifier systems such as handles or data hubs like Wikidata. An illustration of this multi-stage approach is given in Fig. 3.","refs":[{"start":528,"end":529,"marker":"figure","target":"#fig_1"}]}]},{"title":"Locating the GND-ID of the Authors from ECONIS Database","paragraphs":[{"text":"To conduct this step, we first transformed the recent ECONIS database from native PICA into JSON format for better processing. We then used a Perl script to search for all EconStor publications whose authors are assigned with a GND identifier, listing them in a data table. The script returns the Handle URL of In a following step, we matched the Handle URLs from the results with Econ-Stor publications to retrieve the EconStor publication id and its corresponding author(s). Afterwards, we reconciled the names of authors from EconStor with the listed GND authors, so that the EconStor authors become assigned a GND-ID (at this stage, outside of the repository application). Thus we were able to answer the following basic questions:","refs":[]},{"text":"How many EconStor names are already associated with a GND-ID (according to our catalog)?","refs":[]},{"text":"We found that 114185 out of 218185 EconStor names have valid GND identifiers according to ECONIS records. In distinct numbers, 25461 GND identified authors contributed to 69588 EconStor publications, which already is a good percentage (37%), but still quite incomplete with respect to a total of 111107 publications. Hence we considered introducing author pages at least for the most active researchers in terms of publishing.","refs":[]}]},{"title":"Are the most publishing EconStor authors already provided with a GND-ID in ECONIS?","paragraphs":[{"text":"For determining the most publishing authors, we set the number of publication threshold to 25. We found that there are 1121 authors contributing at least 25 publications to our EconStor repository. By applying the same condition to our analysis, we found that 750 out of those most publishing 1121 authors are already associated with a GND-ID (67%), so this looked like a good basis to us.","refs":[]}]},{"title":"Search and Locate Additional Author Related Identifiers via Wikidata","paragraphs":[{"text":"The next step of our multistage approach is to query, search and connect with additional external identifier systems apart from GND. The primary reason for this is to find out the coverage of different identifier systems, and to prove our preference for GND. In our context, the most common additional identifier systems are:","refs":[]},{"text":"-VIAF as the international authority dataset provided by OCLC, -RePEc author service as the largest identifier inventory for researchers in economics, -ORCID as being promoted by the publishing industry, and -Wikidata as a community endeavour and central data hub aggregating all the aforementioned identifier systems.","refs":[]},{"text":"We looked up EconStor distinct author names by the following listed SPARQL query to the endpoint provided by Wikidata (to be more precise, we setup a local endpoint by ourselves). As a result, with reference to the baseline of 25461 GND identified EconStor authors, we got 1780 matches to Wikidata items, including 1775 matches to VIAF items, including 465 matches to RePEc items, and including another 44 matches to ORCID identifiers. Overall, approximately 7% of total 25461 distinct EconStor authors are associated with a different identifier system than GND, cf. Fig. 4. By analysing the results again, we found a critical mass of the prominent EconStor authors (more than 25 publications) who have additional external identifiers along with bibliographical and biographical information (most of them from Wikidata and VIAF). This is adequate enough to build a proof of concept application for author profiles which is accessible at: http://beta.econbiz.de/atif/. ","refs":[{"start":572,"end":573,"marker":"figure","target":null}]}]},{"title":"Proof of Concept Application","paragraphs":[{"text":"To showcase the initial idea of a scholar's profile page in this proof of concept application, users are provided with an index page where all of the prominent authors are listed with their name and the hyperlink to the corresponding author page. When a user clicks on the link, the profile page is generated on the fly with biographical information queried and collected from external identifier systems. In addition, bibliographical information is compiled from publication lists both from the local repository (EconStor) and our subject portal as external bibliographic data source (EconBiz). An automatically generated author profile page of \"Dennis J. Snower\" is accessible at: https://tinyurl.com/yc9xd4d8.","refs":[]}]},{"title":"Conclusion and Future Work","paragraphs":[{"text":"We demonstrated how to collect and reconcile distributed research information by means of automatic interlinking between different biographical sources. The approach relies fundamentally on the identification of persons by linking their names to identifier systems, which originally has been an intellectual or manual cataloging workflow. Hence, the approach does support neither the identification of an author nor the de-duplication of his or her works, but the controlled aggregation across different sources by means of intermediary datahubs. In this respect, we emphasized on the use of sources for authority data such as GND file, and showcased how Wikidata can be used as a connecting hub to find author related information. We are of the view that our study of author data linking service can be a reference enabler for the Digital Libraries to contribute for the digitization of science cause. As future work, we would like to expand the publication list of author by including other external sources, and secondly we would like to investigate the opportunities for enriching Wikidata both by editorial means and by bots, the latter to bypass rather static and cumbersome library workflows.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"With respect to the world wide web, scientific information has become distributed and often redundantly held on different server locations. The vision of a current research information system (CRIS) as an environment for constant monitoring and tracking of a researcher's output has become vivid, but still fighting with issues like legacy information and institutional repository structures to be established yet. We therefore suggest to gather those scattered research information through identifying its authors by means of authority data already associated with them. We introduce author pages as a proof-of-concept application collecting research information not only from a local source such as an institutional repository, but also from other external bibliographic sources.","refs":[]}]}}