{"bibliography":{"title":"The PREFORMA Project: Federating Memory Institutions for Better Compliance of Preservation Formats","authors":[{"person_name":{"surname":"Cappellato","first_name":"Linda"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"cappellato@dei.unipd.it"},{"person_name":{"surname":"Ferro","first_name":"Nicola"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"ferro@dei.unipd.it"},{"person_name":{"surname":"Fresa","first_name":"Antonella"},"affiliations":[],"email":"fresa@promoter.it"},{"person_name":{"surname":"Geber","first_name":"Magnus"},"affiliations":[{"department":null,"institution":"National Archives of Sweden","laboratory":null}],"email":"magnus.geber@riksarkivet.se"},{"person_name":{"surname":"Justrell","first_name":"Börje"},"affiliations":[{"department":null,"institution":"National Archives of Sweden","laboratory":null}],"email":"borje.justrell@riksarkivet.se"},{"person_name":{"surname":"Lemmens","first_name":"Bert"},"affiliations":[{"department":"Centre of Expertise in Digital Heritage","institution":null,"laboratory":null}],"email":null},{"person_name":{"surname":"Prandoni","first_name":"Claudio"},"affiliations":[],"email":"prandoni@promoter.it"},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"silvello@dei.unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"Deliverable D8.1 -Competitive Evaluation Strategy","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Lemmens","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2014","month":"12","day":null},"ids":null,"target":"http://www.digitalmeetsculture.net/wp-content/uploads/2014/12/PREFORMAD8.1Competitive-evaluation-strategyv1.0no-appendix.pdf","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":619568,"to_page":619568}}},"b1":{"title":"European Commission: Innovation Procurement -The power of the public purse","authors":[],"date":{"year":"2014","month":"05","day":null},"ids":null,"target":"http://ec.europa.eu/informationsociety/newsroom/cf/dae/document.cfm?docid=5443","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Digital audio interface -Part 1: General","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Electronic still-picture imaging -Removable memory -Part 2: TIFF/EP image data format","authors":[],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Graphic technology -Prepress digital data exchange -Tag image file format for image technology (TIFF/IT)","authors":[],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"ISO 14721: Space data and information transfer systems -Open archival information system (OAIS) -Reference model","authors":[],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Information technology -JPEG 2000 image coding system: Core coding system","authors":[],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"Deliverable D2.2 -Tender Specifications","authors":[{"person_name":{"surname":"Lemmens","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Elfner","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Lundell","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Prandoni","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Fresa","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2014","month":"06","day":null},"ids":null,"target":"http://www.digitalmeetsculture.net/wp-content/uploads/2014/05/PREFORMAD2.2Tender-Specificationsv2.1.pdf","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":619568,"to_page":619568}}},"b8":{"title":"The Consultative Committee for Space Data Systems (CCSDS): Reference Model for an Open Archival Information System (OAIS). Magenta Book","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":2,"pages":null}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Memory institutions, in Europe and elsewhere, are facing a situation when transfers of electronic documents or other electronic media content for long term preservation are continuously increasing. Data are normally stored in specific file formats for documents, images, sound, video etc. that are produced by software from different providers. This software is controlled neither by the institution that produces the files, nor by the institution that holds the archive. There is a risk that data objects meant for preservation, passing through an uncontrolled generative process, can jeopardise the whole preservation exercise.","refs":[]},{"text":"PREservation FORMAts for culture information/e-archives (PREFORMA) 1 is a Pre-Commercial Procurement (PCP) project (2014-2017), co-funded by the European Commission under its FP7-ICT Programme. Its main objective is to give memory institutions full control of the process for testing the conformity of files to be ingested into their archives. This shall be obtained by developing a set of tools which will enable the testing process to happen within an iteration that is under full control of the institutions.","refs":[]},{"text":"The paper is organized as follows: Sect. 2 provides an overview of the PCP instrument; Sect. 3 describes the overall approach adopted by the PREFORMA project for facing the problem of conformance check of file formats for long-term preservation; finally, Sect. 4 briefly reports on the current status of the project.","refs":[]},{"text":"2 Pre-Commercial Procurement PCP2 is an instrument which has been pioneered by the European Commission in the FP7 and is now fully part of Horizon 2020. PCP is appropriate when the required improvements are so technologically demanding that there are no nearto-the-market solutions yet and new R&D is needed. PCP can then be used to compare the pros and cons of alternative competing approaches and to de-risk the most promising innovations step-by-step via solution design, prototyping, development and first product testing.","refs":[{"start":32,"end":33,"marker":null,"target":"#foot_0"}]},{"text":"PCP is a competition-like procurement method which enables public sector bodies to engage with innovative businesses and other interested organisations in development projects, to arrive at innovative solutions that address specific public sector challenges and needs. The new innovative solutions are created through a phased procurement of development contracts to reduce risk.","refs":[]},{"text":"PCP operates by clustering together stakeholders in a given domain -memory institutions in the case of PREFORMA -which group together in order to face a common technological challenge. The stakeholders consortium is in charge of describing the expected technological solution, specifying its needed features and characteristics, and defining how alternative approaches will be compared and assessed in order to understand their pros and cons. The consortium manages an open call for tenders where technological suppliers can apply and the selected suppliers will go ahead with the design and implementation of the requested technological solution. The consortium is responsible for monitoring the progress of the suppliers work towards the first product testing and for evaluating the final solution developed by the suppliers in order to understand which one best fits with their actual needs.","refs":[]},{"text":"Several areas are now experimenting the PCP instrument with a range of successful projects: health care and elderly care, transportation, energy, education, safety and public administration [2].","refs":[{"start":190,"end":193,"marker":"bibr","target":"#b1"}]},{"text":"The PCP instrumente has several benefits, among which, to help:","refs":[]},{"text":"-driving innovation in the public sector; -reducing fragmentation in the demand of the public sector; -stimulating the ICT developers to offer more challenging solutions; -reducing the time-to-market of high-tech solutions.","refs":[]},{"text":"Moreover, in some areas where there is less abundance of funding, as it is often the case of cultural heritage, grouping together stakeholders may help in promoting the development of required technologies whose costs would not be affordable by the single stakeholder alone.","refs":[]}]},{"title":"The PREFORMA Approach","paragraphs":[{"text":"PREFORMA aims to establish a set of tools and procedures for gaining full control over the technical properties of digital content intended for long-term preservation by memory institutions [11].","refs":[{"start":190,"end":194,"marker":"bibr","target":"#b7"}]},{"text":"The procurement, following the rules for tenders in public sector, will match the memory institutions professional knowledge and the supplier's skills in development and promotion of products, creating a win-win situation. Joint procurement enables PREFORMA to build a sustainable network of common interest, where the public procurers can remain in contact and cooperate beyond the EC funding period.","refs":[]},{"text":"The main objective of the project is the development and deployment of an open source software licensed reference implementation for file format standards aimed for any memory institution (or other organisation with a preservation task) wishing to check conformance with a specific standard. This reference implementation, called the conformance checker will consist of a set of modular tools, which will be validated against specific implementations of specifications of standards relevant to the PREFORMA project and used by the European memory institutions for preserving their different kind of data objects.","refs":[]},{"text":"In order to demonstrate effectiveness (and refine) these conformance checkers, they will be developed in an iterative process with multiple releases and with a number of experiments with \"real\" data sets (files) from memory institutions during each iteration.","refs":[]},{"text":"A conformance checker:","refs":[]},{"text":"-verifies whether a file has been produced according to the specifications of a standard file format, and hence, -verifies whether a file matches the acceptance criteria for long-term preservation by the memory institution, -reports in human and machine readable format which properties deviate from the standard specification and acceptance criteria, and -performs automated fixes for simple deviations in the metadata of the preservation file.","refs":[]},{"text":"The conformance checker software developed by PREFORMA is intended for use within the Open Archival Information System (OAIS) Reference Framework [6] and development is guided by the user requirements provided by the memory institutions that are part of the PREFORMA consortium. The conformance checker facilitates memory institutions in obtaining sufficient control of the information in an OAIS Archive, provided to the level needed to ensure Long Term Preservation [12]. In particular, the conformance check enables implementation of the following OAIS functions [12]: (i) Quality assurance at ingestion, validating the successful transfer of the Submission Information Package (SIP) to the temporary storage area; (ii) Generate AIP at ingestion, transforming one or more SIPs into one or more Archival Information Packages (AIPs) that conform to the Archives data formatting standards and documentation standards; and, (iii) Archival Information Update at ingestion, providing a mechanism for updating (repackaging, transformation) the contents of the Archive.","refs":[{"start":146,"end":149,"marker":"bibr","target":"#b5"},{"start":468,"end":472,"marker":"bibr","target":"#b8"},{"start":566,"end":570,"marker":"bibr","target":"#b8"}]},{"text":"The media types addressed by PREFORMA are: (i) text for establishing a reference implementation for PDF/A [7-9]; (ii) images for establishing a reference implementation for uncompressed TIFF [4,5]; and, (iii) audio-video for establishing a reference implementation for an audiovisual preservation file, using FFV13 , Dirac4 or JPEG2000 [10] for encoding video or moving image, uncompressed LPCM [3] for encoding sound and MKV5 or OGG 6 for wrapping audioand video-streams in one file.","refs":[{"start":191,"end":194,"marker":"bibr","target":"#b3"},{"start":194,"end":196,"marker":"bibr","target":"#b4"},{"start":313,"end":314,"marker":null,"target":"#foot_1"},{"start":322,"end":323,"marker":null,"target":"#foot_2"},{"start":336,"end":340,"marker":"bibr","target":"#b6"},{"start":395,"end":398,"marker":"bibr","target":"#b2"},{"start":425,"end":426,"marker":null,"target":"#foot_3"},{"start":434,"end":435,"marker":null,"target":"#foot_4"}]},{"text":"The experience of applying the reference implementation to the format standards and other observations from the development will be used by PREFORMA to give feedback to relevant standardization organizations and other relevant stakeholder groups (e.g. legislators and other suppliers). Such feedbacks can be used to detail the precise interpretation of the specification during the creation of new versions of the standards.","refs":[]}]},{"title":"Status of PREFORMA","paragraphs":[{"text":"PREFORMA has been launched in January 2014 and, on April 4th, 2014, it organised an Information Day7 event in Brussels to present the call for tender, which has been launched as part of the PCP.","refs":[{"start":99,"end":100,"marker":null,"target":"#foot_5"}]},{"text":"The call for tender opened on June 12th, 2014 and closed on August 12th, 2014 with a budget of 2,805,000 euros. 16 high-quality proposals have been submitted to the call out of which 6 have been selected8 for continuing with the subsequent first design phase, which started in November 2014.","refs":[{"start":203,"end":204,"marker":null,"target":"#foot_6"}]},{"text":"The first design phase will terminated in late February 2015 and the 6 suppliers which won the tender have been evaluated again according to well-defined criteria [1] in order to select those worth continuing with the subsequent development phase. The outcomes of the first evaluation phase have been reported on early March 2015 during a workshop which will be organized in Brussels9 .","refs":[{"start":163,"end":166,"marker":"bibr","target":"#b0"},{"start":383,"end":384,"marker":null,"target":"#foot_7"}]},{"text":"After having analyzed the technical and functional specifications submitted by the six groups that completed the design phase, PREFORMA chose the three consortia awarded with contracts for the prototyping phase, which will last until December 2016.","refs":[]},{"text":"The three awardees are the veraPDF Consortium (led by the Open Preservation Foundation and the PDF Association), who is working on the compliance checker for the PDF/A standard for documents; Easy Innova, who is working on the TIFF standard for digital still images; and MediaArea, who is working on a set of open source standards for moving images, namely: the Matroska wrapper, the FFv1 video codec and LPCM for audio streams.","refs":[]},{"text":"Connected to their work in PREFORMA Easy Innova and their partner University of Basel are leading an initiative to create an ISO Standard to optimize the TIFF format definition for archival purposes, the so called TI/A Standard Initiative 10 .","refs":[{"start":239,"end":241,"marker":null,"target":"#foot_8"}]},{"text":"The first releases of the conformance checkers, developed by the three suppliers during the first part of the prototyping phase, are now available for download on the Open Source Portal section of the PREFORMA website 11 . This section provides an overview and references to each open source project, acting as an entry point for all interested suppliers and memory institutions and allowing easy navigation to all externally hosted resources.","refs":[{"start":218,"end":220,"marker":null,"target":"#foot_9"}]},{"text":"The preliminary result of the prototyping phase will be presented and demonstrated during the \"Open Source Preservation Workshop Serving the Cultural Heritage\", the first in a series of international events planned by PREFORMA. The workshop will take place in Stockholm on April 7, 2016, and will be hosted at the National Library of Sweden 12 .","refs":[{"start":341,"end":343,"marker":null,"target":"#foot_10"}]},{"text":"The event will feature keynote presentations by representatives from the PREFORMA project and the open source community, live demonstrations of the three conformance checkers for electronic documents, images and AV files by the suppliers working in the project (veraPDF, Easy Innova, MediaArea) and an informal networking event where all the attendees can share experiences, meet the PREFORMA developers and learn about the tools.","refs":[]},{"text":"This event is aimed at anyone interested in digital preservation and cultural heritage: developers who want to contribute code to the PREFORMA tools; memory institutions or other cultural heritage organisations involved in (or planning) digital preservation initiatives; standardisation bodies maintaining the technical specifications of preservation file formats; any other person interested in cooperating with us in defining open digital preservation standards.","refs":[]},{"text":"In addition to the public events, PREFORMA is very much committed to communicate online with its community. To this aim, the project developed two instruments that are constantly updated and monitored to exchange ideas and get feedbacks from all the interested people: the project website13 and the project blog14 . Furthermore, fruitful cooperation has been established with many other institutions, organisations and projects that expressed their interest to cooperate with PREFORMA to test the software prototypes and to improve the conformance checkers. In this light, it is worth citing BenchmarkDP15 , an interdisciplinary multi-year research project funded by the Vienna Science and Technology Fund, and Europeana Space16 , an EU-funded CIP Best Practice Network. In the first case, methodologies and approaches of BenchmarkDP could be useful in PREFORMA in establishing an objective frame of reference for the evaluation of the conformance checkers, while in the second case the aim is to test the integration of the open source conformance checkers in the Technical Space developed by Europeana Space.","refs":[{"start":288,"end":290,"marker":null,"target":"#foot_11"},{"start":311,"end":313,"marker":null,"target":"#foot_12"},{"start":603,"end":605,"marker":null,"target":"#foot_13"},{"start":726,"end":728,"marker":null,"target":"#foot_14"}]},{"text":"Overall, the experience of PREFORMA is demonstrating that putting in place a joint PCP is very challenging, but it is also offering an opportunity of growth and learning, not only for the procurers (namely the memory institutions) but also for the technical partner who are supporting the implementation of the call.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"describe the motivations, objectives and organization of the PREservation FORMAts for culture information/ e-archives (PREFORMA) project, a Pre-Commercial Procurement (PCP) project focused on conformity check of ingested files for the longterm preservation.","refs":[]}]}}