{"bibliography":{"title":"Finding a Needle in a Haystack The BEIC Digital Library in Search of Its Space on the Web: A Case Study","authors":[{"person_name":{"surname":"Consonni","first_name":"Chiara"},"affiliations":[{"department":null,"institution":"Fondazione BEIC","laboratory":null}],"email":"chiara.consonni@beic.it"},{"person_name":{"surname":"Weston","first_name":"Paul"},"affiliations":[{"department":null,"institution":"University of Pavia","laboratory":null}],"email":"paul.weston@unipv.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1_18","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Partnership","Dissemination","Digital library","Assessment","Beic","Identity","Community involvement","Statistics","Navigator","Online exhibition"],"citations":{"b0":{"title":"Information and institutional change: the case of digital libraries","authors":[{"person_name":{"surname":"Agree","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":85,"to_page":118}}},"b1":{"title":"Assessing digital library services: approaches, issues, and considerations","authors":[{"person_name":{"surname":"Bertot","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2004","month":"05","day":null},"ids":null,"target":"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.114.7060&rep=rep1&type=pdf","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Digital Library Use: Social Practice in Design and Evaluation","authors":[{"person_name":{"surname":"Bishop","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Van House","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Buttenfield","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":null},"b3":{"title":"CERL Papers VII: Imprints and owners. Recording the cultural geography of Europe","authors":[],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"Consortium of European Research Libraries","journal":null,"series":null,"scope":null},"b4":{"title":"DELOS: Delos WP7 Evaluation Workpackage: Bibliography","authors":[],"date":{"year":"2005","month":"05","day":null},"ids":null,"target":"http://dlib.ionio.gr/wp7","publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Thirteen ways of looking at libraries, discovery, and the catalog: scale, workflow, attention","authors":[{"person_name":{"surname":"Dempsey","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2012","month":"12","day":null},"ids":null,"target":"http://www.edu-cause.edu/ero/article/thirteen-ways-looking-libraries-discovery-and-catalog-scale-work-flow-attention","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Fund raising e identità istituzionale della biblioteca: quale rapporto?","authors":[{"person_name":{"surname":"Di Domenico","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":"http://bollettino.aib.it/article/view/5573/5317","publisher":null,"journal":"Bollettino AIB","series":null,"scope":{"volume":45,"pages":{"from_page":467,"to_page":476}}},"b7":{"title":"Provenance records in the CERL Thesaurus and in Material Evidence in Incunabula. Sborník Národního muzea","authors":[{"person_name":{"surname":"Dondi","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Acta Musei Nationalis Pragae, series C -Historia Litterarum","series":null,"scope":{"volume":58,"pages":{"from_page":15,"to_page":19}}},"b8":{"title":"Material evidence in incunabula","authors":[{"person_name":{"surname":"Dondi","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Ledda","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"La Bibliofilìa","series":null,"scope":{"volume":113,"pages":{"from_page":375,"to_page":381}}},"b9":{"title":"Biblioteca: una definizione non-pretecnica. L'importanza del Piano di comuni cazione","authors":[{"person_name":{"surname":"Ferri","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2010","month":"12","day":null},"ids":null,"target":"http://www.bibliotecheoggi.it/2010/201000804601.pdf","publisher":null,"journal":"Biblioteche Oggi","series":null,"scope":null},"b10":{"title":"Six steps to effective evaluation: A handbook for programme and project managers","authors":[{"person_name":{"surname":"Ltd","first_name":"Glenaffric"},"affiliations":[],"email":null}],"date":{"year":"2007","month":"05","day":null},"ids":null,"target":"http://www.jisc.ac.uk/media/documents/funding/project_management/evaluationhand-book0207.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"#Sveglia museo. Comunicare la cultura online: una guida pratica per i musei","authors":[{"person_name":{"surname":"Gottardo","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"D'amore","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Gasparotti","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Raimondi Cominesi","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2014","month":"12","day":null},"ids":null,"target":"http://www.svegliamuseo.com/en","publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"INDICATE: Handbook on virtual exhibitions and virtual performances","authors":[],"date":{"year":"2012","month":"12","day":null},"ids":null,"target":"http://www.digitalmeetsculture.net/article/handbook-on-virtual-exhibitions-and-virtual-performances/","publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"JISC: Make your digital resources easier to discover","authors":[],"date":{"year":"2014","month":"12","day":null},"ids":null,"target":"http://www.jisc.ac.uk/guides/make-your-digital-resources-easier-to-discover","publisher":null,"journal":null,"series":null,"scope":null},"b14":{"title":"Blue Ocean Strategy: How to Create Uncontested Market Space and Make the Competition Irrelevant","authors":[{"person_name":{"surname":"Kim","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Mauborgne","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"Harvard Business School Press","journal":null,"series":null,"scope":null},"b15":{"title":"Developing the DigiQUAL protocol for digital library evaluation","authors":[{"person_name":{"surname":"Kyrillidou","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Giersch","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b16":{"title":"Colliding with the real world: heresies and unexplored questions about audience, economics, and control of digital libraries","authors":[{"person_name":{"surname":"Lynch","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":191,"to_page":217}}},"b17":{"title":"The people in digital libraries: multifaceted approaches to assessing needs and impact","authors":[{"person_name":{"surname":"Marchionini","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Plaisant","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Komlodi","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":119,"to_page":160}}},"b18":{"title":"MINERVA: Handbook on cultural Web user interaction","authors":[],"date":{"year":"2008","month":"05","day":null},"ids":null,"target":"http://www.minervaeurope.org/publications/handbookwebusers-firstdraft-june08.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b19":{"title":"How were digital libraries evaluated?","authors":[{"person_name":{"surname":"Saracevic","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2004","month":"05","day":null},"ids":null,"target":"http://comminfo.rutgers.edu/*tefko/DL_evaluation_LIDA.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b20":{"title":"Users' evaluation of digital libraries (DLs): their uses, their criteria, and their assessment","authors":[{"person_name":{"surname":"Xie","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Inf. Process. Manag","series":null,"scope":{"volume":44,"pages":{"from_page":1346,"to_page":1373}}}},"sections":[{"title":"BEIC Assessment","paragraphs":[{"text":"By no means has BeicDL dimensions, ambitions, scopes and resources in any way comparable to those implemented by the previous two projects. Nonetheless, the management has felt obliged to assess its own perspectives and to try and profit from any preexistent experience. To this purpose BeicDL was submitted to a SWOT analysis which provided the results shown in the table below (Table 1). Data offered by the SWOT analysis enable us to make some broad reflections, before proceeding to a description of the implemented strategies, along with more specific considerations [10].","refs":[{"start":386,"end":387,"marker":"table","target":"#tab_0"}]}]},{"title":"Preliminary Reflections","paragraphs":[{"text":"In the first place, the recent history of BeicDL should be taken into account. Many libraries, some Italian ones in particular, find it difficult to combine efficiently their own history and their consolidated traditions with the perspectives opened by new services, renovated operating methods, and users still to be identified to whom to target their wealth of knowledge [7]. In several cases, this has led to the creation of digital libraries whose documents are treated as museum pieces, rather than published following criteria consistent with the digital environment within which they fall. This choice (or missed choice, if you prefer) can be explained in various ways: preference given to the text as the principal medium in transferring knowledge; difficulty in keeping separate the wealth of knowledge from the items hosting this knowledge (in regard to this, one could recall the difference between \"bibliotheca\", the bibliography, and \"biblioteca\", the actual library); granting the new search tools (Google, Wikipedia etc.) a lesser status than their printed equivalents; perceiving virtual exhibitions, educational tools and the alike, as trivial compared with the \"high\", professional service the library is bound to provide; last but not least, difficulties to implement new procedures and commitments given the hard times most libraries are currently facing, both in terms of cutbacks and falling staff turnover rates, the latter being of course a very critical issue [6].","refs":[]},{"text":"BeicDL is therefore offered the opportunity of thinking in a native digital way, notwithstanding its commitment to be a library in the first place. The presence of young, strongly motivated staff, with a wide spectrum of work experience to get a feel for professional working environments and the taste for new means of expression in their background, provides BeicDL with a richness of opportunities. With their guidance, BeicDL is committed to experiment new ways, to secure alliances, to identify and implement data and service models coming from fields other than libraries and the cultural heritage whenever deemed strategical. In these cases conformity to national and international standards is obviously a basic requirement. Customizations that in the short term could be felt as shortcuts leading to taylor-made products, in the case of subjects the size of BeicDL turn after a short period to be way too expensive to maintain and upgrade, therefore contributing to the library's alienation from the web community.","refs":[]}]},{"title":"Swimming in a Blue Ocean","paragraphs":[{"text":"Secondly, BeicDL should give special attention to identifying ways in which it can have its own identity, despite the absence of a physical library to rely upon. This has to do with going beyond the idea of an individual library and finding, instead, its own setting, its role within the digital ecosystem [17]. In order to explain the underlying philosophy of BeicDL's strategic choices, inasmuch as its physical component was becoming more and more remote, we should turn to the Blue Ocean Strategy (BOS) metaphor, an economic theory proposed by W. Chan Kim and Renée Mauborgne (2005). Its most successful implementation in the field of cultural heritage is probably the Cirque du Soleil case. Created in 1984 by a small group of underground street performers, the Cirque was seen thereafter by more than thirty-five million people all around the world. Due to the existence of a big leader as Ringling Bros and Barnum & Bailey, that set the benchmark, all the small competitors were only allowed to recreate that business model on a smaller and sometimes unprofitable scale. Cirque Du Soleil's huge achievement was that they were not competing on the same targets of the leader, but they created a new unchallenged market space. In other words, they made competition irrelevant. The implementation of BOS consists, therefore, in identifying opportunity for growth and potential for market spaces not yet or not adequately explored. This scenario stands opposite to the one in which the excess of players leads to a ruthless competition that \"will turn the ocean bloody red\".","refs":[]},{"text":"In the case of BeicDL, the decision was not to compete on the same ground as the initiatives of Google Books or digital projects based on huge collections of large national institutions, such as the Bibliothèque Nationale de France (BNF) and the Bibliotheksverbund Bayern (BVB), but to choose as more desirable such criteria as selectivity and accuracy. Additionally, the search tools offered to the users were enhanced by integrating data and services provided by major bibliographic utilities.","refs":[]},{"text":"Per se the decision to identify and fill a market niche is not one which would prove sufficient to define an identity and attract a good number of users. More strategic options are required in order to characterize data and services so as to make them distinguishable and attractive. In the first place comes quality, possibly the highest though bearing in mind the sustainability factor. Digital objects should be of good quality, metadata reliable and complete, descriptions of contents granular, navigational tools diverse and effective. In the second place comes the decision to put metadata and digital objects in the public domain, therefore freely harvestable and reusable in contexts even quite different. Agreements have been made with platforms and shared catalogues targeted to different users with the goal of making BeicDL data visible and active linking points. The third option was to take on editorial activities, focusing internally on virtual exhibitions, such as the Biblioteca idraulica, and externally on a set of entries in Wikipedia. Plans have been made to adopt linked open data to develop a digital reference service. In many ways, this is how BeicDL reacts to Karen Calhoun's suggestion that libraries should become digital scriptoria, so reevaluating a feature, which is inscribed into their DNA. The final option, in this summary recognition, is the relationship established with readers, which is not limited to the mere use of resources, but looks forward to collaborating in the creation of new contents, as well as implying the involvement of communities often quite apart from one another.","refs":[]}]},{"title":"Strategies","paragraphs":[{"text":"The strategies implemented to avoid the risks and the weaknesses proceeded from the acknowledgment of the opportunities and exploitation of the strengths. As already pointed out, the main looming challenges are the loss of identity and the lack of visibility over the Internet. It is therefore important to ensure appeal to the collections, to enhance the services and to promote awareness among the public [18].","refs":[]},{"text":"Several actions, resulting from a long period of studies with the goal of maximizing the outcomes given the limited amount of resources, were taken to tackle these challenges [19].","refs":[]},{"text":"Firstly, partnerships with other institutions were established and metadata were released in the public domain to promote awareness among potential users. Secondly, multimedia technologies (online exhibitions and resource navigators) have been developed to ensure appeal to the collections. Eventually communities such as Wikimedia Italia and Material Evidence in Incunabola (MEI) were approached and involved in shared projects in order to boost the services. An evaluation plan was designed to monitor the achievements of these strategies and discuss future steps [20]. Indeed data provide the essential elements to understand the components of a digital library and the relations among them. Moreover they reveal the impact and effectiveness of the services. Finally the results of the analysis guide the planning of new projects and the allocation of resources. Data collection and analysis are not performed only at the end of specific tasks or projects, when it is crucial to identify the successful factors and compare the results with other experiences, but also when the activities are in progress, in order to track the evolvements and possibly to reassess the forthcoming steps [21].","refs":[]},{"text":"BeicDL has embraced the constant users involvement model and highly value users' feedback since the very first day, believing that learning why some activities work and others fail should be the priority.","refs":[]},{"text":"As recalled by Kyrillidou [16] in his article about assessment protocols published in 2005 \"the project-oriented nature of digital libraries makes it difficult to evaluate them as a whole\". To overcome this threat and collect qualitative and quantitative data, BeicDL employs tools both independent (Google Analytics) and dependent from the applications in use (Digitool and Primo from ExLibris). This approach, which has the advantage of setting flexible parameters, provides also more reliable results. Furthermore, BeicDL follows a strict protocol based on a measurement plan and a rigid policy about data treatment drawn upon best practices and current data analysis landscape.","refs":[]},{"text":"The following sections briefly describe the strategies and analyze their impact on pageviews and sessions statistics, where possible. The latter is accounted as sufficiently relevant and reliable although it cannot be considered exhaustive because the evaluation process must combine quantitative and qualitative data [11, 19].","refs":[]}]},{"title":"User Communities Involvement","paragraphs":[{"text":"The first and most interesting strategy is the active involvement of users. BeicDL has recently partnered with one of the most influential communities on the web, wikipedians, and a small (compared to the previous one) proactive community of professionals, the incunabula specialists. A shared programme was signed in September 2014 to establish a relationship with the Wikipedia community and make BeicDL a potential reference for editors interested in topics covered by the digital library materials. Wiki-media Italia nominated a consultant2 (a \"wikipedian in residence\") who has since been training BEIC staff and identifying interesting matches between the digital library items and various Wiki projects (Wikipedia, Wikimedia Commons, Wikibooks and Wiki-data) 3 . Activities are not limited to creating and editing articles. In fact, organization of edithatons, donations of books to Wikisource and editors engagement are also carried out 4 . The impact of the Wiki projects was beyond expectations, not only due to the linchpin role that Wikipedia plays in the Web, but because of the motivation and skills that staff (wikipedian and non) have put in these activities. By November 15th 2014, 2,044 articles written in more than 90 languages were revised and updated and 50 new entries were created. Accurately selected pictures of 50 works and 35 authors were loaded in Wikimedia Commons and are currently in use in more than 450 entries. As a result, references based on BeicDL were also added to each corresponding article.","refs":[{"start":543,"end":544,"marker":null,"target":"#foot_1"},{"start":766,"end":767,"marker":"bibr","target":"#b2"},{"start":945,"end":946,"marker":"bibr","target":"#b3"}]}]},{"title":"Partnerships and Metadata Sharing","paragraphs":[{"text":"Partnerships have always been part of BeicDL priorities, in order to exploit resources, to benefit from team work and to ensure a local, national and international dimension to the digital library [14]. The edited articles have more than ten thousand monthly visits according to the Wikipedia statistics. The importance of this partnership is confirmed also by the BeicDL statistics: sessions beginning in Wiki environment generate approximately 20 % of the traffic 5 .","refs":[{"start":466,"end":467,"marker":"bibr","target":"#b4"}]},{"text":"As for MEI 6 , it is a database specifically designed to record and search copy specific evidence and provenance information of 15th-century printed books (i.e. incunabula) [9]. Data regarding ownership, decoration, binding, manuscript annotations, stamps, prices are formalized within a structured database linked to the Incunabula Short Title Catalogue (ISTC), provided by the British Library, thus allowing users to combine searches of bibliographical records (extracted from ISTC) with copy specific records (based on MEI data). Every element recorded is treated as a valuable clue for provenance. Ownership notes, whenever geographically localized and chronologically dated, enable tracking of the movement of books across Europe and through the centuries. Manuscript notes, equally valuable for understanding the readership of the early editions, allow for sophisticated social studies on the use of books, readership and reading [8].","refs":[{"start":11,"end":12,"marker":"bibr","target":"#b5"}]},{"text":"Personal and institutional names of ownership are linked to the CERL Thesaurus, where further bio-bibliographical information can be found [4]. This provides links to other editions identified with the specified name, clarifying whether the owner was also an author, thus merging ownership and authorship information.","refs":[]},{"text":"Over 50 editors in as many institutions (ranging from very small to very large) across Europe and North America are currently recording provenance in MEI, thereby contributing to the reconstruction of dispersed collections. This is where BeicDL comes in. Though some of the work needs a direct recognition of the original, a lot of information can be provided by integral good quality digital reproductions, such as those available in BeicDL. Scholars can use the DL in many ways: they can verify the existence of material evidence and identify its nature, use the digital reproduction as a source when recording data in MEI, handle it as a resource for identification queries. On the other hand, the links established in ISTC will direct users cross searching the two databases at CERL to copies available in digital format in BeicDL.","refs":[]},{"text":"At the BeicDL's end, MEI records will be regularly downloaded for integration into the local discovery tool and more links and cross references will then be built, which will hopefully enhance the wealth of information at the disposal of the user. Since work is being currently carried out on this project, we are not yet in a position to provide figures on the use of this service. However, we can already provide the number of links from ISTC back to BeicDL documents, which is in the region of 200 per month.","refs":[]},{"text":"Agreements on a local basis are well represented by the cooperation with the Braidense National Library7 to support and manage the Archive of the Regional legal deposit of Lombardy 8 . On a national level, partnerships have been secured with several institutions such as the Istituto Storico Italiano per il Medioevo (ISIME) 9 and the Istituto Veneto di Scienze, Lettere ed Arti (IVSLA) 10 in order to provide a wider audience with relevant works that would have otherwise been available to a much more limited community. Additional collaborations are established to exchange materials or participate in shared programmes, such as the one with Museo Galileo -Institute and Museum of the History of Science 11 .","refs":[{"start":103,"end":104,"marker":null,"target":"#foot_6"},{"start":181,"end":182,"marker":"bibr","target":"#b7"},{"start":325,"end":326,"marker":"bibr","target":"#b8"},{"start":387,"end":389,"marker":"bibr","target":"#b9"},{"start":706,"end":708,"marker":"bibr","target":"#b10"}]},{"text":"The BEIC Foundation is a member of the Consortium of European Research Libraries (CERL) 12 and The European Library 13 . The collaboration with CERL is aimed at sharing resources and expertise to improve access to European printed heritage. The European Library partnership allows exposure to the digital library resources on a global scale, through its own web portal, as well as through the affiliated portal of Europeana 14 . The traffic generated by national collaborations, which are typically based on projects, differs greatly and is relevant especially at the beginning and at the end of the project, when the impact peaks at 4-5 % before settling at 1.5 %. Another 4 % of the audience is guaranteed by international partnerships, in particular 1 % is generated by The European Library and 3 % by Europeana. These figures are constantly changing as they tend to be affected by initiatives and promotions (i.e. current events, virtual exhibitions, etc.). Data from CERL are not yet available. As a general policy, BeicDL provides descriptive metadata under the CC0 license 15 , which includes the waiving of all rights to the extent permitted by law. Therefore, one is allowed to copy, modify, distribute and use, even for commercial purposes, all data without any limitation. This policy is in place to encourage and facilitate the reuse of BeicDL metadata which in general should be of a good quality [19]. An example of reuse is offered by the OPAC of the Biblioteche civiche torinesi 16 , in which links to the BeicDL resources have been successfully established 17 . This approach provides crawlers with the chance to harvest the data and make BeicDL items available directly through major search engines such as Google and Yahoo. It is difficult to establish a quantitative value to this figure because results will only show in the long period. An estimated figure is 1 %, although it inevitably takes into account pipes that provide links back to BeicDL domains.","refs":[{"start":88,"end":90,"marker":"bibr","target":"#b11"},{"start":116,"end":118,"marker":"bibr","target":"#b12"},{"start":424,"end":426,"marker":"bibr","target":"#b13"},{"start":1080,"end":1082,"marker":"bibr","target":"#b14"},{"start":1495,"end":1497,"marker":"bibr","target":"#b15"},{"start":1574,"end":1576,"marker":"bibr","target":"#b16"}]}]},{"title":"Resource Navigators and Online Exhibitions","paragraphs":[{"text":"As recalled by the Handbook on virtual exhibitions and virtual performances, an INDICATE [13] project publication, the creation of multimedia tools for the exploration of data and documents is considered one of the most important activities of cultural institutions because it encourages and strengthens the relationship with the users. The advantages of multimedia interfaces, although not entirely replacing the physical experience, are evident and include the possibility of browsing items following personal patterns and the chance to engage a greater number of users. This 11 www.museogalileo.it/. 12 www.cerl.org/. 13 www.theeuropeanlibrary.org/. 14 www.europeana.eu/. 15 www.creativecommons.org/publicdomain/zero/1.0/. 16 www.bct.comperio.it/. 17 An example is: www.bct.comperio.it/opac/detail/view/sbct:catalog:44869. approach also encourages feedbacks and gives visitors the possibility to cooperate in the development of the exhibition itself` [12]. Furthermore, documents and valuable works can be enjoyed comfortably, without compromising their preservation. There are many typologies of multimedia tools and infinite combinations of resources, however BeicDL decided to focus on two of the most powerful: online exhibitions and resource navigators. An online exhibition is a hypermedia collection accessible on the web, which is made of digital objects linked accordingly to topics in a system architecture designed to deliver engaging and user-friendly experiences [12]. Museums such as MoMA 18 and Hermitage 19 have made successful online exhibitions for many years, and recently more libraries have ventured into this path as well, curating exhibitions such as \"Discovering Literature: Romantics and Victorians\" 20 by the British Library 21 and \"l'Art du Livre Arabe\" 22 , a publication of the Bibliothèque Nationale de France 23 .","refs":[{"start":621,"end":623,"marker":"bibr","target":"#b12"},{"start":675,"end":677,"marker":"bibr","target":"#b14"},{"start":726,"end":728,"marker":"bibr","target":"#b15"},{"start":751,"end":753,"marker":"bibr","target":"#b16"},{"start":1506,"end":1508,"marker":"bibr","target":"#b17"},{"start":1523,"end":1525,"marker":"bibr","target":"#b18"},{"start":1754,"end":1756,"marker":"bibr","target":"#b20"}]},{"text":"BeicDL is currently implementing a virtual exhibition, which is part of a larger project named Biblioteca Idraulica. The latter, focusing on hydraulics, was created in collaboration with the department of Agricultural and Environmental Sciences -Production, Landscape, Agroenergy of the University of Milan 24 and sponsored by the Cariplo Foundation 25 .","refs":[]},{"text":"The project involves the digitization of 800 works, the publication of thematic monographs and the design of educational tools devised for use in secondary schools 26 . The topic was selected bearing in mind the undeniable role played in the European culture by water and to celebrate the great tradition of Italian hydraulics which is still little known. The programme \"Vie d'Acqua\" 27 , included in the Expo 2015 event held in Milan, provided a further motivation. Its goal is to attract a well-defined audience who is looking for high-level content, but is not specialized, and to provide an interpretative and appealing key to a portion of the digital collection that was otherwise bound to have a small number of visitors. The exhibition went online in February 2015 and is constantly upgraded with new articles to keep it stimulating, enjoyable, and up to date. The BeicDL pageview estimate is around 3 %, a fairly high impact considering the specificity of the project.","refs":[{"start":164,"end":166,"marker":"bibr","target":null}]},{"text":"Navigators are graphical representations of data, which allow users to access and interpret complex sets of data in a more user-friendly way. By cross-indexing descriptive and administrative metadata, BeicDL is providing new interpretative keys allowing users to combine data in ways other than those provided by the OPAC. Two installations are currently available: the authors navigator and the Lombard publishers navigator.","refs":[]},{"text":"The former 28 is based on the digital library metadata and aims at compensating for one of the most common deficiencies of catalogs, that is the ability to combine information based on authors rather than works. The navigator filters the authors' names by their date of birth and by the digital collection their works belong to. The Lombard publishers navigator 29 , which is quite a unique development, is designed bearing in mind the specific feature of this database, engaging stakeholders like publishers, which usually have little or no contact with library services. Users are prompted with a map locating each of the publishers within the region and showing their annual production. Data were derived from the OPAC in combination with an administrative database constantly updated by the staff. The navigator has ended up being more accurate than ISTAT 30 (for instance in 2010, 535 publishers were tallied compared to the 331 notified by ISTAT).","refs":[]}]},{"title":"Final Considerations","paragraphs":[{"text":"In total, the above mentioned traffic accounts for 25 % of BeicDL applications sessions. The remaining 75 % consists of direct queries (30 %) and search engine links (45 %).","refs":[]},{"text":"It is also interesting to analyze the distribution of new visitors (35 %), returning visitors (20 %) and crawlers (45 %). Data have been calculated on the basis of a weighted arithmetic mean between BeicDL applications. However, these figures fluctuate depending on the application (web portal, discovery tool and repository).","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"SWOT analysis","rows":[["INTERNAL ANALYSIS"],["STRENGHTS","WEAKNESSES"],["• its quite recent history","• absence of a physical component"],["• knowledgeable staff engaged in key","• need for a severe adjustment of the DL"],["technical and bibliographic choices","model previously designed and of the"],["","collections and services development plan"],["• compliance with national and international","• weakness of the brand"],["standards",""],["• suitable technological equipment well","• unbalanced bibliographic coverage of the"],["supported by an excellent computer centre","knowledge fields involved"],["• flexibility and willingness to re-act","• uncertain availability of financial resources"],["promptly to evolving market trends","in the medium-long run"],["• low production costs","• understaffing even with respect to key roles"],["• partnerships with authoritative institutions",""],["from the various fields",""],["• bibliographic and documentary material of",""],["a good quality (as regards cultural interest,",""],["typological variety and coverage of",""],["knowledge fields)",""],["• financial resources adequate to carry out the",""],["project for a reasonable number of years",""],["OPPORTUNITIES","THREATS"],["• widespread existence of standards,","• signs of great difficulty deriving from the"],["protocols and models facilitating","Italian economic framework"],["distribution, aggregation and reuse of data",""],["• growing attention towards the availability","• state of uncertainty in the Italian"],["of cultural contents in the public domain","governmental initiatives in support of"],["","culture"],["• development of new promotion channels","• widespread incapacity on a national level to"],["for collections and knowledge","behave as a system and to develop"],["","medium-long term planning"],["","(Continued)"]]},"tab_1":{"heading":"Table 1 .","description":"(Continued)   ","rows":[["• subjects interested in the development of","• present fragility of the BeicDL in the"],["innovative services","absence of a supporting physical"],["","institution"],["• growing attention on the part of state,","• lack of contact with the current"],["academic and private subjects, both in Italy","(contemporary) bibliographic production"],["and in Europe, towards the possibility of",""],["commercial exploitation of cultural objects to",""],["subsidize products and services in the public",""],["domain",""],["• widespread interest towards the reuse of","• difficulty to predefine a specific target"],["know-how and technologies developed within",""],["the project",""],["EXTERNAL ANALYSIS"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"The paper describes the strategies undertaken by BEIC Digital Library in order to find its identity and space on the Web. It will be of interest and value to other digital libraries facing the same challenges or in search of new strategies to promote their collections and to monitor their use.","refs":[]}]}}