{"bibliography":{"title":"CLARIN-IT: An Overview on the Italian Clarin Consortium After Six Years of Activity","authors":[{"person_name":{"surname":"Fante","first_name":"Dario"},"affiliations":[{"department":"Dipartimento di Studi Linguistici e Letterari","institution":"Università degli Studi di Padova","laboratory":null}],"email":"dario.delfante@unipd.it"},{"person_name":{"surname":"Frontini","first_name":"Francesca"},"affiliations":[{"department":"Istituto di Linguistica Computazionale «A. Zampolli»","institution":"CNR","laboratory":null}],"email":"francesca.frontini@ilc.cnr.it"},{"person_name":{"surname":"Monachini","first_name":"Monica"},"affiliations":[{"department":"Istituto di Linguistica Computazionale «A. Zampolli»","institution":"CNR","laboratory":null}],"email":"monica.monachini@ilc.cnr.it"},{"person_name":{"surname":"Quochi","first_name":"Valeria"},"affiliations":[{"department":"Istituto di Linguistica Computazionale «A. Zampolli»","institution":"CNR","laboratory":null}],"email":"valeria.quochi@ilc.cnr.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Research infrastructures","Clarin","Language resources","Data repositories and archives"],"citations":{"b0":{"title":"Language resources","authors":[{"person_name":{"surname":"Godfrey","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Zampolli","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1997","month":null,"day":null},"ids":null,"target":null,"publisher":"Cambridge University Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":381,"to_page":384}}},"b1":{"title":"l'infrastruttura europea delle risorse linguistiche per le scienze umane e sociali e il suo network italiano CLARIN-IT","authors":[{"person_name":{"surname":"Monachini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Frontini","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Clarin","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.4000/ijcol.387","arXiv":null},"target":"http://journals.openedition.org/ijcol/387.doi:10.4000/ijcol.387","publisher":null,"journal":"Italian Journal of Computational Linguistics","series":null,"scope":{"volume":2,"pages":{"from_page":11,"to_page":30}}},"b2":{"title":"Interoperability in an infrastructure enabling multidisciplinary research: The case of CLARIN","authors":[{"person_name":{"surname":"Jong","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Maegaard","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Fišer","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Van Uytvanck","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Witt","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":"https://aclanthology.org/2020.lrec-1.417","publisher":"European Language Resources Association","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":3406,"to_page":3413}}},"b3":{"title":"CLARIN-IT resources in CLARIN ERIC -a bird's-eye view","authors":[{"person_name":{"surname":"Del Fante","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Frontini","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Monachini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Quochi","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":129,"to_page":133}}},"b4":{"title":"Tea for Two\": The Archive of the Italian Latinity of the Middle Ages meets the CLARIN Infrastructure","authors":[{"person_name":{"surname":"Boschetti","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Del Gratta","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Monachini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Buzzoni","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Monella","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Rosselli","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Turco","first_name":"Del"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":"https://office.clarin.eu/v/CE-2020-1738-CLARIN2020_ConferenceProceedings.pdf","publisher":"Virtual Edition","journal":null,"series":null,"scope":null},"b5":{"title":"A data category registry-and component-based metadata framework","authors":[{"person_name":{"surname":"Broeder","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Kemps-Snijders","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Uytvanck","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Windhouwer","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Withers","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Wittenburg","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Zinn","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":19,"to_page":21}}},"b6":{"title":"Digital classics and CLARIN-IT: What italian scholars of ancient greek expect from digital resources and technology","authors":[{"person_name":{"surname":"Monachini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Nicolosi","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Stefanini","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2017","month":"09","day":"20"},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":61,"to_page":74}}},"b7":{"title":"CLARIN Tools and Resources for Lexicographic Work","authors":[{"person_name":{"surname":"Frontini","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Bellandi","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Quochi","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Monachini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Mörth","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Zhanial","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Ďurčo","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Woldrich","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2022","month":null,"day":null},"ids":null,"target":"https://elexis.humanistika.org/en/resource/posts/clarin-tools-and-resources-for-lexicographic-work","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"CLARIN ERIC 1 is one of the 20 European Research Infrastructure Consortia (ERICs). Its aim is to make digital language resources (hencefoth LRs) [1] available to scholars and researchers from all disciplines. CLARIN-IT, the Italian CLARIN consortium was establised in October 2015 [2], and it has recently been recognized as \"project of international significance\" by the Italian government. It benefits from the support of the Ministry of Research and has been listed among the high priority research infrastructures, according to Decreto Ministeriale No.1082 del 10/09/2021 -Piano Nazionale per le Infrastrutture di Ricerca (PNIR) 2021-2027 2 .","refs":[{"start":12,"end":13,"marker":"bibr","target":"#b0"},{"start":643,"end":644,"marker":"bibr","target":"#b1"}]},{"text":"CLARIN ERIC has two fundamental objectives. The first one is to maintain digital repositories, where Language Resources (LRs), that is to say data, corpora, lexicons, tools, are catalogued, stored and retrieved in a simple way. The second one concerns the development of technological solutions that can be intuitively accessed by users. Thefore, CLARIN represents a structure where producers of language technologies and users of these technologies are connected and integrated. CLARIN's technical infrastructure is designed in accordance with the FAIR principles and aims at supporting the best practices of Open Science, by facilitating the deposit and long term preservation of data, their persistent identification and citation, by providing standardised and machine readable metadata and clear licenses, and easy access via single sign on 3 . An important added value provided by CLARIN is that of an increased findability of resources, thanks to the harvesting of metadata from various repositories into the central infrastructure. The aim of this paper is twofold:","refs":[{"start":845,"end":846,"marker":"bibr","target":"#b2"}]},{"text":"• To provide a clear overview of the Italian national CLARIN consortium as it currently stands, six years after its creation in terms of members, centres and collections stored • To illustrate the visibility and the accessiblity of Italian LRs within the CLARIN infrastructure","refs":[]},{"text":"As concerns the second point, for reasons of space, we will not present here the overall architecture of CLARIN ERIC, for which we refer to publications such as [3, 2]. In this contriubtion we shall concentrate in particular on the Virtual Language Observatory, the CLARIN's meta catalogue where the metadata from all data centres are made visible and searchable from a single point of access.","refs":[]},{"text":"In section 2, we discuss the current state of affairs of the Italian consortium in terms of members, and centres within the CLARIN federation, with a special focus on what they offer to CLARIN in terms of resources, services and expertise. In section 3, we simulate two queries on the VLO to highlight how this tool can contribute to the visibility of Italian resources from a user's perspective and we discuss about the results.","refs":[]}]},{"title":"CLARIN-IT in 2021 2.1. Members","paragraphs":[{"text":"The CLARIN-IT4 consortium includes a founding member and seven full members. The current full members are the following: Moreover, thanks to a continuous and focused User Involvement strategy, the Consortium is constantly expanding. Many other institutions have expressed their interest in joining CLARIN-IT or in depositing their data in the CLARIN national repository.","refs":[{"start":13,"end":14,"marker":null,"target":"#foot_0"}]},{"text":"The Italian consortium embraces different research directions. One of those is the field of Digital Classics, which still suffers from shortage or restricted availability of language resources for historical languages such as Ancient Greek, Latin or Sanskrit. To this end, the consortium aims to make some of the existing digitized resources for Ancient Greek and Latin available through its repositories, as well as to create new ones by enriching existing corpora and lexical datasets with Linked Open Data. Another important direction is that of speech and oral archives, which are at the crossroads between speech sciences, digital humanities and digital heritage. CLARIN-IT collaborates with the University of Siena and the Superintendence of Tuscany to coordinate a project aiming at building a model and an architecture for the preservation, enhancement and accessibility of such archives. Finally, the EURAC partners are carrying out research around non-standard forms of language as found in learner corpora and computermediated communication.","refs":[]},{"text":"The founding member and the consortium members are also involved in many international infrastructural projects, which aim to strengthen the cohesion of research across a number of related fields associated with the humanities. Among these we cite ELEXIS 6 (on e-lexicography), the SSHOC cluster project 7 (European open cloud ecosystem of data and tools for SSH), the TRIPLE project8 (a discovery platform for SSH). CLARIN-IT researchers are also active in standardization initiatives, such as ISO, TEI, W3C, and international academic organizations and networks, such as Learner Corpus Association9 , Special Interest Groups on Computer Mediated Communication, the COST Action European Network for Combining Language Learning with Crowdsourcing Techniques (enetCollect10 ), and the COST Action Nexus Linguarum11 , for building an ecosystem of multilingual and semantically interoperable linguistic data at Web scale.","refs":[{"start":255,"end":256,"marker":"bibr","target":"#b5"},{"start":304,"end":305,"marker":"bibr","target":"#b6"},{"start":383,"end":384,"marker":null,"target":"#foot_4"},{"start":599,"end":600,"marker":null,"target":"#foot_5"},{"start":770,"end":772,"marker":null,"target":"#foot_6"},{"start":811,"end":813,"marker":null,"target":"#foot_7"}]}]},{"title":"Centres","paragraphs":[{"text":"The CLARIN network is composed of distributed centres, which can be of three main types12 . Firstly, there are technical centres or B-Centres: these are generally hosted by a university or a public research institution and offer access to resources, services 13 and/or knowledge. Secondly, there are Metadata Providing Centres or C-Centres: they offer deposit and metadata curation. Lastly, there are Knowledge Centres or K-Centres: centres sharing their knowledge and expertise on one or more aspects of a domain covered by CLARIN. Their mission is to ensure that the available knowledge and expertise does not exist as a fragmented collection of informations, but it is made accessible in an organised way to both the CLARIN community and the social sciences and humanities research community at large. Each K-centre has its own specific areas of expertise.","refs":[{"start":87,"end":89,"marker":null,"target":"#foot_8"},{"start":259,"end":261,"marker":"bibr","target":null}]},{"text":"CLARIN-IT comprises two data centres:","refs":[]},{"text":"• The ILC4CLARIN B-centre, which is hosted and managed by the Institute for Computational Linguistics \"A.Zampolli\" in Pisa, the founding member of CLARIN-IT . • The EURAC Research CLARIN Centre (ERCC) C-centre, which is hosted by the Institute for Applied Linguistics (IAL) at Eurac Research in Bolzano, a full member of CLARIN-IT.","refs":[]},{"text":"Both centres offer the possibility to:","refs":[]},{"text":"• deposit data, by ensuring that they are stored safely;","refs":[]},{"text":"• search for data and tools and to download them easily;","refs":[]},{"text":"• make the citation format as easy and consistent as possible;","refs":[]},{"text":"Through the two repositories, CLARIN-IT offers a variety of resources (Cf. section 2.3 for an extensive excursus on CLARIN-IT offer). ILC4CLARIN, as the national B centre, has the mission to offer deposit facility to the whole of the national community, and also hosts a number of Natural Language Processing services14 , many of which are offered as web services and integrated into the CLARIN pipeline management system WebLicht 15 .","refs":[{"start":317,"end":319,"marker":null,"target":"#foot_10"},{"start":431,"end":433,"marker":"bibr","target":null}]},{"text":"In addition to these, Italy is also currently hosting two K-centers. ","refs":[]}]},{"title":"Collections offered by CLARIN-IT","paragraphs":[{"text":"CLARIN-IT offers seven different digital collections, which are deposited in one of the two centres previoulsy mentioned (section 2.2). As Table 1 shows, each collection includes a number of individual language resources. For example, ALIM Literary Sources [5] collection gives access to a vast archive Latin texts produced in Italy during the Middle Ages; its publication is of great importance for providing CLARIN-IT and the CLARIN community, at large, with critically reliable texts for the use of philologists, historians of literature, historians of institutions, culture and science of the Middle Age.","refs":[{"start":145,"end":146,"marker":"table","target":"#tab_2"}]}]},{"title":"Collections","paragraphs":[{"text":"However, the Italian centres do not only host collections by Italian institutions. For example, the Ghent University has deposited three corpora in the ERCC centre: Since ILC4CLARIN is specialised in ancient texts, Latin and Ancient Greek are particularly represented. However, as discussed in [4], Latin LRs are overrepresented, even with respect to Italian, because of the metadata of the ALIM corpus: each text of that collection is deposited as a separate resource, while this is not true for other corpora [5].","refs":[]}]},{"title":"Italian Resources in CLARIN","paragraphs":[{"text":"The most important poin of access for CLARIN is the Virtual Language Observatory (VLO)18  [6] which harvests metadata from all the official CLARIN data providing centres and makes them searchable via a unified interface offering faceted search. Other interesting and useful central discovery services are the Federated Content Search (FCS) 19 , the Language Resources Switchboard (SB) 20 , and the CLARIN Resource Families21 . In order to investigate the visibility and the accessiblity of Italian LRs in CLARIN-IT from a user-perspective, we showcase two simple queries which can be performed using the faceted search functionalities of the VLO. Each query was raised in different formats. Our aim here is to assess the visibility of resources from Italian centres, but also resources that may be relevant to Italian researchers offered by centres outside of Italy, by trying to replicate as much as possible the behaviour of a non-expert user, accessing the VLO for the first time. This query returns 159 results. If we filter them by organisation, we can easily assess that the resources from the Italian centres are correctly displayed in the meta catalogue. For instance by adding the filter • organisation = Institute for Applied Linguistics, Eurac Research all 7 corpora from ERCC are selected. At the same time, it also becomes evident that important resources for the Italian language are also offered by other centres outside Italy, such as, among others, the Universal Dependencies Consortium (20 corpora) and the Charles University, Faculty of Mathematics and Physics, Institute of Formal and Applied Linguistics (UFAL) (12 corpora) which host multilingual collections of Treebanks, namely syntactically annotated corpora.","refs":[{"start":86,"end":88,"marker":null,"target":"#foot_14"},{"start":340,"end":342,"marker":"bibr","target":null},{"start":385,"end":387,"marker":"bibr","target":null},{"start":422,"end":424,"marker":null,"target":"#foot_17"}]},{"text":"From this query it is thus evident that the participation of Italian centres in CLARIN not only allows resources produced in Italy to gain visibility outside of the national context, but also to make important resurces hosted abroad more accessible to Italian researchers. A similar experiment can be attempted for Latin, a language that is strongly represented among CLARIN-IT resources.","refs":[]},{"text":"Query 2 -Search for Latin lexical resources in the VLO by filtering for:","refs":[]},{"text":"1. Language = Latin","refs":[]}]},{"title":"Resource type = Lexical Resource","paragraphs":[{"text":"This query returns 22 results. Among these we find the important resources made available on ILC4CLARIN by the CIRCSE collection, which contains the results of the Linking Latin (LiLa) ERC project22 , produced by Marco Passarotti and his colleagues. However, an important resource by the CIRCSE lab, namely the Word Formation Latin (WFL), is hosted instead by the LINDAT repository, together with the other resources of the multilingual Universal Derivations collection. Thus the VLO view allows users to easily find links between resources that are hosted on different repositories, and so making them more accessible and reusable in research.","refs":[{"start":196,"end":198,"marker":null,"target":"#foot_18"}]}]},{"title":"Conclusive Remarks and Future Work","paragraphs":[{"text":"The infrastructures such as CLARIN play an important role to overcome future challenges of Open Science, and to deliver on the promise of a digital ecosystem of freely accessible, interconnected resources, where data from different providers, made available according to the FAIR principles, can be reused and combined to produce novel research. Within this context, the role of standards in the archivial management is fundamental.","refs":[]},{"text":"The CLARIN-IT consortium is constantly increasing the number of resources deposited in its centres, and also conducting a regular monitoring of the different collections provided by various partners across the two repositories, so as to verify their visibility in CLARIN.","refs":[]},{"text":"An important future challenge is that of increasing CLARIN's users base at the national level. CLARIN has developed different methodologies and approaches to mesure and evaluate user engagement. Surveys can be used to test the interest in the use of digital resources and related tools [7]. A new survey, which is still on going, shows that while Italian researchers in the domain of Language Resources and Technologies are mostly aware of CLARIN-IT's services, a large number of them is still relying on local repositories or on GitHub to store their data. It is thus crucial that CLARIN-IT provides adequate training to resources such as the VLO, in particular targeting the needs of specific communities. In this sense the newly released tutorial CLARIN Tools and Resources for Lexicographic Work [8] is a step in this direciton.","refs":[]}]}],"tables":{"tab_2":{"heading":"Table 1","description":"Collections in CLARIN-IT. Situation at December 2021.","rows":[["ALIM Literary Sources","344 ILC4CLARIN : OPEN Data and Tools 9"],["ILC4CLARIN","58","CIRCSE","8"],["Alim Documentary Sources 11","ERCC Learner Corpora","8"],["Eurac: Learner Language","10","ERCC Web Corpora","4"]]},"tab_3":{"heading":"Table 2","description":"• ACTER (Annotated Corpora for Term Extraction Research) v1.4 • Beldeko Summary Corpus v1.0.0 • ACTER (Annotated Corpora for Term Extraction Research) v1.3 Indeed, both CLARIN-IT centers offer LRs in a variety of languages, not only Italian, as shown in Table 2. Languages in CLARIN-IT","rows":[["","Languages",""],["Latin","369 Croatian","1"],["English","43 Modern Greek","2"],["Italian","38 Croatian","1"],["Arabic","32 Ladino","1"],["German","12 Mòcheno","1"],["Ancient Greek 10 Sardinian","1"],["French","4","Saurano","1"],["Dutch","4","Slovenian","1"],["Czech","2","Spanish; Castilian 1"],["Basque","1","Trentino","1"],["Breton","1","Tyrolean","1"],["Cimbrian","1","Veneto","1"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper offers an overview of the Italian CLARIN consortium after six years since its establishment. The members, the centres and the repositories and the most important collections are described. Lastly, in order to showcase the visibility and the accessiblity of Language Resources provided by CLARIN-IT from a user-perspective, we show how Italian resources are findable within CLARIN ERIC.","refs":[]}]}}