{"bibliography":{"title":"ISS Project: The Integrated Search System in the National Bibliographic Services","authors":[{"person_name":{"surname":"Cerullo","first_name":"Luigi"},"affiliations":[{"department":"Istituto Centrale per il Catalogo Unico delle biblioteche italiane e per le informazioni bibliografiche (ICCU)","institution":null,"laboratory":null}],"email":"luigi.cerullo@beniculturali.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-73165-0_22","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital library","Collective catalogue","Searching and retrieval methods","Access interface management metadata","Rest services"],"citations":{"b0":{"title":"census of manuscripts held by Italian libraries","authors":[{"person_name":{"surname":"Manus","first_name":"On"},"affiliations":[],"email":null},{"person_name":{"surname":"Line","first_name":"("},"affiliations":[],"email":null},{"person_name":{"surname":"Mol","first_name":null},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"https://manus.iccu.sbn.it/","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Internet Culturale, national digital resource aggregator","authors":[],"date":null,"ids":null,"target":"http://www.internetculturale.it/opencms/opencms/it/","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"collective catalogue powered by peripheral catalogs through the services of the SBNMarc application protocol","authors":[{"person_name":{"surname":"Bibliotecario","first_name":"Servizio"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://www.iccu.sbn.it/opencms/opencms/it/main/sbn/index.html;jsessionid=E8","publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":177,"to_page":177}}},"b3":{"title":"TEI-MS Profile of the Manus On Line System","authors":[],"date":null,"ids":null,"target":"https://jtei.revues.org/1054","publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"MAG Schema","authors":[],"date":null,"ids":null,"target":"http://www.iccu.sbn.it/opencms/opencms/documenti/mag2-2006.html","publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Technical Documentation and Schema of the SBNMarc Application Protocol","authors":[],"date":null,"ids":null,"target":"http://www.iccu.sbn.it/opencms/opencms/it/main/sbn/evoluz_indice_sbn/pagina_143.html","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Documentation on METS metadata framework","authors":[],"date":null,"ids":null,"target":"https://www.openarchives.org/pmh/","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Single Access and Retrieval Platform 1.General Goals of the Project","paragraphs":[{"text":"The main goal of the SRI project is to build a distributed information architecture that allows the creation of a single access point to the resources described in the main \"management\" databases, whose care depends directly and indirectly on ICCU (Edit16 [1], Manus On Line [2], The digital resource aggregator-index [3] and SBN [4]). This access interface or access point must be based on a retrieval model that takes into account the ontological level of the bibliographic universe (resources and related entities that are the subject of different descriptions or information items stored in the various management data-bases). The ontological coherence of the representation can be ensured only by acting directly in the bibliographic information creation phase (in the record making phase), ensuring the presence of identifiers and linking-keys between the different information objects -objects that are different for both data quality and data model. In fact, these objects are created in the specialist databases (Edit16 and Manus), are stored in the digital resource index (Internet Culturale) and are shared in the Collective Catalogue (SBN), but often refer to the same resources and entities. The actions aimed at rationalizing the retrieval model of ICCU systems are listed below:","refs":[{"start":275,"end":278,"marker":"bibr","target":"#b0"},{"start":318,"end":321,"marker":"bibr","target":"#b1"},{"start":330,"end":333,"marker":"bibr","target":"#b2"},{"start":1033,"end":1039,"marker":"bibr","target":null}]},{"text":"(a) The use of a single software platform that is the basis of the new Integrated Search System (ISS) that allows the creation of a single access point configured as a general catalogue, and the decommissioning of the current infrastructure of separate OPACs, whose specifics functionalities will be replicated in the single platform through dedicated search indexes. (b) Native integration between bibliographic records and digital copies of publications through the integration of digital library system's services with the most used SBN library management software that enables the SBN local nodes to supply the Index of digital resources (Internet Culturale) through automated generation of management metadata.","refs":[]}]},{"title":"Integrated Search System and General Catalogue","paragraphs":[{"text":"The ISS is, at the application level, a single platform that includes a unified-index, meant as unified search profile. This solution allows a configuration of (a) search and retrieval interface (search interface, results lists and contextual search filters) of a single access point, presented as a general catalogue, and (b) individual search databases represented by the dedicated indexes Edit16, Manus and Internet Culturale, all these systems accessible through dedicated retrieval interfaces. The index of the General Catalogue is represented by the convergence of the SBN Unimarc profile and the Manus TEI-MS [5] profile, enriched by information of the digital copies described by the MAG [6] metadata referring to the analogic resource that has been described in SBN, in Manus or in Edit16 (1.3 sub) (Fig. 1). Only a subset of these indices will be mapped to the unified-index profile. The index profile (e) represents the EDIT16 specialist search base that is not involved in the unified-index indexing phase. Each record of EDIT16 (here the bibliographic set is exemplified but the logic model is also valid for other entities related to the bibliographic record) is systematically invoked by links in the SBN index records (Unimarc tag 321 as a link to specialized repertories) created in the record-making phase. The index profile (b) represents the set of fields able to represent all SBN's Unimarc information. This information is the core of the integrated representation.","refs":[{"start":616,"end":619,"marker":"bibr","target":"#b3"},{"start":696,"end":699,"marker":"bibr","target":"#b4"},{"start":814,"end":815,"marker":"figure","target":null}]},{"text":"Re-engineering of specialized systems Edit16 and Manus as Client SBN-Marc. The cluster of records (Fig. 2) is made possible by two lines of development: (1) the reengineering of the management data bases Edit16 and Manus-on-line configured as SBN clients (through the services of its application protocol SBNMarc [7]) and (2) the extension of functional architectures -intended to SBN Nodes -through which the integrated representation of digital resources (represented as bibliographic record attachments) is completed (1.3 sub). These environments will retain their specialist features and will be configured at the same time as Client SBNMarc (also thanks to the reuse of already available technical platforms) that can share all or part of the bibliographic information with the reference system (SBN), forming since the record-making phase the cluster of distributed records, then coherently represented by the SRI retrieval machine (through its single access point).","refs":[{"start":104,"end":105,"marker":"figure","target":null},{"start":313,"end":316,"marker":"bibr","target":"#b5"}]},{"text":"Digital as a filter. In the architecture of the reengineered information system, based on the ISS, the digital index of Internet Culturale is not considered as a specialized data base. MAG records are largely de-structured representations of the same resources described in the SBN Catalogue or in Manus and Edit16. The configuration of the general catalogue indices would allow their registration as pure association with the records of the General Catalogue through the development of a unique ID recognition procedure that would come into play during the unified-index indexing phase. This architecture aim to populate specific indexes in order to preserve information about digital content, determined both by the presence of URIs associated in the field of SBN localizations and by the presence of the MAG record referring the same resource (compare diagram of logical relationships in Fig. 2).","refs":[{"start":896,"end":897,"marker":"figure","target":null}]}]},{"title":"Completion of Integrated Representation: Application Architecture for Peripheral Systems","paragraphs":[{"text":"The application architecture, planned for SBN local nodes, provides full integration of a digital library system's services with most used SBN library management software, through the development of batch generation services of management metadata, based on validated ICCU's mappings and wired in proposed systems. The designed architecture would allow to keep the records in the bibliographic catalogue (in shared environment) aligned with the management metadata (exhibited by the OI-Provider, component integrated in the system) and allow to describe the subset of records with digital attachments resident in the integrated digital library system. The MAG data-set or METS [8] data-set generated on the basis of batch procedures would be overwritten periodically.","refs":[]}]},{"title":"Alignment over time.","paragraphs":[{"text":"The functional diagram shown in Fig. 3, explains the solution destined to peripheral systems, together with the perspective of the development of an interface of access and retrieve with integrated unified-index: it will be developed in a long term plan in order to implement the integration-as-alignment between digital objects (represented by MAG or METS data-sets exhibited through OAI-PMH [9] Provider Systems) and bibliographic records of the collective catalogue (SBN), referring to the same resources. This alignment, guaranteed through overwrite cycles and exposure of management metadata, guaranteed on the basis of the implemented logic, would be represented in the central system (i.e. in the ISS, at the unified-index level) by the systematic retrieval of the reference to the digital object present in the single Index of digital resources. The ISS unified-index is represented by the integration of the Unimarc profile of the SBN Index and the TEI-MS profile of the Manus system, enriched by information on the presence of digital copies described by MAG or METS records referring to the same resources described in SBN Index or in Manus and Edit16 data-bases. At first -based on the proposed architecture -only a subset of records that are present in the Single Digital Index (formerly the Internet Culture) would be retrieved, because they relate to digitized resources, mapped -through identifiers -with documents described in the Collective Catalogue. Over time -thanks to the diffusion of the functional architectures proposed in this chapter -the gap between the resources described in SBN catalogue (or within specialized systems) with digital attachments and that can be mapped with digital resources simultaneously described within the Single Digital Index, would gradually decrease.","refs":[{"start":37,"end":38,"marker":"figure","target":"#fig_1"}]}]},{"title":"Frontend Web Applications (Portals and Search Interfaces)","paragraphs":[{"text":"The Integrated Search System is represented, at the application level, by a single platform that communicates through REST services with Frontend web-applications that represent concretely the public access and return interfaces that the user can use (Fig. 4). These interfaces can be installed either in a single CMS, through which it will be possible to create the Portal of the General Catalogue, both in multiple instances of the same CMS. Each of them represent the service site of each specialized project (Edit16, Manus On Line, SBN, Internet Culturale). The main portal and portals dedicated to specialized databases would share the same template in order to maintain a \"family area\" according to the models already adopted in the most European projects. ","refs":[{"start":257,"end":258,"marker":"figure","target":"#fig_2"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The project originates from the need to overcome the criticalities of separate search and retrieval platforms for each of the national systems provided by the ICCU and at the same time to \"heal the rift\" between the National Union Catalogue (SBN) and the Digital Library (Internet Culturale). The actions aimed at rationalizing the retrieval model of ICCU systems, ensuring a consistent recall of information objects through its access interfaces, go towards two development lines: (1) use of one software platform that is the base for the application of the new Integrated Search System (ISS); this solution allows the creation of a single access point configured as a General Catalogue and, at the same time, the decommissioning of different OPACs whose peculiarities will be implemented in the single platform through dedicated search indexes; (2) native integration between bibliographic records and digital copies of publications through the integration of digital library system's services and the SBN library management software.","refs":[]}]}}