{"bibliography":{"title":"Interactive Visual Representations of Complex Information Structures","authors":[{"person_name":{"surname":"Amico","first_name":"Gianpaolo"},"affiliations":[{"department":"Media Integration Communication Center","institution":"University of Florence","laboratory":null}],"email":null},{"person_name":{"surname":"Bimbo","first_name":"Alberto"},"affiliations":[{"department":"Media Integration Communication Center","institution":"University of Florence","laboratory":null}],"email":"delbimbo@dsi.unifi.it"},{"person_name":{"surname":"Meoni","first_name":"Marco"},"affiliations":[{"department":"Media Integration Communication Center","institution":"University of Florence","laboratory":null}],"email":"marco.meoni@unifi.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Multimedia databases","Rich internet applications","Social networks","Information visualization","Usability","Graph drawing"],"citations":{"b0":{"title":"Readings in Information Visualization: Using Vision to Think","authors":[{"person_name":{"surname":"Card","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Mackinlay","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Shneiderman","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"1999","month":"01","day":null},"ids":null,"target":null,"publisher":"Morgan Kaufmann","journal":null,"series":null,"scope":null},"b1":{"title":"Interactive visualization tools for exploring the semantic graph of large knowledge spaces","authors":[{"person_name":{"surname":"Hirsch","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Hosking","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Grundy","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2009","month":"02","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Freebase: a shared database of structured general human knowledge","authors":[{"person_name":{"surname":"Bollacker","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Cook","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Tufts","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"AAAI Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1962,"to_page":1963}}},"b3":{"title":"Whatsonweb+: An enhanced visual search clustering engine","authors":[{"person_name":{"surname":"Di Giacomo","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Didimo","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Grilli","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Liotta","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Palladino","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2008","month":"03","day":null},"ids":null,"target":null,"publisher":"IEEE Pacific","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":167,"to_page":174}}},"b4":{"title":"The anatomy of a hierarchical clustering engine for webpage, news and book snippets","authors":[{"person_name":{"surname":"Ferragina","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Gulli","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":395,"to_page":398}}},"b5":{"title":"Lingo: Search results clustering algorithm based on singular value decomposition","authors":[{"person_name":{"surname":"Weiss","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Osinski","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Osinski","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Stefanowski","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Weiss","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":359,"to_page":368}}},"b6":{"title":"Graph Theory (Graduate Texts in Mathematics)","authors":[{"person_name":{"surname":"Bondy","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Murty","first_name":"U"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":null},"b7":{"title":"Graph visualization techniques for web clustering engines","authors":[{"person_name":{"surname":"Di Giacomo","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Didimo","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Grilli","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Liotta","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Transactions on Visualization and Computer Graphics","series":null,"scope":{"volume":13,"pages":{"from_page":294,"to_page":304}}},"b8":{"title":"Graph visualization and navigation in information visualization: A survey","authors":[{"person_name":{"surname":"Herman","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Melançon","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Marshall","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2000","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IEEE Transactions on Visualization and Computer Graphics","series":null,"scope":{"volume":6,"pages":{"from_page":24,"to_page":43}}},"b9":{"title":"Visualizing knowledge and information: An introduction","authors":[{"person_name":{"surname":"Keller","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Tergan","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":1,"to_page":23}}},"b10":{"title":"Layout adjustment and the mental map","authors":[{"person_name":{"surname":"Misue","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Eades","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Lai","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Sugiyama","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"1995","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Visual Languages & Computing","series":null,"scope":{"volume":6,"pages":{"from_page":183,"to_page":210}}},"b11":{"title":"Birdeye information visualization and visual analytics library","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Web Usability","authors":[{"person_name":{"surname":"Nielsen","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Loranger","first_name":"H"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":"Addison-Wesley","journal":null,"series":null,"scope":{"volume":15,"pages":null}},"b13":{"title":"Don't Make Me Think: A Common Sense Approach to Web Usability","authors":[{"person_name":{"surname":"Krug","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2000","month":"10","day":null},"ids":null,"target":null,"publisher":"New Riders Press","journal":null,"series":null,"scope":null},"b14":{"title":"Heuristic evaluation of user interfaces","authors":[{"person_name":{"surname":"Nielsen","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Molich","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"1990","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":249,"to_page":256}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"In the last years the amount of information available on the Web have increased not only in size, but also in complexity. The problem of information overload has dramatically become a problem of information evolution. Most of the documents accessible through the internet consist of multimedia data (audio, video, images) and websites like YouTube and Flickr have become very popular among end-users. In addition social networks and blogging platforms like Facebook or Technorati give the possibility to add information and leave comments according to the user generated content paradigm. More recently, we assist at the diffusion of Real-Time Web, a new phenomenon based on the real-time delivery of activity streams from users of web services, such as those provided by Twitter and Friendfeed.","refs":[]},{"text":"The complexity of the new structure of information has thus become a big issue in the field of user experience and web usability. Many attempts have been recently made to implement a commonly accepted solution to organize all these data (e.g. Google Wave), but there is not yet a standard framework for the presentation of complex information to the user.","refs":[]},{"text":"In this paper we propose a solution for the visualization of information which uses advanced presentation techniques derived from the field of Information Visualization [1], with the goal of making large and complex content more accessible and usable to the end-users. Our system consists of a graphical user interface for querying at the same time different web resources: a web clustering engine, two multimedia databases and a social network. Results are then organized and visualized according to a semantic strategy, using specific interactive features designed to explore and browse the structure of data. Two different visual presentation paradigms have been implemented, performing extensive experimental analysis of the layout interfaces and measuring their effectiveness with real users.","refs":[{"start":169,"end":172,"marker":"bibr","target":"#b0"}]},{"text":"The reminder of this paper is organized as follows. In section 2 we propose the basic concepts regarding the framework in this work, describe the architecture of the developed prototype application and the graphical user interface paradigms that have been designed. In section 3 we describe the experiments performed to evaluate the effectiveness of the proposed solutions and finally conclusions and discussion about the future work are presented in section 4.","refs":[]}]},{"title":"Previous Work","paragraphs":[{"text":"Advanced visualizations of information for large data repositories have been proposed in [2], where authors implemented a tool for exploring the open shared knowledge databases Freebase [3] and Wikipedia. These systems are designed only to improve the visual representation of semantic web structures.","refs":[{"start":89,"end":92,"marker":"bibr","target":"#b1"},{"start":186,"end":189,"marker":"bibr","target":"#b2"}]},{"text":"Differently, the approach proposed in [4], develops the use of web clustering engines [5] as data sources for the visualization. These systems forward the user's queries to the classical web search engines, take back the results and organize them in categorized groups called clusters, in order to provide a semantic representation of the information to the user.","refs":[{"start":38,"end":41,"marker":"bibr","target":"#b3"},{"start":86,"end":89,"marker":"bibr","target":"#b4"}]},{"text":"However, a common trait of all these approaches is that they do not use information related to the user queries, extracted from other repositories like social networks or multimedia sharing services. In addition, all the previous visualization tools are built on top of a dedicated resource and cannot be extended to other information repositories.","refs":[]}]},{"title":"The Visual Interactive Framework","paragraphs":[{"text":"Our framework consists of a web-based application which allows users to perform a query, extracting and merging results from diverse knowledge repositories, and letting users to explore information by means of an interactive graph-based user interface.","refs":[]},{"text":"The initial query is performed on a main data resource, which can be a web search engine or a simple database. Results are then used to query other repositories, which return related information, such as social networks, multimedia sharing platforms or real-time web services. All these results are then merged and organized according to an algorithm which creates a structured description of the information, that accounts for semantic structures underlying the data. An interactive graphical user interface presents all the information according to information visualizations techniques.","refs":[]},{"text":"The framework is not designed to handle only a specific data source, but to provide a generic architecture, in order to minimize its adjustments to different complex structures of information.","refs":[]},{"text":"The proposed system is implemented according to the Rich Internet Application (RIA) paradigm: the user interface runs in a Flash virtual machine inside a web browser. RIAs offer many advantages to the user experience, because users benefit from the best of web and desktop applications paradigms. In fact, following this approach, both high levels of interaction and collaboration (obtainable by a web application) and robustness in multimedia environments (typical of a desktop application) are guaranteed. Other advantages of this solution regard the deployment of the application, since installation is not required, because the application is updated only on the server; moreover it can run anywhere, regardless of what operating system is used, provided that a browser with Flash plugin is available. The user interface is written in the Action Script 3.0 programming language, using Adobe Flex.","refs":[]},{"text":"Figure 1 shows the system architecture, that can be divided into 4 main modules: main data sources access, related content extractor, common resource description and merging, and user interface.","refs":[{"start":7,"end":8,"marker":"figure","target":"#fig_0"}]}]},{"title":"Main Resource","paragraphs":[{"text":"The system submits user's queries to the main source of information, which can be a search engine or a database. In our implementation we have used a clustering search engine, which groups results according to a semantic proximity algorithm.","refs":[]},{"text":"In particular, we have used the Carrot2 [6] search engine, with the Lingo clustering engine. The algorithm implemented by Lingo is a web search clustering algorithm, that aims at discovering the thematic threads in search results, creating results groups with a label and description that is meaningful to a human.","refs":[{"start":40,"end":43,"marker":"bibr","target":"#b5"}]},{"text":"The algorithm [7] extracts frequent phrases from the input documents, assuming that they are the most informative source of human-readable topic descriptions. The original term-document matrix is reduced using Singular Value Decomposition (SVD), then the engine tries to discover any existing latent structure of diverse topics in the search result. Finally, it matches group descriptions with the extracted topics and assign relevant documents to them. This strategy provides an overview of the different arguments related to the query, and help the user to find the desired information.","refs":[]}]},{"title":"Related Content Resource","paragraphs":[{"text":"Information extracted from the main resource are processed and used to query some of the most common social networks, image and video sharing platforms. The objective is the enrichment of information with related content in order to provide the user with a larger number of information sources to improve information completeness and increase user's knowledge. Our system uses the publicly available APIs of YouTube as source of video contents, Flickr for images and pictures and Technorati for social and real-time content.","refs":[]}]},{"title":"Resource Description","paragraphs":[{"text":"All information extracted from main and related content resources are converted in a XML graph data structure organized in entities (called nodes) and relations (edges). [8]: each set of results is associated with a node and any relation among the results is associated with edges.","refs":[{"start":170,"end":173,"marker":"bibr","target":"#b6"}]},{"text":"The structure of data was designed to attain two goals: a) to be easily adaptable to all common data repositories or search engines, in order to implement a standardized representation of single elements, clusters, ranking informations and semantic relations; b) to be lightweight, so that it can be easily transmitted and processed by the RIA application that runs within a browser plugin.","refs":[]}]},{"title":"Graphical User Interface","paragraphs":[{"text":"The user interface was designed in order to optimize comprehension of the data structures resulting from the diverse information sources. This objective is achieved using graph representation [9,10], that maximizes data comprehension and relations analysis. Moreover a visual sort ranking [11] allows user to understand which is the best element among the result elements, both for the main resource and for related contents.","refs":[{"start":192,"end":195,"marker":"bibr","target":"#b7"},{"start":195,"end":198,"marker":"bibr","target":"#b8"},{"start":289,"end":293,"marker":"bibr","target":"#b9"}]},{"text":"We propose two different types of graphic representations, described in the following, that summarize the main authoritativeness of the sources, the presence of multimedia data and the presence of information obtained from social networks, in order to provide a comprehensive overview of the results using simple visualization paradigms.","refs":[]},{"text":"If there are data relationships then they are represented by graph edges, otherwise only elements with no relationships are represented. For each element we can find a graphic representation that summarizes visually the ranking of the main data resource, along with multimedia contents ranking and social ranking. Below every element and besides the name of their group, we show buttons to access the related contents of the node, differing from each other by color (figure 2).","refs":[{"start":474,"end":475,"marker":"figure","target":null}]},{"text":"The interface was designed to let users interact with the presentation of the search results, allowing nodes drag & drop to correct errors of automatic node positioning, making new refinement queries using a search bar, and delving deep into queries related to a certain element by double clicking on the represented object. The graph is animated with smooth transitions between different visualizations [12]. The graphical representation of the graph is made using the open source graph drawing framework Birdeye Ravis [13].","refs":[{"start":404,"end":408,"marker":"bibr","target":"#b10"},{"start":520,"end":524,"marker":"bibr","target":"#b11"}]},{"text":"Geometric paradigm. This paradigm is based on simple geometry properties. Groups are represented by a geometric shape differing in dimension, colour and shape type, as shown in figure 2.","refs":[{"start":184,"end":185,"marker":"figure","target":null}]},{"text":"The dimension of the geometric shapes represents the authoritativeness of one group relative to the others, related to the original data source hierarchy. The main data source order has to be as clear as possible, in order to represent the authoritativeness concept between the contents found. Due to the importance of this concept, it has been connected to the clearest graphic concept: shape size. The more relevant contents group is represented by the bigger shape size, while less relevant contents are represented by little shapes.","refs":[]},{"text":"Color is connected to multimedia contents, because multimedia is to considered as the \"colour\" given to textual information. The larger the amount of multimedia contents is associated to a node, the more the geometric shape is filled with the red colour; the lesser the amount of multimedia contents there are, the more the colour tends to white modifying the filling brightness value.","refs":[]},{"text":"The shape type is connected to the social sources: the more the content is obtained from social networks the larger the number of sides if the geometric shape, starting from the basic shape of a triangle to represent content that has Fig. 2. A description of geometric interface: each geometric shape is associated with a visual representation of its authoritativeness, social and multimedia ranking index and linked to similar nodes through relationship edges. Under the shape there are the contents access buttons. no connection to social networks. This graphical concept is based on the idea that contents coming from social networks are able to give multilateralism to the original information.","refs":[{"start":239,"end":240,"marker":"figure","target":null}]},{"text":"Urban paradigm. This paradigm is based on concepts closed to human perceptual skill: groups are represented by different shape buildings with a different number of people close to them and a different number of trees around them. As described in the description of the geometric paradigm, every visualized element is connected to a specific meaning of its group, trying to give the best semantic correspondence between the shown graphic and joined contents.","refs":[]},{"text":"The building type is the main element of this representation. It is connected to node authoritativeness concept: increasing the group contents representation means increasing the building dimension. Less representative nodes are shown as little houses: when the authoritativeness node index grows up it is represented by bigger houses until the biggest one: the skyscraper.","refs":[]},{"text":"Building size is to be considered by the absolute representation of the node, differing from what happened to the geometric representation in which we used the relative index.","refs":[]},{"text":"Information referring to related contents are represented by elements outside the building, like people near it and trees along it. We represent the presence of multimedia information using trees: the more trees are represented along the building the greater is the multimedia content regarding the represented node. As regards the urban metaphor, trees represent the urban element that provides colour to the city like multimedia contents to the information do. The social contents of the nodes is represented by people near the building. Many people represent a high social index.","refs":[]}]},{"title":"Contents access.","paragraphs":[{"text":"Users can inspect all the information sources related to each node of the graphs that contain the search results, such as web pages, blog entries, pictures and videos related to the subject of the query. Contents can be accessed by clicking on buttons under each node name. Every button, if selected, enlarges its dimension in order to help the user in clicking the area.","refs":[]},{"text":"Clicking on the button a modal window is opened, to list the search results ordered by importance and with a short description (figure 5). The other color buttons let users access the related contents obtained from related contents extractor.","refs":[{"start":135,"end":136,"marker":"figure","target":"#fig_3"}]}]},{"title":"Experimental Analysis","paragraphs":[{"text":"The system has been tested to evaluate how much an end-user can benefit from the graph-based presentation of semantically related documents and from the inclusion of multimedia data in the search results, all combined together using the interactive visualization representation. Testing was focused on evaluating the effectiveness of the two different visual paradigms and web usability [14] of the system. 11 users of varying background ad expertise have been selected to carry on the test, performed according to standard web usability tests [15]: 3 students and researchers of the Media Integration and Communication Center, 3 students of Master in Multimedia-Content Design and 5 non-technical users.","refs":[{"start":387,"end":391,"marker":"bibr","target":"#b12"}]},{"text":"The test was designed to be conducted in different sessions, and with different methods of operation:","refs":[]},{"text":"Trained testing. Participants were first given a brief tutorial (lasting about 10 minutes) about using the experimental application and about the meaning of visual paradigms. Untrained testing. Participants were required to complete the experiment task without knowledge about application.","refs":[]},{"text":"Each participant was asked to find a document, image or video about a topic using a keyword given by the test supervisor. Users were not allowed to modify the keyword or to refine the search adding more keywords and, after starting the query, they were allowed to use only the mouse to interact with the system. The tasks assigned in the experiments were:","refs":[]},{"text":"Task 1. find an installation guide of Ubuntu operating system through the keyword ubuntu. Task 2. find a web page describing the climate conditions that can be expected in Italy, using the keyword Italy.","refs":[]},{"text":"Task 3. find the name of the founder of the social network \"Facebook\", using the keyword facebook. Task 4. find an image of one or more players of American Football, using the keyword football.","refs":[]},{"text":"Tasks were followed by a short interview in which subjects were asked about their experiences and their understanding of interface, data representations and visual paradigms. The number of mouse clicks used to complete each task, and the time spent were recorded and used to evaluate the system [16].","refs":[{"start":295,"end":299,"marker":"bibr","target":"#b14"}]},{"text":"To avoid the bias due to repeated search tasks each user participated only to one of the two tests: 9 users were assigned to the \"trained testing\" (3 users for each results presentation paradigm: Google list, geometric and urban paradigms) and 2 users were assigned to the \"untrained testing\" (one for each visualization paradigm: geometric and urban). The users participating to the \"trained testing\" used only one of the interfaces.","refs":[]},{"text":"The \"trained testing\" comprise a comparison with the results obtainable using Google. Some users had to complete the tasks of the test with the classical Google search engine, without refining the proposed keyword. We have chosen Google as reference for testing results since every user was familiar with its interface, so that we could consider them as \"trained\", and because it can be considered stateof-the-art of the web search engines that use ranked lists for the presentation of search results. The objective of this comparative test is to evaluate the effect of the knowledge increase that is the goal of the visual representations proposed. The objective of the untrained testing is to evaluate the interface usability.","refs":[]}]},{"title":"Trained Testing Results","paragraphs":[{"text":"Table 1 and 2 report the results of the trained testing experiments in terms of number of mouse clicks and time (in seconds), respectively. The overall performance of the system is encouraging; considering the geometric visualization paradigm the average number of clicks is slightly higher than that required by the Google interface, because users have a better knowledge of the Google interface (that is also quite leaner than the system proposed), but the average time spent is lower, thanks to the effectiveness of the visualization paradigm. The simplicity of the symbols used in the geometric paradigm enforce a lighter cognitive load than the urban representation paradigm. This effect is clearly shown also the \"untrained testing\" results reported in the following. Some of the differences in terms of click number and time required for tasks 2 and 3, when using the proposed system, are due to the fact that the clustering process is performed for each query, thus leading to some differences in the results, that may have some influence on the results.","refs":[{"start":6,"end":7,"marker":"table","target":"#tab_0"}]},{"text":"Users understood the meaning of the two visualization paradigms. The main difficulties in the geometric visualization is that it was not always easy to distinguish differences in terms of color and side number, while for the urban visualization users had issues in understanding the meaning of the different types of building. ","refs":[]}]},{"title":"Untrained Testing Results","paragraphs":[{"text":"Table 3 and 4 report the results, in terms of clicks and seconds required to accomplish the tasks, for the \"untrained testing\". As expected the figures are much higher than in the previous test, however the tests revealed that the main difficulties were due to the comprehension of the meaning of the buttons used to access the contents related to the search, that are not associated to any visual paradigm. For example, when required to search the images in task 4, the users had to figure out which button is used to show the images related to the search. The time required to complete the tasks using the urban visualization paradigm is 2.6 times higher than with the other representation, despite the fact that the average number of clicks is about the same: this is due to the fact that the more graphically detailed presentation requires more time to be understood, than the abstract representation.","refs":[{"start":6,"end":7,"marker":"table","target":"#tab_2"}]}]},{"title":"Conclusions","paragraphs":[{"text":"In this paper was presented a framework to visualize heterogenous information from the World Wide Web. Given a query string, the proposed system extracts the results from a web clustering engine and represent them according to a graph-based visualization technique. The GUI allows the end-user to explore the information space and visualize related content extracted from different resources, like multimedia databases and social networks.","refs":[]},{"text":"Two different visualization paradigms have been developed and tested in usability experiments, to evaluate their effectiveness in letting end-user to have a better comprehension of the categories and semantic relationships existing between the search results, thus achieving a more efficient retrieval of the web documents. Experimental results demonstrate the effectiveness of the proposed solution.","refs":[]},{"text":"Future work will address an extended experimental evaluation with different user-interfaces, to overcome the difficulties highlighted in the experiments, as well as an expansion of methods used for the extraction and linking of multimedia content related to the textual searches.","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Number of mouse clicks used to complete tasks assigned to the users participating in the trained testing","rows":[["","Task 1 Task 2 Task 3 Task 4"],["Google user 1","6","3","2","3"],["Google user 2","2","5","2","3"],["Google user 3","3","4","4","5"],["Google users avg.","3.7","4","2.7","3.7"],["Urban user 1","20","15","2","2"],["Urban user 2","4","2","15","2"],["Urban user 3","9","6","0","5"],["Urban users avg.","11","7.7","5.7","3"],["Geometric user 1","2","2","2","2"],["Geometric user 2","2","6","3","3"],["Geometric user 3","2","7","11","2"],["Geometric users avg.","2","5","5.3","2.3"]]},"tab_1":{"heading":"Table 2 .","description":"Number of seconds used to complete tasks assigned to the users participating in the trained testing","rows":[["","Task 1 Task 2 Task 3 Task 4"],["User 1: Google","120","120","20","30"],["User 2: Google","70","110","30","15"],["User 3: Google","160","90","40","30"],["Google users avg.","116.7 106.7","30","25"],["User 4: urban","300","250","100","100"],["User 5: urban","180","25","300","20"],["User 6: urban","300","180","10","120"],["Urban users avg.","260","151.7 136.7","80"],["User 7: geometric","30","60","20","15"],["User 8: geometric","45","60","120","20"],["User 9: geometric","20","120","160","40"],["Geometric users avg. 31.7","80","100","25"]]},"tab_2":{"heading":"Table 3 .","description":"Number of clicks used to complete tasks assigned to the users participating in the untrained testing","rows":[["","Task 1 Task 2 Task 3 Task 4"],["User 8: urban","35","48","20","10"],["User 9: urban","31","35","50","8"],["Urban users avg.","33","41.5","35","9"],["User 8: geometric","72","54","34","40"],["User 9: geometric","40","7","11","2"],["Geometric users avg. 56","30.5","22.5","21"]]},"tab_3":{"heading":"Table 4 .","description":"Number of seconds used to complete tasks assigned to the users participating in the untrained testing","rows":[["","Task 1 Task 2 Task 3 Task 4"],["User 8: urban","420","500","310","100"],["User 9: urban","180","210","130","20"],["Urban users avg.","260","151.7 136.7","80"],["User 8: geometric","310","180","200","230"],["User 9: geometric","140","50","90","30"],["Geometric users avg. 31.7","80","100","25"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"One of the most challenging issues in managing the large and diverse data available on the World Wide Web is the design of interactive systems to organize and represent information, according to standard usability guidelines. In this paper we define a framework to collect and represent information from different web resources like search engines, real-time networks and multimedia distributed databases. A prototype system has been developed, following the Rich Internet Application paradigm, to allow end-users to visualize, browse and analyze documents and their relationships in a graph-based user interface. Different visual paradigms have been implemented and their effectiveness has been measured in usability tests with real users.","refs":[]}]}}