{"bibliography":{"title":"Optimizing Relevance Ranking to Enhance the User's Discovery Experience *","authors":[{"person_name":{"surname":"Sadeh","first_name":"Tamar"},"affiliations":[{"department":null,"institution":"Ex Libris Group","laboratory":null}],"email":"tamar.sadeh@exlibrisgroup.com"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Discovery systems","Relevance ranking","User experience","Personalized ranking"],"citations":{"b0":{"title":"Centre for Information Behaviour and the Evaluation of Research (CIBER): Information Behaviour of the Researcher of the Future","authors":[],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Perceptions of Libraries and Information Resources: A Report to the OCLC Membership","authors":[],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"OCLC","journal":null,"series":null,"scope":null},"b2":{"title":"College Students' Perceptions of Libraries and Information Resources: A Report to the OCLC Membership","authors":[],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":"OCLC","journal":null,"series":null,"scope":null},"b3":{"title":"Multiple Dimensions of Search Results","authors":[{"person_name":{"surname":"Sadeh","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Clustering versus Faceted Categories for Information Exploration","authors":[{"person_name":{"surname":"Hearst","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Communications of the ACM","series":null,"scope":{"volume":49,"pages":{"from_page":59,"to_page":61}}},"b5":{"title":"Relevance: A Review of and a Framework for the Thinking on the Notion in Information Science","authors":[{"person_name":{"surname":"Saracevic","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"1975","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Am. Soc. Inf. Sci. Technol","series":null,"scope":{"volume":26,"pages":{"from_page":321,"to_page":343}}},"b6":{"title":"Relevance: A Review of the Literature and a Framework for Thinking on the Notion in Information Science. Part II: Nature and Manifestations of Relevance","authors":[{"person_name":{"surname":"Saracevic","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Am. Soc. Inf. Sci. Technol","series":null,"scope":{"volume":58,"pages":{"from_page":1915,"to_page":1933}}},"b7":{"title":"User Perspectives on Relevance Criteria: A Comparison among Relevant, Partially Relevant, and Not-Relevant Judgments","authors":[{"person_name":{"surname":"Maglaughlin","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sonnenwald","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Am. Soc. Inf. Sci. Technol","series":null,"scope":{"volume":53,"pages":{"from_page":327,"to_page":342}}},"b8":{"title":"The Online Library Catalog: Paradise Lost and Paradise Regained?","authors":[{"person_name":{"surname":"Markey","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"D-Lib Magazine","series":null,"scope":{"volume":13,"pages":null}},"b9":{"title":"Twenty-five Years of End-User Searching, Part 2: Future Research Directions","authors":[{"person_name":{"surname":"Markey","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Am. Soc. Inf. Sci. Technol","series":null,"scope":{"volume":58,"pages":{"from_page":1123,"to_page":1130}}},"b10":{"title":"Uncertainty in Action: Observing Information Seeking within the Creative Processes of Scholarly Research","authors":[{"person_name":{"surname":"Anderson","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IR Information Research","series":null,"scope":{"volume":12,"pages":null}},"b11":{"title":"Discoverability: Phase 2","authors":[{"person_name":{"surname":"Hanson","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Hessel","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Boudewyns","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Fransen","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Friedman-Shedlov","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Hearn","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Herther","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Theis-Mahon","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Morris","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Traill","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"West","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Developed at the turn of the millennium to enable users with little information literacy to reach general information without the help of mediators (such as travel agents, salespeople, or librarians), Web search engines have shaped the way in which students and researchers seek scholarly information today. However, the ease of use, immediacy of results, and heterogeneous nature of information provided by Web search engines such as Google trigger expectations that libraries have only recently started to meet with \"new-generation\" library discovery systems (e.g., [1], [2], [3]). These index-based discovery systems, available from 2009, aim to provide a single entry point to the scholarly information landscape and enable users to search in a Google-like way in local, global, and regional collections that libraries offer their users. Such global and regional collections, provided by primary and secondary publishers and aggregators, include journal articles, e-books, conference proceedings, newspaper articles, theses, patents, and other types of materials. The collections differ in many ways, such as in the type of content (metadata, abstract, or full text), the format and depth of the available metadata, and the licensing options.","refs":[{"start":568,"end":571,"marker":"bibr","target":"#b0"},{"start":573,"end":576,"marker":"bibr","target":"#b1"},{"start":578,"end":581,"marker":"bibr","target":"#b2"}]},{"text":"Although new-generation discovery systems may match Web search engines in ease of use and speed, the success of a search process is measured not just by the amount of time that elapses until a result list is displayed. Much more important is the amount of time that an information system takes to satisfy a user's need and furnish the desired outcome. A key challenge of library discovery systems is how to provide users with the most relevant items from the immense landscape of available content. To meet this challenge, developers have enriched systems with new features. For example, faceted navigation helps users quickly refine their result list and focus on its subsets (see [4] and [5]), and recommendations based on other users' prior selections draws searchers' attention to items related to the topic of their search, even when such articles do not match the query terms that the searchers entered.","refs":[{"start":682,"end":685,"marker":"bibr","target":"#b3"},{"start":690,"end":693,"marker":"bibr","target":"#b4"}]},{"text":"However, because of their familiarity with Google and other search engines, users of discovery systems tend to scan only the topmost results; hence, items that are most relevant for a particular search can easily remain unnoticed if they are not displayed near the top of the list. Whereas past discussions of relevance in information retrieval distinguished between what is relevant and what is not, the current focus is on the degree of relevance, with the understanding that \"in the most fundamental sense, relevance has to do with effectiveness of communication\" [6]. Relevance ranking, whose purpose is to highlight materials that the system deems the most pertinent for the particular query, has become a major factor in satisfying user needs. Together with the immediate delivery of retrieved items, relevance ranking has had a huge impact on increasing the value of library services for users and institutions.","refs":[{"start":567,"end":570,"marker":"bibr","target":"#b5"}]}]},{"title":"Relevance in the Scholarly Domain","paragraphs":[{"text":"Although \"relevance is a, if not even the, key notion in information science in general and information retrieval in particular\" [7], the application of relevance in library information systems developed in the past was (and in some of those systems, continues to be) limited to a binary approach: a document was considered either relevant or not relevant to a specific query. The determination was based on the textual similarity between the item and the query; the user's specific information need, among other things, was not considered, and results were not arranged according to the degree of relevance to the specific user. Rather, results were displayed according to unambiguous criteria, such as the date or the alphabetic order of the title or author name.","refs":[{"start":129,"end":132,"marker":"bibr","target":"#b6"}]},{"text":"Over the past decade, library information systems entered a new realm and adopted relevance ranking so that result lists would address user expectations. Harnessing traditional relevance-ranking methods used by other information systems, library systems adjusted the methods for scholarly materials.","refs":[]},{"text":"The theoretical aspects of relevance ranking have been studied for many years [e.g., 8], but literature on practical implementations has been lacking. In an attempt to develop an automated calculation of relevance that includes information about the user and the userÊs information need and leverages well-structured metadata and other data available about scholarly materials, one discovery system vendor, Ex Libris, conducted a research program whose results transformed the discovery systemÊs relevance ranking.","refs":[]}]},{"title":"Direct and Inferred Assessment of Relevance","paragraphs":[{"text":"One of the major challenges in developing relevance ranking is assessing its success. Because relevance is subjective, a qualitative evaluation of success depends on the characteristics of each individual who tests the information system. One's specific information needs, expectations, and expertise in both the area of research and searching techniques come into play when one assesses the relevance of displayed results.","refs":[]},{"text":"Another approach, less dependent on the engagement of individuals in testing, is to compare the order in which a system displays the results with the order of results in another system that is known to have excellent relevance ranking. This approach, while easy to implement, has major shortcomings. First, no scholarly information system has a relevance-ranking method that is reliable enough to serve as a model. Second, the content available in every such system is different: in a discovery system, the content depends on the institution's subscriptions and policies; when it comes to Google Scholar or Microsoft Academic Search, the exact search scope is not documented. Third, the format, degree of completeness, and depth of the available metadata (basic or comprehensive metadata) and the presence or absence of full text in addition to metadata differ from one system to another.","refs":[]},{"text":"An alternative approach is to quantitatively test how modifications in relevanceranking technology affect searchers' behavior. An analysis of usage data from a large number of users can shed light on their overall satisfaction; measures such as an increase in the number of sessions that culminate in the selection of an item and a higher average position of selected items in the result list are likely to indicate that the relevance ranking has improved.","refs":[]}]},{"title":"4","paragraphs":[{"text":"Relevance-Ranking Project","refs":[]}]},{"title":"Aim and Objectives of the Project","paragraphs":[{"text":"In 2010, a centralized, cloud-based index of hundreds of millions of global and regional scholarly materials such as journal articles, e-books, conference proceedings, and newspaper articles was added to the Ex Libris Primo ® discovery system. As a result, users at Primo libraries can launch a single search that covers both their local library holdings and an information landscape that transcends the traditional boundaries of the library's offering. This landscape includes subscribed and open-access materials and, if the library so desires, materials that the library or the user can purchase on demand. Because of the amount of data available, the heterogeneous nature of this virtual collection, and users' tendency to implement \"simple\" search queries [9], [10], the Primo system's relevance ranking had to be enhanced to effectively support the needs and expectations of the users. To investigate the ways in which Primo relevance ranking should be improved, Ex Libris assembled a team of information retrieval experts, research and development staff, and product managers. In March 2011, the team began a long-term project to support the continued development of the Primo relevance-ranking technology. The team defined the following project objectives:","refs":[{"start":761,"end":764,"marker":"bibr","target":"#b8"},{"start":766,"end":770,"marker":"bibr","target":"#b9"}]},{"text":"• Examine search logs and usage statistics to understand search trends and the ways in which Primo accommodates the various search practices of end users • Set a baseline for the assessment of Primo relevance ranking by obtaining researchers' evaluations of the current sorting order of the results • Define metrics to evaluate the effectiveness of Primo relevance ranking • Build a test environment in which the defined metrics are used to test and monitor changes to the technology • Optimize the calculations underlying Primo relevance ranking and incorporate additional information about an item (the item's \"value score\"), the user, and the user's needs at the time of the search • Monitor real-world Primo users' search behavior over time to evaluate the impact of the improvements and suggest further improvements","refs":[]}]},{"title":"Test Environment and Testing Tools","paragraphs":[{"text":"To set a baseline that would later serve as a reference point and to test the changes that would be introduced to the relevance-ranking technology, the project team set up a test environment at the Ex Libris research and development lab and developed testing tools. The methods for evaluating relevance ranking in the test environment were based on both a qualitative evaluation by users and a comparison with Google Scholar. 1 This comparison was not limited to an examination of the differences between the result lists of Primo and Google Scholar; rather, the examination included input from researchers regarding both lists. The test environment consisted of a Primo implementation with a search scope of 40 million records, a representative sample of the content indexed in the Primo Central Index at the time of the testing. In addition, the team developed two testing tools:","refs":[{"start":426,"end":427,"marker":null,"target":"#foot_0"}]},{"text":"• A tool that makes ad hoc changes to parameters affecting the ranking method but does not require reindexing of the data or changes in the software. With this tool, the team could further boost materials published in the current year.","refs":[]},{"text":"• A tool that runs test queries and calculates two common measures of quality2 :","refs":[{"start":77,"end":78,"marker":null,"target":"#foot_1"}]},{"text":"─ Mean average precision (MAP), which indicates how successful the system was in ranking \"best\" items above other items. A \"best\" item is one that should appear on the first page of results. ─ Mean reciprocal rank (MRR), which indicates how high in the result list the first \"best\" item appears MAP and MRR metrics typically distinguish between relevant items and non-relevant items in an entire result list. However, for the purposes of the project's relevanceranking tests, a distinction was made between \"best\" results-those that should appear on the first page-and \"other\" results (which may be relevant to the query but are not necessarily relevant enough to be on the first page). Furthermore, the MAP and MRR values were calculated for only the top 20 results.","refs":[]}]},{"title":"Setting a Baseline","paragraphs":[{"text":"The project began with a user evaluation of the Primo relevance ranking that was available in March 2011. To enable the team to obtain a more objective assessment, the evaluation included a comparison between Primo relevance ranking and that of Google Scholar (the team kept in mind the caveats regarding such a comparison, as previously mentioned). The data from the evaluation formed a baseline to help the team assess the impact of future improvements.","refs":[]},{"text":"A group of senior researchers from several institutions agreed to evaluate the results of the Primo relevance ranking. These evaluators work in various disciplines: agriculture, anthropology, biology, medicine, military and security studies, philosophy, and physics. 3 Each evaluator created search queries related to his or her area of expertise, including broad-topic queries, narrow-topic queries, known-item queries, and other types (Fig. 1). In addition, the project team conducted in-depth interviews with three evaluators to learn what they expect from a scholarly information system.","refs":[{"start":267,"end":268,"marker":null,"target":"#foot_2"},{"start":443,"end":444,"marker":"figure","target":null}]}]},{"title":"Fig. 1. A sample of the experts' queries","paragraphs":[{"text":"The team ran the queries in Primo and Google Scholar and sent each evaluator a spreadsheet that listed, for each query, the first 20 results returned by Primo and the first 20 results returned by Google Scholar. To exclude bias as a factor in the evaluation, the team did not inform the evaluators of the results' origin. The evaluators' task was to indicate whether each item should be displayed on the first page of results. Also, for each item that the evaluators said should not be on the first page, they were asked to explain why, by se reasons (Fig. 2 and Fig. 3) vant at all, too old, insignifi specific, too broad, and not The project team received the evaluations and calculated the lists' MAP and MRR. Despite the fact that the test environment covered only 40 million Primo Central Index records, the results clearly showed that as a starting point for the project, the Primo ranking was respectable. For narrow-topic searches, the MAP of Primo was better than that of Google Scholar; for known-item searches, the Primo MAP was surprisingly high in light of the fact that the data searched was much smaller than Google Scholar's; and for broad-topic searches and \"other\" searches (not one of these three types), Google Scholar's MAP was better (Table 1). An analysis of evaluators' reasons for disqualifying results from inclusion on the first result page showed that in 29% of the cases, the journal in which the paper was published was deemed insignificant; in 20% of the cases, the evaluator considered the author insignificant; and in 15% of the cases, the material (typically an article) was too specific. These reasons do not apply to known-item searches, in which users want a specific item, regardless of the prominence of the author or journal. In exploratory searches, which can yield a very large number of results, evaluators expected results of a general nature, such as the most important review articles on a topic from top journals and leading researchers. Evaluators disqualified 7% of the items for being too old.","refs":[{"start":557,"end":558,"marker":"figure","target":null},{"start":568,"end":569,"marker":"figure","target":null},{"start":1263,"end":1264,"marker":"table","target":"#tab_0"}]},{"text":"The queries from the initial tests were stored with the researchers' evaluations and later served as queries for testing new enhancements to the Primo relevance ranking.","refs":[]}]},{"title":"Optimizing the Basic Relevance-Ranking Technology","paragraphs":[{"text":"Before introducing new factors, the project team set out to improve the relevanceranking technology available in March 2011. This technology used traditional ranking methods that had been adapted to the scholarly domain. One method, for example, was the weighting of metadata fields according to the significance of the bibliographic detail stored in them; hence, query terms in a subject field, for instance, contributed more value to a specific item's ranking than the terms' occurrence in the full text.","refs":[]},{"text":"On the basis of the evaluators' input and customer feedback on the system, the team leveraged the built-in boosting mechanism of Primo: using a tool developed for the testing, the team changed the boosting factors and then monitored the impact. For example, although journal articles were already more prominent than other material types, the team decided to boost these articles even more. The resulting MAP and MRR values peaked when the boosting factor was roughly 1.5 (Fig. 4), indicating that 1.5 is the optimal boosting factor for this material type. ","refs":[{"start":478,"end":479,"marker":"figure","target":"#fig_1"}]}]},{"title":"Adding a Value Sco","paragraphs":[{"text":"After optimizing the techno As a result of the interview scholarly significance of an result list. This new factor, Rank in that both are attrib independent of a given quer The team determined th mation, including the numb recommender database. 4 A the team recalculated the M indeed, the values went up, relevance ranking and that t","refs":[]},{"text":"In the future, the team pl such as the scholarly impac anges 2011, incorporated these changes in the relevance-rank monitored the impact of the changes on users' informati g the following factors in particular: mes per session that a user moved to the next page of d that users would typically go to the next page only w was not satisfied by the items already displayed. ons that culminated in the selection of an item 5 conds that elapsed from the beginning of a session until e selected items in the result list risgroup.com/category/bXRecommender. is the user's explicit request to obtain an item. This test ran for nine we evaluations were logged. Th 0.79, respectively) were m (Fig. 6). The improvement ogy's enhancements and th However, the fact that the searchers is likely to have p probably differ from those familiar with the available c graduate students might be should not be on the first evaluation of relevance is knowledge (or lack of know ce Ranking to Enhance the User's Discovery Experience ata er improvements, the project team extended the corpus ore users-graduate students recruited from several univ c fields. This time, the test environment enabled the eval of millions of records covered by the Primo Central In ion records available for the first evaluators). In additi he test environment was enhanced with thumbs-up to each of the first 20 results (Fig. 5). The testers used r an item should or should not be located on the first re ach query, its first 20 results, and the users' feedback.","refs":[{"start":688,"end":689,"marker":"figure","target":"#fig_5"},{"start":1383,"end":1384,"marker":"figure","target":"#fig_3"}]},{"text":"for providing feedback on the relevance of materials displayed eeks beginning in August 2011, and 560 valid queries w he mean MAP and MRR values of all the queries (0.69 much higher than the values from the initial testing ph was attributed primarily to the relevance-ranking techn he availability of the full scope of the index for searchi e evaluators were graduate students rather than senior played a role as well: graduate students' information ne e of senior researchers, and the students are perhaps l content than more experienced researchers are.  The team also assumed t provide general informatio theory, the most appropriat theory is, such as reference specific issues related to op","refs":[]},{"text":"To improve the ranking adaptations to the relevanc of identifying broad-topic q more likely to address the s 6 According to a survey by Un graduates submit differ signi undergraduate searches are their area, they tend to search cond column) and MRR (third column) values calculated for age, as evaluated by graduate students the Equation adjusting the relevance-ranking calculations to suit cert idual and his or her specific information need as eviden eased in June 2012) incorporated these adjustments.","refs":[]},{"text":"cording to an analysis of search logs, 25% to 30% of o users are general in nature or applicable to many are many examples of broad-topic queries, such as kor nture education; stereoisomerism; social mobility; min ry; sensitivity; and tetrodotoxin. oad-topic query, they do not have a specific documen a large result set. The project team's assumption was t query when they want to explore an area with which t example, undergraduates who are seeking material fo eneral topic or researchers who are looking for informat which they are not familiar. 6  that for broad-topic queries, users would prefer results t on. For example, when a user submits the query opera te results would be documents that explain what opera materials or review articles, rather than articles address perator theory.","refs":[]},{"text":"of results from broad-topic queries, the team made seve ce-ranking calculations, including offline processing, w queries in real time, and the boosting of materials that pecific needs of users who formulate this type of query. niversity of Minnesota Libraries, the types of queries that un ificantly from queries that graduate students submit: over 70% exploratory, but as researchers become more knowledgeabl h more for specific items [12]. As with broad-topic queries, the team adapted the relevance-ranking calculations to improve the handling of author-related queries. These adaptations include offline processing, methods of identifying author names in real time, and the rephrasing of queries to better address the presumed intention of the user.","refs":[{"start":436,"end":440,"marker":"bibr","target":"#b11"}]},{"text":"Personalized Ranking. Personalized ranking shows much promise and can be addressed on several levels. By deploying such ranking, a discovery system may be able to minimize the number of irrelevant results stemming from topic ambiguity; furthermore, the system can adjust the type of materials to the user's level of expertise. In interdisciplinary research specifically, any division of the search scope by formal disciplinary boundaries may prevent successful discovery; however, an allencompassing system that tailors the results to the particular user will improve the likelihood of a successful outcome.","refs":[]},{"text":"Today, the Primo technology takes into account a user's academic degree and discipline (without identifying the person). Users decide whether they wish to provide these details, and if so, the system keeps the information in the users' personal profile, where they can modify it.","refs":[]},{"text":"Identifying a user's academic degree enables Primo to provide the most suitable results for a topic search. Undergraduates probably need general materials, whereas experienced researchers are likely to seek more in-depth publications. Therefore, on the basis of a user's degree, Primo boosts specific material types for topic searches.","refs":[]},{"text":"With information about a user's discipline, Primo can boost items in that area-a particularly important feature when search terms apply to several areas. For example, unless the user's discipline is factored into the ranking calculation, the query memory efficiency yields results in engineering, medicine, psychology, and other areas. Similarly, when an author-related query contains a common name, the relevance-ranking technology can boost items from authors who publish in the user's field.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"The relevance-ranking project has demonstrated the feasibility of a methodic approach to developing and testing methods of relevance ranking in a scholarly information system. Although the relevance of a document is always a function of a specific user at a certain point in time, some aspects of relevance can be generalized and deployed in an automated system. The project described here shows that when relevance ranking incorporates the scholarly significance of items, assumptions about a user's type of information need as inferred from the query, and a correlation between a user's academic area and the topics of available materials, the probability that the most relevant items will be displayed at the top of the result list increases.","refs":[]},{"text":"Nevertheless, the calculation of relevance remains an area that requires constant rethinking, monitoring, and tuning. We can only agree with Saracevic's remark that \"there were, still are, and always will be many problems with relevance. This is not surprising. Relevance is a human-not a systems-notion and human notions are complex, even messy. Oh well, they are human\" [7].","refs":[{"start":372,"end":375,"marker":"bibr","target":"#b6"}]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Baseline mean average precision scores for Primo and Google Scholar results","rows":[["Query type","Primo MAP","Google Scholar MAP"],["Broad-topic","0.31","0.72"],["Narrow-topic","0.52","0.37"],["Known-item","0.52","0.67"],["Other","0.36","0.70"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"With the introduction of library discovery systems, the display of results according to relevance, as determined by the system, has become a norm. To investigate how relevance ranking could be optimized, a provider of a widely used discovery system developed methods of evaluating the system's relevance ranking. As a result, new factors were added to the calculation of search results' relevance-information about the individual user and the user's information needs, and an indicator representing the academic significance of materials. Methods of monitoring the impact of changes were also established.","refs":[]}]}}