{"bibliography":{"title":"CULTURA Outcomes for Improving the User's Engagement with Cultural Heritage Collections","authors":[{"person_name":{"surname":"Agosti","first_name":"Maristella"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"agosti@dei.unipd.it"},{"person_name":{"surname":"Ferro","first_name":"Nicola"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"ferro@dei.unipd.it"},{"person_name":{"surname":"Orio","first_name":"Nicola"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"nicola.orio@unipd.it"},{"person_name":{"surname":"Ponchia","first_name":"Chiara"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"ponchiachiara1@gmail.com"}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.007","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Visualisation tools","Cultura environment","User's engagement","Ipsa digital collection","Cultural heritage collections","Narrative","Cultura project","Cultura outcomes"],"citations":{"b0":{"title":"User Requirements for Effective Access to Digital Archive of Manuscripts","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of Multimedia","series":null,"scope":{"volume":7,"pages":{"from_page":217,"to_page":222}}},"b1":{"title":"Engaging the User: Elaboration and Execution of Trials with a Database of Illuminated Images","authors":[{"person_name":{"surname":"Ponchia","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":354,"pages":{"from_page":207,"to_page":215}}},"b2":{"title":"IPSA: A Digital Archive of Herbals to Support Scientific Research","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":253,"to_page":264}}},"b3":{"title":"An Evaluation of the Involvement of General Users in a Cultural Heritage Collection","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Manfioletti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Ponchia","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"University of Nebraska","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":75,"to_page":77}}},"b4":{"title":"A Formal Model of Annotations of Digital Content","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"ACM Trans. on Information Systems","series":null,"scope":{"volume":26,"pages":{"from_page":1,"to_page":3}}},"b5":{"title":"Annotation Search: The FAST Way","authors":[{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":5714,"pages":{"from_page":15,"to_page":26}}},"b6":{"title":"Interacting with Digital Cultural Heritage Collections via Annotations: The CULTURA Approach","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Conlan","first_name":"O"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Hampson","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Munnelly","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":13,"to_page":22}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Two departments of the University of Padua, the Department of Information Engineering and the Department of Cultural Heritage, were involved in the European project CULTURA 1 , a STREP EU FP7-ICT project active from February 2011 to January 2014 2 . The project brought together researchers in history of art and computer science, adopting a user-centred approach that was followed for the entire duration of the project -from gathering user requirements to continuous evaluation with different categories of users 3,4 .","refs":[{"start":515,"end":517,"marker":"bibr","target":"#b0"},{"start":517,"end":518,"marker":"bibr","target":"#b1"}]},{"text":"The cultural heritage collection IPSA (Imaginum Patavinae Scientiae Archivum) 5 was used as one of the case studies for the development and validation of the CULTURA environment 6 . IPSA, which is a digital archive of illuminated scientific manuscripts produced mainly in Northern Italy in the late Middle-Ages and early Renaissance, was created both as a digital collection and a web application during a previous collaboration between the two departments 7 . The evaluation results collected on user engagement with the IPSA collection 8 , together with the other ones managed by the CULTURA environment, show that is possible to consider effectively including additional collections of comparable content in the CULTURA environment.","refs":[{"start":78,"end":79,"marker":"bibr","target":null},{"start":178,"end":179,"marker":"bibr","target":null},{"start":457,"end":458,"marker":"bibr","target":"#b2"},{"start":538,"end":539,"marker":"bibr","target":"#b3"}]}]},{"title":"Goals and Technologies of the CULTURA Project","paragraphs":[{"text":"The objective of the CULTURA project was to pioneer the development of personalised information retrieval and presentation, contextual adaptivity and social analysis in a digital humanities context. This is motivated by the desire to provide a fundamental change in the way digital cultural heritage is experienced, analysed and contributed to by communities of interested individuals. These communities typically comprise a diverse mixture of domain and nondomain professional researchers, apprentice researchers (e.g. students of History and History of Art), informed users (e.g. users belonging to relevant cultural associations, interested groups or authorities) and interested members of the general public.","refs":[]},{"text":"CULTURA promotes and integrates the following key technologies:","refs":[]},{"text":"• Natural language processing, to normalise ambiguities in noisy historical texts, together with entity and relationship extraction, to identify the key entities and relationships within unstructured text. • Social network visualisation of the cultural heritage items and their relationships, to allow users to discover new items by inspecting the visual representation. • Multi-model adaptivity to support dynamic reconciliation of multiple dimensions of personalisation and permit users to adjust the parameters of their personalisation. • An annotation service for enriching the digital collection with user-generated content in the form of textual annotations on complete items or image details and in the form of explicit relationships drawn between different items of content. • Automatic lessons in the form of narratives that guide the user through the digital collection, helping them to discover relevant characteristics and understand the research work of scholars studying illuminated manuscripts.","refs":[]},{"text":"An important part of the work carried out in CULTURA regarded continuous evaluation with different cohorts of users, from scholars to apprentice investigators and the general public. The results of the different evaluation phases guided the development of the CULTURA environment.","refs":[]}]},{"title":"Features for Deeper Interaction with Culture Collections","paragraphs":[{"text":"The IPSA collection gathers the detailed records of 56 illuminated scientific (astrological, astronomical, botanical) manuscripts, and the detailed records of their illuminations as well, reaching the remarkable amount of more than 3000 digital images. It was created specifically for professional researchers in History of Art and History of Illumination to allow them to compare the illuminations held in the digital collection and to verify the development and the spread of a new scientific frame of mind in the 14th century at the University of Padua and a new realistic way of painting that influenced the following artistic production also in the surrounding areas and in other parts of Italy.","refs":[]},{"text":"In the CULTURA environment it is now possible to study the IPSA collection and take advantage of new useful features that were previously unavailable and that allow a deeper and more precise exploration of the resources. The most notable new features are introduced in the following.","refs":[]}]},{"title":"Visualisation Tools","paragraphs":[{"text":"Thanks to two different visualisations, the wheel and the octopus, the user is able to see at a glance all the different relations between the illumination they are studying and the other elements held in the collection, such as other representations of the same subject, the manuscripts they belong to, as well as places and persons related to the history of the manuscripts. For example, if the user is studying the iconographic development of the representation of wormwood (Artemisia absinthium, referred to in the manuscripts as absenço) between the Middle Ages and the Renaissance, thanks to the visualisation tool they can see all the manuscripts containing its representation, or, if they are interested in the illuminated manuscript production of a particular place, they can easily check the place of origin of the manuscripts held in the collection and identify all the manuscripts belonging to the same area, region or city, see Fig. 1. All graphical elements in the visualisation tools are active links, which direct the user to the corresponding content. In particular, it is possible to access the cataloguing information of all the different illustrations of the same plant. In this way, the user can start navigating inside the collection.","refs":[{"start":946,"end":947,"marker":"figure","target":"#fig_0"}]}]},{"title":"Notes and Annotations","paragraphs":[{"text":"In CULTURA users can study the illuminations and keep track of their research process or of their thoughts and reflections by using two different tools: notes and annotations.","refs":[]},{"text":"The note tool allows the user to annotate the whole image, while the annotation tool gives the user the possibility to annotate a single detail of an illumination, or a single part of the catalogue file text that accompanies the image. In particular, this tool is very useful for art historians, as slight differences in the pictorial technique and iconography often help to recognise the authorship of an artist, or to connect an illumination to its correct art-history background. Thus, in CULTURA, professional users are given the possibility to highlight every single image detail that is relevant for their research, and take note of the reasons why it is important. In addition, the annotation tool can be profitably used in a teaching context, as professors can use it to better clarify to undergraduate students the way art historians work with images.","refs":[]},{"text":"Annotations are a powerful tool for improving the engagement of art historians, students, and general users of the system with the managed collections. This is further strengthened by the possibility of sharing annotations within groups of users, thus creating work groups on a topic. See Fig. 2 which shows an example of an annotation on an area of an illustration.","refs":[{"start":294,"end":295,"marker":"figure","target":"#fig_1"}]},{"text":"Two components contribute to the annotation functionalities of the CULTURA environment:","refs":[]},{"text":"• the Flexible Annotation Semantic Tool (FAST), a RESTful Web service which allows the user to annotate resources in the Web and Digital libraries according to a powerful annotation model 9,10 , and • the Content Annotation Tool (CAT) 11 , the front-end shown in Fig. 2, which allows the user to select areas of images, annotate them and link them to other resources, either other illuminated manuscripts or external resources on the Web. ","refs":[{"start":188,"end":190,"marker":"bibr","target":"#b4"},{"start":190,"end":192,"marker":"bibr","target":"#b5"},{"start":235,"end":237,"marker":"bibr","target":"#b6"},{"start":268,"end":269,"marker":"figure","target":"#fig_1"}]}]},{"title":"The Narratives","paragraphs":[{"text":"Not only do the new CULTURA tools help professional researchers and interested users in their activities, they also facilitate the involvement of new user categories that are not usually involved in digital humanities and digital cultural heritage.","refs":[]},{"text":"Users that are not familiar with History of Art and History of Illumination can easily learn the main concepts of these disciplines and how to use the CULTURA tools to browse the IPSA collection thanks to the narratives held in the system. Narratives are paths through the collection designed by expert researchers. Each narrative has a number of levels, and the user can decide whether to stop at the first level or go deeper into the study of the issue. If they do so, they will be presented with additional resources to increase their knowledge and comprehension of the items they had already seen during the narrative. Thus users are given all the preliminary information they need to understand and appreciate the collection, such as basic concepts on illuminated manuscripts, their history, their use in the Middle Ages, and the main painting techniques that can be found in the IPSA illuminations.","refs":[]},{"text":"Narratives also present users with the CULTURA tools, showing their application, so that users can use them profitably for their own discovery of the collection.","refs":[]},{"text":"An additional feature that was highly appreciated by members of the general public, and in general people without a specific knowledge in the History of Illumination field, was the possibility to easily get further information on the items of the collection (works, authors, scribes, locations and illustrations) thanks to links to Wikipedia, Google and Bing that appear in the two visualisation tools.","refs":[]},{"text":"See, for example, Fig. 3. Giving non-professional users the information they lack prevents their loss of interest in the collection and increases the possibility of involving them in such a specialist discipline as the History of Illumination. ","refs":[{"start":23,"end":24,"marker":"figure","target":"#fig_2"}]}]},{"title":"Conclusions and Future Work","paragraphs":[{"text":"We present the results of a long-term project that involved the creation of a digital collection of illuminated manuscripts, called IPSA, and its inclusion within the test collections used in CULTURA as a case study to showcase the innovative tools developed during the three-year project.","refs":[]},{"text":"The results presented in this paper can be a starting point for developing further research. One major asset is the availability of the results in user interaction with the collection, both in terms of user logs and surveys, and in terms of annotations on the digital content. The presence of user generated content can be of interest for additional studies on how cultural heritage collections can involve different categories of users.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper reports on the outcomes of the CULTURA project that aims to improve user engagement with digital cultural heritage collections. The IPSA digital collection has been used as a case study for the development of novel personalised access tools for a variety of different user categories. The evaluation results collected on user engagement with the used cultural heritage collections show that the users become involved and engaged.","refs":[]}]}}