{"bibliography":{"title":"The TRAME Project -Text and Manuscript Transmission of the Middle Ages in Europe","authors":[{"person_name":{"surname":"Degl'innocenti","first_name":"Emiliano"},"affiliations":[{"department":null,"institution":"Fondazione Ezio Franceschini","laboratory":null}],"email":"emiliano@fefonlus.it"},{"person_name":{"surname":"Cosco","first_name":"Alfredo"},"affiliations":[{"department":null,"institution":"SISMEL","laboratory":null},{"department":null,"institution":"ZKS Foundation","laboratory":null}],"email":"alfredo.cosco@gmail.com"},{"person_name":{"surname":"Butini","first_name":"Fabrizio"},"affiliations":[{"department":null,"institution":"Fondazione Ezio Franceschini","laboratory":null}],"email":null},{"person_name":{"surname":"Giacomi","first_name":"Roberta"},"affiliations":[{"department":null,"institution":"SISMEL","laboratory":null}],"email":null},{"person_name":{"surname":"Serafini","first_name":"Vinicio"},"affiliations":[{"department":null,"institution":"SISMEL","laboratory":null}],"email":null}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1_9","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Meta-crawler","Medieval manuscripts","Search engine","Crawler","Digital humanities","User experience","Illuminated manuscripts"],"citations":{},"sections":[{"title":"How TRAME Engine Works","paragraphs":[{"text":"The crawler engine is written in OO-PHP, the design follows the HMVC Pattern,4 the RDBMS is MySql and the front-end combines Xhtml and Javascript.","refs":[{"start":77,"end":78,"marker":null,"target":"#foot_0"}]},{"text":"Currently user can choose between more than 80 sources and perform 3 kinds of search: free-text, by shelfmark (city, library, mark) or advanced (title, author, date, incipit, copyst).","refs":[]}]},{"title":"… estendi…","paragraphs":[{"text":"In function of the \"search type\", searched terms are pushed to the sources using five methods:","refs":[]},{"text":"• GET or POST classes","refs":[]},{"text":"The standard http method to pass variables by query string or a form, TRAME uses CURL5 to build the request. Few sites use a minimal protocol for interoperability of medieval manuscripts. 6 Based on TEI, it provides the base set of information useful for TRAME: a shelfmark and a URL.","refs":[{"start":85,"end":86,"marker":null,"target":"#foot_1"},{"start":188,"end":189,"marker":"bibr","target":null}]},{"text":"• CACHED class Some sites are not directly searchable, others have a limited records number, some have both of these features. For those sources TRAME uses MySQL tables where it imports any possible relevant content. Tables are not public and are only used to perform a better and faster search, the result links point to the original source.","refs":[]}]},{"title":"• SPIRIT class","paragraphs":[{"text":"Some sites perform searches by a javascript UI, using AJAX7 calls to show the results. The way to query those sources is a headless browser8 and TRAME uses casperjs and phantomjs9 to do this.","refs":[{"start":58,"end":59,"marker":null,"target":"#foot_3"},{"start":139,"end":140,"marker":null,"target":"#foot_4"},{"start":178,"end":179,"marker":null,"target":"#foot_5"}]},{"text":"Each class, customized for every source, parses the response using reg-ex and/or PHP Simple Html Dom. 10 In closing, another class renders and composes the result as a list of shelfmarks and titles linked to original sources.","refs":[{"start":102,"end":104,"marker":"bibr","target":null}]}]},{"title":"Extending the Meta-Search Approach","paragraphs":[{"text":"Since September the 1st, the aim is to extend the meta-search approach to other web resources (libraries, portals, individual research projects), using various tools and technologies.","refs":[]},{"text":"Moreover, the TRAME team is extending the engine in two other ways:","refs":[]},{"text":"• make TRAME a tool to build a knowledge base for medieval manuscripts;","refs":[]},{"text":"• ensure a better user experience,","refs":[]}]},{"title":"New Resources","paragraphs":[{"text":"Adding new resources in TRAME implies a deep analysis on sources query methods and of the response code, until 2013 of December 12 new sources were added (Table 1).","refs":[{"start":161,"end":162,"marker":"table","target":"#tab_1"}]},{"text":"To achieve the above we added:","refs":[]},{"text":"1. a new library to simplify the process to identify and extract pieces of code from results along reg-ex:","refs":[]},{"text":"• Simple HTML DOM (http://simplehtmldom.sourceforge.net/); 1. three new tools to perform searches via javascript and AJAX interfaces: A new class, called SpiritSite.class.php, has been written to manage the process.","refs":[]},{"text":"We introduced these new libraries because CRUL and Simple HTML Dom can only parse synchronous HTML and cannot interact with the page, we introduced the headless browser to manage asynchronous calls (AJAX) as in Medieval Manuscript in Dutch Collections (http://www.mmdc.nl/static/site/search/). During the development process of the engine the issue concerning the interaction between users and the TRAME application raised, to manage that we added an analytics back-end, that is made by a set of php functions:","refs":[]},{"text":"• Tracking users visiting TRAME without performing any search;","refs":[]},{"text":"• Tracking users performing searches recording:","refs":[]},{"text":"-Target resources; -Searched terms; • Recording the user interaction with the result sets.","refs":[]},{"text":"During this process the team realized that those data were also useful to populate an ontology using a bottom → up/user driven pattern.","refs":[]},{"text":"So we decided to start from those data to design the part of TRAME that will be connected with CENDARI 11 infrastructure following this design:","refs":[]},{"text":"1. A user performs a search; 2. TRAME logs information about the search and builds a list with relevant resources; 3. Leveraging on above information (i.e. the log) TRAME performs the same search using a headless browser approach to import selected pieces of information from web pages:","refs":[]},{"text":"• the couple phantomjs + casperjs works fine also to build a data scraper, through which you can use CSS, Xpath or DOM selectors. Moreover the script follows relevant links to connected pages and imports again data from them;","refs":[]},{"text":"1. The scraper produces a set of XML files with info about authors, manuscript, places etc. to be used by other internal or external knowledge extraction services.","refs":[]},{"text":"The ontology is parsed by a Name Entity Recognition (NER), this process generates an untrusted ontology, it is then submitted to a validation, using specific tools, by domain experts.","refs":[]},{"text":"The validation leads to a trusted ontology that can be queried by ad hoc instruments including the TRAME tool OntoQuery 12 and a SPARQL-endpoint.","refs":[]},{"text":"Both the trusted than the untrusted ontology are hosted in a 'triple-store', at this time our choose was for OpenRDF SESAME 13 as front-end of Openlink Virtuoso 14 .","refs":[]},{"text":"11 \"CENDARI (Collaborative European Digital Archive Infrastructure) is a research collaboration aimed at integrating digital archives and resources for research on medieval and modern European history.\" cf. http://www.cendari.eu/about-cendari/. 12 Right now OntoQuery is developing and populated by an ontology test. 13 \"Sesame is a de-facto standard framework for processing RDF data. This includes parsing, storing, inferencing and querying over such data. It offers an easy-to-use API that can be connected to all leading RDF storage solutions.\"cf. http://rdf4j.org/. 14 cf. http://virtuoso.openlinksw.com/.","refs":[{"start":317,"end":319,"marker":"bibr","target":null}]}]},{"title":"Improving the TRAME User Experience","paragraphs":[{"text":"Between 2013 and 2014 there have been some major changes in the Web, just to say two: the mobile internet exceeded the pc browsing,15 HTML5 became an official W3C standard. 16 So the TRAME team thought to re-design the tool, whose first step is to include the engine in a php fast development framework.","refs":[{"start":131,"end":133,"marker":null,"target":"#foot_7"},{"start":173,"end":175,"marker":"bibr","target":null}]},{"text":"Why?","refs":[]},{"text":"• Code maintenance and reuse The introduction of an ACL makes possible to add services to registered users like:","refs":[]},{"text":"• User shelf for sets of sources • Pre-built sources sets • Sort results • Export results (XML, RDF, FIRB, TEI, RSS) • Share results on different channels (email, blog, social networks) • Evaluate results (rating or Like).","refs":[]}]}],"tables":{"tab_0":{"heading":"1","description":"Home page: http://git-trame.fefonlus.it/. 2 E. Degl'Innocenti, Trame: Building a Meta Search Tool for the Study of Medieval Literary Traditions in EVA 2011, Proceedings. Vito Cappellini, James Hemsley (eds.), Bologna, Pitagora, 2011.","rows":[]},"tab_1":{"heading":"Table 1 .","description":"New sites added Building a Knowledge Base on Medieval Manuscripts Among others, managing TRAME showed difficulty to know what users do with the site.","rows":[["SITE","Class name","Type","Sources"],["Schoenberg Database of Manuscripts at UPENN","SHON","GET","220889"],["Libraries","","",""],["http://dla.library.upenn.edu/dla/schoenberg","","",""],["Manuscripts in the Library of St John's College,","SJCAM","CACHE","277"],["Cambridge","","",""],["http://www.joh.cam.ac.uk/library/special_","","",""],["collections/manuscripts/medieval_manuscripts/","","",""],["KUL List of microfilmed manuscripts","KULEUVEN","POST","4807"],["http://hiw.kuleuven.be/apps/microfilm/microfilm.","","",""],["php","","",""],["The MacKinney Collection of Medieval Medical","MACKINNEY","GET","1041"],["Illustrations","","",""],["http://dc.lib.unc.edu/cdm/search/collection/","","",""],["mackinney/","","",""],["Early Manuscripts at Oxford University","OXFORDMS","CACHE","90"],["http://image.ox.ac.uk/","","",""],["Beinecke Digital Collections","BDC","GET","127641"],["http://brbl-dl.library.yale.edu/","","",""],["University of Glasgow","GLASUL","POST","N/d"],["http://special.lib.gla.ac.uk/manuscripts/search/","","",""],["München","MDZ","CACHE","1300"],["http://daten.digitale-sammlungen.de","","",""],["LUND University library","LUND","CACHE","71"],["http://laurentius.ub.lu.se","","",""],["Biblioteca Municipale di Lione","BMLYON","CACHE","55"],["http://florus.bm-lyon.fr","","",""],["Univeristy Libaries in South Carolina","ULSC","CACHE","264"],["http://digital.tcl.sc.edu/","","",""],["Medieval Manuscript in Dutch Collections","MMDC","SPIRIT","N/d"],["http://www.mmdc.nl/static/site/search/","","",""]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"TRAME is a research infrastructure for medieval manuscripts. The TRAME engine scans a set of sources for searched terms and retrieves links to a wide range of possible information, from simple reference, to detailed manuscript record, to full text transcriptions. Currently, it is possible to perform queries by: free-text, shelfmark, author, title, date, copyst or incipit, on more than 80 selected scholarly digital resources across EU and USA. Since 2014 September 1st, TRAME has entered a new phase and the current work is focused on: extending the meta-search approach to other web resources, leveraging the users interaction to define an ontology for medieval manuscripts, re-designing the front-end towards a new UX approach.","refs":[]}]}}