{"bibliography":{"title":"Structured Descriptions of Roles, Activities, and Procedures in the Roman Constitution","authors":[{"person_name":{"surname":"Chu","first_name":"Yoonmi"},"affiliations":[{"department":null,"institution":"Yonsei University","laboratory":null}],"email":"yoonmichu@gmail.com"},{"person_name":{"surname":"Allen","first_name":"Robert"},"affiliations":[{"department":null,"institution":"Yonsei University","laboratory":null}],"email":null}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1_6","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Digital humanities","Roman constitution","Bfo","Community models","Ontologies","Roles","Procedures"],"citations":{"b0":{"title":"When a FrameNet-style knowledge description meets an ontological characterization of fundamental legal concepts","authors":[{"person_name":{"surname":"Agnoloni","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Fernández Barrera","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Sagri","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Tiscorni","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Venturi","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":6237,"pages":{"from_page":93,"to_page":112}}},"b1":{"title":"Towards a full-text historical digital library","authors":[{"person_name":{"surname":"Allen","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Chu","first_name":"Y"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":8839,"pages":{"from_page":218,"to_page":226}}},"b2":{"title":"Function, role, and disposition in basic formal ontology","authors":[{"person_name":{"surname":"Arp","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"1941","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Nature Proc","series":null,"scope":{"volume":null,"pages":{"from_page":1,"to_page":4}}},"b3":{"title":"Experience and history: processes and their relation to events","authors":[{"person_name":{"surname":"Galton","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Logic Comput","series":null,"scope":{"volume":18,"pages":{"from_page":323,"to_page":340}}},"b4":{"title":"The History of the Decline and Fall of the Roman Empire","authors":[{"person_name":{"surname":"Gibbon","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"1845","month":null,"day":null},"ids":null,"target":"http://www.gutenberg.org/files/731/731-h/731-h.htm","publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"SNAP and SPAN: towards dynamic spatial ontology","authors":[{"person_name":{"surname":"Grenon","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Spat. Cogn. Comput","series":null,"scope":{"volume":4,"pages":{"from_page":69,"to_page":104}}},"b6":{"title":"Representing Historical Knowledge in Geographic Information Systems","authors":[{"person_name":{"surname":"Grossner","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"Role representation model using OWL and SWRL","authors":[{"person_name":{"surname":"Kozaki","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sunagawa","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Kitamura","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Mizoguchi","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":39,"to_page":46}}},"b8":{"title":"A comparison of upper ontologies","authors":[{"person_name":{"surname":"Mascardi","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Cordì","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Rosso","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":55,"to_page":64}}},"b9":{"title":"WonderWeb Deliverable D18 Ontology Library (final)","authors":[{"person_name":{"surname":"Masolo","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Borgo","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Gangemini","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Guarino","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Oltramari","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"ISTC-CNR","journal":null,"series":null,"scope":null},"b10":{"title":"Ontologies in the legal domain","authors":[{"person_name":{"surname":"Mommers","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":264,"to_page":276}}},"b11":{"title":"Integrating Object-Oriented and Ontological Representations: A Case Study in Java and OWL","authors":[{"person_name":{"surname":"Puleston","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Parsia","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Cunningham","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Rector","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"ISWC","journal":null,"series":null,"scope":null},"b12":{"title":"Exploring historical RDF with HEML","authors":[{"person_name":{"surname":"Robertson","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"http://www.digitalhumanities.org/dhq/vol/3/1/000026/000026.html","publisher":null,"journal":"Digital Hum. Q","series":null,"scope":{"volume":3,"pages":null}},"b13":{"title":"Approaches to Legal Ontologies: Theories, Domains, Methodologies","authors":[{"person_name":{"surname":"Sartor","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Casanovas","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Biasiotti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Fernández-Barrera","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction 1.Full-Text Digital Libraries and Community Models","paragraphs":[{"text":"Full-text digital libraries could incorporate rich descriptions which allow flexible linking and interaction with the content. [2] showed how a structured passage of Gibbon's well-known Decline and Fall of the Roman Empire could be used in a novel content browser. A formal description of Roman culture and legal systems would be useful because the organization of the government of the Empire and the rights of its citizens are keys for Gibbon's analysis. Not only has no one proposed a systematically structured description for the Roman Constitution; there are many open issues about how such a framework should be constructed. Here we focus on Roles, Activities, and Procedures because they are central to such a description. This work also contributes to broader efforts to describe cultural and historical information. Our approach goes beyond using metadata to describe historical documents and artifacts; we describe the dynamic and systematic structures of entities appearing in history as reflected in various writings and other materials. Some of our earlier work examined the description of text from digitized historical newspapers. The newspapers provided relatively succinct descriptions of a broad range of activities of communities in small towns. While some of the events in the newspapers were disjoint we believe they could be unified through modeling the communities on which the newspapers report. Potentially, such community models would allow continuity and linking across events as the basis for a full-text digital library and could also link in a wide range of non-textual materials.","refs":[{"start":127,"end":130,"marker":"bibr","target":"#b1"}]}]},{"title":"Upper Ontologies","paragraphs":[{"text":"We apply ontologies with rich semantic structure to model complex entities in historical content. Upper ontologies, particularly the BFO (Basic Formal Ontology) 1 , provide a typology of entities which is domain neutral. The BFO is especially well developed and is widely used in biology but it has not previously been applied to cultural-heritage materials. BFO is considered as \"realist\" ontology. DOLCE [9,10] is another widely used upper ontology which focuses on linguistic and cognitive entities. While most work in digital humanities and digital history has used DOLCE (e.g., [7,13]), we decided to explore the BFO because the entities we wished to model were explicit social structures such as those described in a constitution or used in a fact-based news article. In some cases, social structures can be highly nuanced and subjective; indeed, modeling them can become highly contentious.","refs":[{"start":161,"end":162,"marker":null,"target":"#foot_0"},{"start":406,"end":409,"marker":"bibr","target":"#b8"},{"start":409,"end":412,"marker":"bibr","target":"#b9"},{"start":583,"end":586,"marker":"bibr","target":"#b6"},{"start":586,"end":589,"marker":"bibr","target":"#b12"}]},{"text":"BFO distinguishes between continuants (or endudrants) which persist through time and occurrents (or perdurants) that occur in time and unfold across time, e.g., processes, events, activities and changes [6]. The BFO creates separate ontologies for continuants and occurrents called SNAP and SPAN respectively. A SNAP ontology represents a snapshot of the state of reality which is composed of continuants. By comparison, a SPAN ontology applies to the reality constituted by processual entities that unfold across spatiotemporal and temporal regions. In other words, SPAN ontologies are four dimensional (4D) [6]. Additionally, BFO defines SNAP-SPAN trans-ontology relationships to coordinate these sub-ontologies in a coherent framework. Historical information should be well described because the SNAP entities can depict states of continuants and can participate in a SNAP-SPAN trans-ontology as bearers of occurrents.","refs":[{"start":203,"end":206,"marker":"bibr","target":"#b5"},{"start":609,"end":612,"marker":"bibr","target":"#b5"}]}]},{"title":"Roles, Activities, Processes, and Procedures","paragraphs":[{"text":"The BFO includes Roles in the \"specifically dependent continuant\" class. A BFO Role is a realizable entity that an independent continuant can take on but does not reflect the physical structure of that independent continuant [3]. This means that Roles are optional and their manifestation is a reflection of surrounding circumstances [8]. Separating Roles and the bearer of Roles allows for an individual to hold multiple Roles. The performance of a specific Role is determined by conditions and situations of its bearer, thus we should be able to model the context. [8] proposed a Role representation model to deal with OWL axioms and SWRL rules.","refs":[{"start":225,"end":228,"marker":"bibr","target":"#b2"},{"start":334,"end":337,"marker":"bibr","target":"#b7"},{"start":567,"end":570,"marker":"bibr","target":"#b7"}]},{"text":"Roles in the BFO have usually been applied to biological processes such as the Role of DNA in reproduction. They have not been applied to the humanities2 . Social roles imply privileges (or rights as a broader sense) and obligations (or norms or responsibilities as a broader sense) depending on how the Role is specified. For example, a person has the right to vote in an election of the committee president as a member of a committee and at the same time he/she is expected to pay taxes as a citizen.","refs":[{"start":152,"end":153,"marker":null,"target":"#foot_1"}]},{"text":"In BFO Processes are processual entities in a SPAN ontology that are occurrents or happenings located at temporal or spatiotemporal regions [6]. They involve SNAP entities as their participants and are dependent on their participants. Simple processes are continuous ongoing activity such as \"running\". Processes in SPAN can be both \"dissective\" (composed of other processes) and \"cumulative\" [6].","refs":[{"start":140,"end":143,"marker":"bibr","target":"#b5"},{"start":393,"end":396,"marker":"bibr","target":"#b5"}]},{"text":"We define Procedures, separating from Processes, as an \"inherent\" attribute of social objects such as operating rules in an organization. According to [4], Procedures are similar to closed processes that consist of a definite sequence of actions or activities leading to a specific result. We can describe Procedures with semantic structures defined in BFO. We believe that Procedures are continuants, since they are complex attributes inherent in their bearer and are just specifications of some things that could happen. A Procedure which is composed of Activities is defined as a subclass of realizable entity in contrast with Processes which are occurrents 3 .","refs":[{"start":151,"end":154,"marker":"bibr","target":"#b3"},{"start":661,"end":662,"marker":null,"target":"#foot_2"}]}]},{"title":"Application to the Roman Constitution","paragraphs":[{"text":"Gibbon's famous historical analysis considered the changes in Roman society during the Roman Empire [5]. Gibbon's text includes a large number of social concepts as well as their relationships and interaction. To explore the issues for modeling complex entities and processes we chose a sample passage dealing with Roman Constitution4 :","refs":[{"start":100,"end":103,"marker":"bibr","target":"#b4"},{"start":333,"end":334,"marker":null,"target":"#foot_3"}]},{"text":"The consuls had succeeded to the kings of Rome, and represented the dignity of the state. They superintended the ceremonies of religion, levied and commanded the legions, and presided in the assemblies both of the senate and people. … but whenever the senate empowered the first magistrate to consult the safety of the commonwealth, he was raised by that decree above the laws, and exercised, in the defence of liberty, a temporary despotism. 5In Fig. 1, we show a partial ontology to represent the concepts of Roles, Rights and Activities of the Senate and the Consuls that are the highest magistrate in the Constitution of Roman Empire. A person who is the Senate has senate role and a person who is the Consuls has first magistrate role belonged to consul role. In this representation, each Role has some Rights, which consist of Activities. If a Role has a Right and the Right that the Role owns has an Activity, then the Role is permitted to perform the Activity. This can be expressed as a SWRL rule and permitted activities of the Role can be inferred it: rule_1: role(?x) ^rights(?y) ^activity(?z) ^has right(?x, ?y) ^has activity(?y, ?z) -> permitted activity(?x, ?z) 6Separating Rights and Activities enables us to dynamically add or delete permitted activities of the Role and also to compose multiple Roles and Rights. Thus, we can describe the variability of Rights that a Role has according to time or context [8].","refs":[{"start":443,"end":444,"marker":null,"target":"#foot_4"},{"start":452,"end":453,"marker":"figure","target":"#fig_0"},{"start":1177,"end":1178,"marker":null,"target":"#foot_5"},{"start":1424,"end":1427,"marker":"bibr","target":"#b7"}]},{"text":"The final sentence of the sample passage can be regarded as a Procedure which consists of some Activities with sequences to be executed. According to the sentence, the Senate has the right to empower the First Magistrate in wartime. This right could be activated only when the safety of the Roman Commonwealth was threatened.","refs":[]},{"text":"Figure 2 shows the structure of Processes, Procedures and Activities that compose it. The wartime Procedure contains empower Activity and exercise a temporary despotism Activity, while the former is a prerequisite of exercise a temporary despotism Activity. The prerequisite of property describes the sequences of these activities. The wartime Process, which is a historical event having spatiotemporal regions 7 , is associated with the wartime procedure with realized in property defined in the SNAP-SPAN trans-ontology. This ontological model enables us to describe historical information more semantically and systematically. ","refs":[{"start":7,"end":8,"marker":"figure","target":"#fig_1"},{"start":411,"end":412,"marker":null,"target":"#foot_6"}]}]},{"title":"Discussion and Conclusion","paragraphs":[{"text":"We have examined applying the BFO to the description of Roles, Activities, Procedures and Processes such as required for the description of the Roman Constitution and, more broadly, for governmental structures of communities. With BFO, we can describe complex entities in a 4D perspective. We defined Procedures which consist of activities, distinguishing Procedures from Processes. They are inherent in objects which are its bearers as a complex type of attributes, and can be realized by Processes.","refs":[]},{"text":"We did not deal with complex workflows in our example; workflows offer several puzzles in terms of ontological modeling. Even the wartime procedure described above has an aspect of workflow since it is granted conditional on whether the Empire is at war. Workflows have same features of programming languages such as conditionals and looping. While ontologies can represent individual states, they do not typically represent full state machines. Rather, state machines are most often associated with programming languages. Some of these issues are covered by a proposed BFO structure known as a Process Profile8 . However, there is relatively little discussion of it and no formal structures have proposed for it. We suggest that its implementation requires concepts such as looping which are integral to programming languages and business process engineering. While importance of programming language features for ontologies is recognized in SPIN 9 and OWL-S, 10 these are for restricted applications and we believe that a broader integration is needed (see [2,12]).","refs":[{"start":610,"end":611,"marker":null,"target":"#foot_7"},{"start":1059,"end":1062,"marker":"bibr","target":"#b1"},{"start":1062,"end":1065,"marker":"bibr","target":"#b11"}]},{"text":"The AI and Law community has considered ontological models for legal concepts which combine lexical and conceptual meaning [11,14]. [1] showed the possibility that a legal concept like 'public function' could be modeled in ontologies using FrameNet knowledge. It also showed interconnecting 'LegalRole' and 'Action' through the case study of the 'obligation' concept. We believe there is the opportunity for more work on building ontological models of complex concepts like those we study here.","refs":[{"start":123,"end":127,"marker":"bibr","target":"#b10"},{"start":127,"end":130,"marker":"bibr","target":"#b13"},{"start":132,"end":135,"marker":"bibr","target":"#b0"}]},{"text":"Although this study has limitations, and there are complex questions such as the difficulty of tracking the changes to the Roman Constitution as it evolved through time, it suggests the potential for structured descriptions which can be useful for representing, linking and discovering of historical knowledge. By exploring some of the issues for applying Roles, Processes and Procedures, it provides a modeling framework to describe social objects as complex entities in the construction of Community Models and broader Societal Models.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"A highly structured description of entities and events in histories can support flexible exploration of those histories by users and, ultimately, support richly-linked full-text digital libraries. Here, we apply the Basic Formal Ontology (BFO) to structure a passage about the Roman Constitution from Gibbon's Decline and Fall of the Roman Empire. Specifically, we consider the specification of Roles such as Consul, Activities associated with those Roles, and Procedures for accomplishing those Activities.","refs":[]}]}}