{"bibliography":{"title":"The Archivio dei Possessori of the Biblioteca Nazionale Marciana. A Provenance Database","authors":[{"person_name":{"surname":"Braides","first_name":"Orsola"},"affiliations":[{"department":null,"institution":"Biblioteca Nazionale Marciana","laboratory":null}],"email":"orsola.braides@beniculturali.it"},{"person_name":{"surname":"Sciarra","first_name":"Elisabetta"},"affiliations":[{"department":null,"institution":"Biblioteca Nazionale Marciana","laboratory":null}],"email":"elisabetta.sciarra@beniculturali.it"}],"date":{"year":"2016","month":"04","day":"26"},"ids":{"DOI":"10.1007/978-3-319-56300-8_1","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Provenance","Owners' archive","Biblioteca nazionale marciana"],"citations":{"b0":{"title":"UNIMARC Manual: Authorities Format","authors":[{"person_name":{"surname":"Hopkinson","first_name":"A"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":538,"to_page":539}}},"b1":{"title":"","authors":[{"person_name":{"surname":"Saur","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Regole italiane di catalogazione: REICAT. ICCU","authors":[],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Bessarion's Library and the Biblioteca Marciana. Six Early Inventories","authors":[{"person_name":{"surname":"Labowsky","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"1979","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Conradus suueynheym: Arnoldus pannartzque magistri Rome impresserunt talia multa simul. Petrus cum fratre Francisco Maximus ambo huic operi aptatam contribuere domum","authors":[],"date":null,"ids":null,"target":null,"publisher":"Biblioteca Nazionale Marciana, Inc","journal":null,"series":null,"scope":{"volume":219,"pages":null}},"b5":{"title":"Le nozze disturbate, dramma giocoso per musica del signor Gaetano Martinelli romano da rappresentarsi nel Teatro Giustiniani di San Moisè il carnovale dell'anno 1766","authors":[],"date":{"year":"1766","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Apolloniou tou rodiou Argonautika, meta tōn palaiōn te, kai panu ōphelimon scholiōn. Apollonij rhodij Argonautica, antiquis una, & optimis cum commentarijs, Venetiis","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"entē garou sē biblō. Theokritou eidyllia, hex kai triakonta. Tou autou epigrammata ennea kai deka, [Roma], analōmasi … Kornēliou Benignou … pronō de kai dexiotēti, Zachariou kalliergou tou krētos","authors":[{"person_name":{"surname":"Tade Enestin","first_name":null},"affiliations":[],"email":null}],"date":{"year":"1516","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"Livres imprimés annotés: notes de propriété, notes de lecture, notes d'étude dans la base de données des possesseurs de la Biblioteca Nazionale Marciana, in: Le changement dans les écritures et les manuscrits du Moyen Age et de la Renaissance (jusqu'à 1550 environ)","authors":[{"person_name":{"surname":"Sciarra","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b9":{"title":"Romani Institutiones grammaticae, Impressae Venetiis summa diligentia, septimo Idus Martias","authors":[{"person_name":{"surname":"Manucii","first_name":"Aldi"},"affiliations":[],"email":null}],"date":{"year":"1493","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"Nota Manuziana","authors":[{"person_name":{"surname":"Venier","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Lettere Italiane","series":null,"scope":{"volume":56,"pages":{"from_page":618,"to_page":653}}},"b11":{"title":"Apollonii grammatici de constructione libri quatuor. Herodianus de numeris, Impressum Venetiis","authors":[],"date":{"year":"1495","month":null,"day":null},"ids":null,"target":null,"publisher":"Biblioteca Nazionale Marciana","journal":null,"series":null,"scope":{"volume":132,"pages":null}},"b12":{"title":"Marin Sanudo precursore del Melzi","authors":[{"person_name":{"surname":"Crescini","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"1885","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Giornale storico della letteratura italiana","series":null,"scope":{"volume":5,"pages":{"from_page":181,"to_page":185}}},"b13":{"title":"Sulla sorte di alcuni codici manoscritti appartenuti a Marin Sanudo","authors":[{"person_name":{"surname":"Wagner","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"1971","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"La Bibliofilia","series":null,"scope":{"volume":73,"pages":{"from_page":247,"to_page":262}}},"b14":{"title":"Altre notizie sulla sorte dei libri di Marin Sanudo","authors":[{"person_name":{"surname":"Wagner","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"1972","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"La Bibliofilia","series":null,"scope":{"volume":74,"pages":{"from_page":185,"to_page":190}}},"b15":{"title":"Nuove notizie a proposito dei libri di Marin Sanudo","authors":[{"person_name":{"surname":"Wagner","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"1991","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"La Bibliofilia","series":null,"scope":{"volume":83,"pages":{"from_page":129,"to_page":131}}},"b16":{"title":"La raccolta di testi teatrali di Marin Sanudo","authors":[{"person_name":{"surname":"Padoan","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"1970","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":13,"pages":{"from_page":68,"to_page":93}}},"b17":{"title":"Marin Sanudo il giovane: le opere e lo stile","authors":[{"person_name":{"surname":"Caracciolo Aricò","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Studi veneziani n.s","series":null,"scope":{"volume":55,"pages":{"from_page":351,"to_page":390}}},"b18":{"title":"Marin Sanudo Forerunner of Melzi","authors":[{"person_name":{"surname":"Harris","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"1993","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"La Bibliofilia","series":null,"scope":{"volume":95,"pages":{"from_page":15,"to_page":42}}},"b19":{"title":"Ancora sui libri di Marin Sanudo","authors":[{"person_name":{"surname":"Contò","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1994","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"La Bibliofilia","series":null,"scope":{"volume":96,"pages":{"from_page":195,"to_page":199}}},"b20":{"title":"Inattesi incontri di una visita alla biblioteca di Marin Sanudo il Giovane","authors":[{"person_name":{"surname":"Caracciolo Aricò","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"Biblion","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":79,"to_page":91}}},"b21":{"title":"Il terzo visitatore nella biblioteca di Marin Sanudo il giovane e nelle sue camere","authors":[{"person_name":{"surname":"Caracciolo Aricò","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Studi veneziani n.s","series":null,"scope":{"volume":62,"pages":{"from_page":375,"to_page":418}}},"b22":{"title":"I codici musicali Contariniani del secolo XVII nella R. Biblioteca di San Marco in Venezia","authors":[{"person_name":{"surname":"Wiel","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"1888","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b23":{"title":"Bibliotheca universa Hieronymi Contareni Marciae anno 1843 testamento legata","authors":[],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b24":{"title":"Codices MSS. latini. Bibliotheca manuscripta ad S. Marci venetiarum. ex Typographia commercii","authors":[{"person_name":{"surname":"Valentinelli","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"1868","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Venetiis","series":null,"scope":{"volume":null,"pages":{"from_page":163,"to_page":169}}},"b25":{"title":"La Libreria di San Marco: libri, lettori, società nella Venezia dei Dogi","authors":[{"person_name":{"surname":"Zorzi","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"1987","month":null,"day":null},"ids":null,"target":null,"publisher":"Mondadori","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":367,"to_page":368}}},"b26":{"title":"Domenicani Osservanti delle Zattere (1770)","authors":[],"date":null,"ids":null,"target":"http://marciana.venezia.sbn.it/immagini-possessori/209-zeno-apostolo39.Perlirr","publisher":null,"journal":"Biblioteca Nazionale Marciana, Marc. It. X","series":null,"scope":{"volume":55,"pages":{"from_page":6531,"to_page":6531}}},"b27":{"title":"Dallo scambio al commercio del libro. Case religiose e mercato librario a Venezia nel Settecento","authors":[{"person_name":{"surname":"Barzazi","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1997","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Atti dell'Istituto veneto di scienze, lettere ed arti, Cl. di scienze morali, lettere ed arti","series":null,"scope":{"volume":156,"pages":{"from_page":42,"to_page":44}}}},"sections":[{"title":"Introduction 1","paragraphs":[{"text":"In November 2014, the Biblioteca Nazionale Marciana launched a provenance database on the Library's website (called Archivio dei Possessori -hereafter AP: http:// marciana.venezia.sbn.it/la-biblioteca/cataloghi/archivio-possessori).","refs":[]},{"text":"The AP is a project collecting data and photographic records of data referring to the owners of the Library's printed books and manuscripts: bookplates, stamps, ownership and readers' notes, and binding marks. The project -together with others implemented by Italian and international libraries -aims at reconstructing the history of the Library's holdings and of every single item. It is part of a broader project supported by the Marciana focusing on the history of its holdings and collections, as well as on single exemplars, and is linked to the cataloguing of ancient printed books in SBN (Servizio Bibliotecario Nazionale), with particular attention being paid to single items, to the cataloguing of manuscripts in NBM (Nuova Biblioteca Manoscritta) and to involvement in the international MEI project (Material Evidence in Incunabula), which aims to reconstruct the history of book circulation in the 15th century through material evidence found in books.","refs":[]},{"text":"The software was designed from the outset to integrate data from several libraries. Indeed, the Biblioteca Universitaria di Padova has just begun to insert its own data in the AP, and the Fondazione Giorgio Cini in Venice has recently adhered to the project.","refs":[]},{"text":"Today, the AP includes around 850 records, provided with more than 2,500 free access images and is constantly expanding. It catalogues identified and unidentified owners, in order to facilitate recognition. Although data can be simply consulted by browsing, it is also possible to query the system starting with ownership marks, the owner's name and shelfmark. Every record indicates one (or more than one) shelfmark and each is linked to its online cataloguing description. Thus, AP consultation is complementary to catalogue consultation. The AP is supplied with a brief \"User's Guide\" [1], where common-use abbreviations are also indicated.","refs":[{"start":588,"end":591,"marker":"bibr","target":null}]}]},{"title":"Provenance Archive Structure","paragraphs":[{"text":"The Marciana bibliographical descriptions, available on the local OPAC -Polo VEA [2] -always record notes related to the items, with specific attention paid to owners and provenance. In the SBN cataloguing system the data related to the owners are exclusively available on the local OPAC, but in the current version of Sebina software in use on Polo VEA they do not appear in the UNIMARC record (UNIversal Machine Readable Cataloguing) [3], where owners and notes containing provenance information are tagged as 317 and Name (Author) is tagged as 702 or 712, depending on \"Type\" (personal or corporate body names).","refs":[{"start":436,"end":439,"marker":"bibr","target":"#b0"}]},{"text":"A new version of the software -Sebina (3.1) -will be launched shortly for the local OPAC, which supplies the UNIMARC mapping of the owners, in order to enable data search and retrieval. Moreover, this update will provide access to the AP from the OPAC system through a link, whereas for now only the reverse is possible.","refs":[]},{"text":"Therefore, the AP has been designed to support and complement the online library catalogue. After a period of testing (July-October 2014), it was inserted on the Library's official website in November 2014. At first, it contained 160 records, but by the beginning of 2015 the records had already reached 280 and nowadays they number 850.","refs":[]},{"text":"The need to create a simple, functional, low-cost database, which includes at the same time detailed descriptions, has led to the creation of a system divided into a small number of fields: owners (personal or corporate body names), type of ownership marks, library and related shelfmark, supported by a series of images.","refs":[]},{"text":"Querying the AP directly from the Library's website has enabled the development of an easily consultable system, in coordination with Bazzmann srl Venice. Like the Library's website, the AP system is based on Drupal version 7, which assigns a unique code to all data inserted by the librarians in order to facilitate data storage management. A unique code is serially assigned to every item managed by the system: Users/Librarians, Nodes (including images in the owners' records), and taxonomy (connecting \"terms\" among nodes, such as owners and corresponding shelfmark).","refs":[]},{"text":"Each item is given its own code, having a different denomination -UID (User Identifier) for librarians, NID (Node Identifier) for nodes and TID (Term Identifier) for taxonomies.","refs":[]},{"text":"In the same way that users normally consult an online catalogue -without necessarily knowing the main entry -in the AP system the access point to the owner's name (main entry) is linked to several added entries, including those available on the items and those derived from external sources, catalogues, and bibliographies. A textual note (Description) is linked to the univocally identified owners, enabling access to external links. What is especially significant for the reconstruction of the history of Marciana and its rare holdings are the \"Non identificati\" (Unidentified) owners (with single TID), when identity is unknown. The AP enables the aggregation and retrieval of items characterized by identical ownership marks, even if they have not been identified under an owner's name. The choice of dealing with Unidentified owners derives from problems arising in the case of a similar SBN entry such as the \"unidentified printers' device\", which has a single entry linked to several editions, which cannot be catalogued under printers as they are printers' devices, while in the AP they may be catalogued under type of ownership mark -Unidentified stamps, Unidentified binding marks etc. -and under image correspondence.","refs":[]},{"text":"Persons and corporate body names are in authorized form according to Italian Cataloguing Rules (REICAT) [4] and are linked to as many added entries as possible (Fig. 1). On the basis of this system an \"Owner Index\" has been designed, which automatically records all entries for the owners. During the creation of a new entry, the option of advanced research for existing entries is available, so as to enable recognition of previously recorded entries.","refs":[{"start":104,"end":107,"marker":"bibr","target":"#b2"},{"start":166,"end":167,"marker":"figure","target":"#fig_0"}]},{"text":"Considering a constant increase of entries -with 650 main entries, there are more than 450 added entries -if a record is unavailable, the system provides a negative answer. Likewise, when a new entry is being recorded the system checks all available entries so as to avoid creating duplicates.","refs":[]},{"text":"The \"Description\" field displays bio-bibliographic data relating to owners. Where owners are unrecorded an indication of the century is provided if possible. We have chosen to create a \"free-text field\", where librarians can provide links to external sources, in order to provide as much historical and biographical information as possible. Each record is given a sequence number automatically generated by the system, also readable by users, which if deleted or merged is no longer considered by the system.","refs":[]},{"text":"The field \"Ownership marks\" is linked to the main entry; this field also includes temporary custody (not only ownership). The field Ownership marks has been divided into six headings, or five plus one that cannot be included under any of the other headings. The headings are as follows:","refs":[]},{"text":"Other: None of the headings mentioned below, as data is derived from external sources to the book, such as handwritten or printed catalogues; Binding marks: These include coat of arms, initials, printed names, and representations linked to specific owners; Bookplates (ex libris): Small labels that bear woodcuts, engravings, and photomechanical prints serially produced and glued onto the volumes, usually on front pastedown, in order to indicate ownership. This heading includes all ex libris, as well as ex dono, whether armorial or artistic; Reading notes: Marginalia, annotations, corrections, and drawings; Ownership notes: Initials, cryptograms, signatures, handwritten annotations (i.e. \"Ex libris d.ni…\"), hand-drawn, illuminated coats of arms; Stamps: All kinds of stamps, with no distinction between armorial, and artistic or official stamps, unlike for the ex libris.","refs":[]},{"text":"The only forms of attestation of ownership that can be repeated several times in the same form and whose measurements are recorded, are A-B, D-E (see Fig. 1). Therefore, this system allows librarians to combine together a specific owner (TID01) with six different types of ownership marks, in turn represented in different forms, which is to say that an owner (TID01) can have several bookplates, and thus separate records will be associated to them.","refs":[{"start":155,"end":156,"marker":"figure","target":"#fig_0"}]},{"text":"The management of Unidentified owners is especially important in order to study the history of the Library's holdings, as these owners are treated individually according to the ownership marks found in the copies. Thus there are: Unidentified (TID6375) stamps; Unidentified (TID6375) ownership marks; Unidentified (TID6375) reading notes etc., each of them available with one or more images and its own serial number, to allow the maintenance of record data linked to the entry of an already identified owner, in case of recognition (Fig. 2). Thus, when creating a record the owner is linked to only one mark of ownership at a time, an extended note referring to such ownership mark, the Library and corresponding shelfmark, and at least one image related to the mark.","refs":[{"start":539,"end":540,"marker":"figure","target":"#fig_1"}]},{"text":"The \"Extended note\", which also includes a \"Summary\" that is only accessible to librarians -especially useful to condense a series of shelfmarks where there are long notes and multiple references, for example -displays the library code, the shelfmark (not in the standardized form of the online catalogue as this is recorded in the specific field, but in the form of historical catalogues or in the one by which it is known through the bibliography), the exact location of the ownership mark (binding, book spine, leaves etc.) and its complete transcription (Fig. 3). The data may be supplemented by extensive notes with links to external sources. The same field also records external contributions such as Institutions that have consented to the publication of images related to identical ownership mark evidence in their copies, or else scholars that have been responsible for identifying material evidence. The descriptive record of an owner immediately shows the type of ownership mark linked (Fig. 4). The \"owner\" entry always displays its own TID; this entry can be modified and such a procedure is implied in all the records associated to the same entry.","refs":[{"start":564,"end":565,"marker":"figure","target":"#fig_2"},{"start":1003,"end":1004,"marker":"figure","target":"#fig_3"}]},{"text":"The \"Library and Shelfmark\" field lists all the libraries taking part in the AP project, therefore each shelfmark is uniquely linked to the library that describes it, as the system filters the selection of existing shelfmarks based on the relevant library. Therefore, records of identical shelfmarks for several libraries -i.e. INC. for incunabula -may exist without creating mistakes. The shelfmark is linked to the URL of the bibliographic description in the local OPAC, as the data of the copies are recorded only in the local OPAC and not in the national OPAC SBN. In cases where the items have been reproduced in digital format, in the local OPAC description corresponding to the data of the digitized exemplar there is a link to the \"Internet Culturale\" portal. Thus, from the AP the user can pass to the local OPAC and from there to the \"Internet Culturale\" portal to view the whole copy.","refs":[]},{"text":"As regards Shelfmarks, like the Owners' entries, a consultation Index has been created, from where librarians can select the already existing entries. The system checks the existence of other shelfmarks that may be duplicated in each library when a new shelfmark record is created.","refs":[]},{"text":"At least one image is linked to each owner, which is the image that is immediately visible to the user carrying out a search. Subsequently, a whole series of other images can be added. The Title of every image is recorded according to the same characteristics as for the Extended note: library code, shelfmark and exact location of ownership mark (Fig. 5). ","refs":[{"start":353,"end":354,"marker":"figure","target":"#fig_4"}]}]},{"title":"Initial Results","paragraphs":[{"text":"The types of ownership marks referring to a single owner can vary, but they all provide different clues to the history of the holdings. A case in point is Cardinal Bessarion's (1403-1472) founding collection housed in the Marciana; his ownership marks on the incunabula (the Cardinal's less famous collection of volumes), are all now collected in AP [6]. Only in one case has ownership been attested, thanks to marginal notes on an incunabulum made by Bessarion himself, although this inscription is considered to be of dubious origin [7]. In other cases, his ownership is testified by handwritten notes in two languages, Greek and Latin -the so-called loci -which also record the shelfmark in his own library [8]. Although the inventories of Bessarion's library have been published and its transfer to Venice has been thoroughly researched, the transcription of Greek-Latin loci on the manuscripts has not yet been completed, nor has a systematic study of the physical structure of the library when it was still in Rome been carried out. A significant number of Bessarion's incunabula are richly illuminated, also with the Cardinal's coat of arms [9] and in two cases with his portrait. Again, there is currently insufficient precise information to indicate the number and nature of the manuscripts bearing his own coat of arms, nor how the various illuminators' commissions, which could be studied through the comparison of images, provide clues to the constant expansion of his collection (Fig. 6). From the outset identification has been achieved thanks to the possibility of viewing images, and in several cases it has even been possible to link books whose provenance is still uncertain, but which have identical ownership marks.","refs":[{"start":350,"end":353,"marker":"bibr","target":"#b3"},{"start":535,"end":538,"marker":"bibr","target":"#b4"},{"start":710,"end":713,"marker":"bibr","target":null},{"start":1498,"end":1499,"marker":"figure","target":"#fig_5"}]},{"text":"For example, among the unidentified stamps, an unknown oval stamp [10] seems to have a specific meaning -not necessarily indicating provenance -when it appears on opera librettos in the Marciana, but it can also be found in several copies housed in the Biblioteca Nazionale Braidense, the Fondazione Giorgio Cini in Venice and in the Biblioteca Nazionale Centrale in Rome. If we take the example of the libretto of Le nozze disturbate, printed in Venice by Modesto Fenzo in 1766 [11] 2 , it is seen that the copies in the Fondazione Giorgio Cini, in the Biblioteca Nazionale Centrale in Rome and in the Biblioteca Nazionale Braidense in Milan all bear the same stamp on page 71. Since the stamp also appears on several items of the same edition, it is likely that its use may be attributed to selling practices or to events surrounding publication, rather than to a specific provenance.","refs":[{"start":479,"end":483,"marker":"bibr","target":"#b5"},{"start":484,"end":485,"marker":null,"target":"#foot_3"}]},{"text":"What are just as interesting, above all for historical-textual implications, are the dense collation and reading annotations, mostly in Greek, written by an anonymous reader [12] in the margins of two printed editions by Apollonius of Rhodes (Biblioteca Nazionale Marciana, Aldine 510) [13] and Theocritus (Biblioteca Nazionale Marciana, 67 D 187) [14]. The author of the handwritten annotations has not yet been identified, but most likely it must have been a Greek or Italian humanist, who could write in Greek and was interested in the Classics. Highlighting this hand will enable scholars to identify it elsewhere in the future (Fig. 7). Numerous annotators -previously considered anonymous -have already been identified [15]. The project catalogues both manuscripts and printed books, and the AP is a means of enhancing the collections of autographs owned by the Library and spread across its collections. That is why the AP can be also used as a collection of autographs of scholars, above all Italian. A case in point is an autograph letter (Marc. It. XI, 207 [=4071]) from Aldus Manutius (1450-1515) held in the Marciana, but also a printed book with glosses in which Manutius made annotations in the margin in Greek and Latin [16,17]. To him we can also attribute a single note of correction in Aldine 132, f. a8v [18] (Fig. 8). The AP has already discovered private collections of books which have long been considered lost. For example, not only does the Marciana house several autograph manuscripts by Marin Sanudo the Younger (1466-1536), as well as other manuscripts belonging to him, but it also holds at least one printed book belonging to him; all these documents were donated by Girolamo Contarini [19,20]. Up to that time printed books which had belonged to Marin Sanudo had only been traced to other libraries, especially the Biblioteca Colombina in Seville and other European collections [21][22][23][24][25][26][27][28][29][30], but strangely enough not in the Marciana, where the holding of origin, acquired in 1843 [31,32] has yet to be explored thoroughly. The finding of this first printed book suggests that there may be others. If the wording \"Est Marini Sanudi Lionardi Filij\" were not enough, Sanudo's identity is supported by the comparison with one of the numerous autograph manuscripts housed in the Marciana (It. VI, 277 [=5806]) (Fig. 9). The project has also resulted in a revision of acquired data of even those holdings whose history and events had been considered well-researched. Such is the case of Apostolo Zeno's library (1668-1750). He donated his own private collection to the library of the Observant Dominicans of the Zattere (Gesuati), writing a will in 1747 and implementing it in 1750 before his death, when more than 200 crates full of books were taken to the conventual library. Subsequently, due to the suppression of religious institutes, the whole Dominican library was stripped and the books were dispersed, largely ending up in the Marciana, Zeno's books included [33]. These are marked with a woodcut bookplate, with many variants [34]. Most of Zeno's books were marked with two handwritten cryptographic annotations, one \"&\" [35] and a \"rhombus\" [36]; there is also another one that is less documented [37]. Finally, Zeno's Miscellaneous books were famous for a handwritten index on the book spines and the shelfmark in Zeno's library, together with a further index added on the upper flyleaves [38]. Although incomplete, the catalogue of this vast private collection is housed in the Marciana, Marc. It. XI, 289-293 (= 7273-7278).","refs":[{"start":174,"end":178,"marker":"bibr","target":null},{"start":286,"end":290,"marker":"bibr","target":"#b6"},{"start":348,"end":352,"marker":"bibr","target":"#b7"},{"start":638,"end":639,"marker":"figure","target":"#fig_6"},{"start":725,"end":729,"marker":"bibr","target":"#b8"},{"start":1235,"end":1239,"marker":"bibr","target":"#b9"},{"start":1239,"end":1242,"marker":"bibr","target":"#b10"},{"start":1323,"end":1327,"marker":"bibr","target":"#b11"},{"start":1334,"end":1335,"marker":"figure","target":"#fig_7"},{"start":1716,"end":1720,"marker":"bibr","target":null},{"start":1720,"end":1723,"marker":"bibr","target":null},{"start":1909,"end":1913,"marker":"bibr","target":"#b12"},{"start":1913,"end":1917,"marker":"bibr","target":"#b13"},{"start":1917,"end":1921,"marker":"bibr","target":"#b14"},{"start":1921,"end":1925,"marker":"bibr","target":"#b15"},{"start":1925,"end":1929,"marker":"bibr","target":"#b16"},{"start":1929,"end":1933,"marker":"bibr","target":"#b17"},{"start":1933,"end":1937,"marker":"bibr","target":"#b18"},{"start":1937,"end":1941,"marker":"bibr","target":"#b19"},{"start":1941,"end":1945,"marker":"bibr","target":"#b20"},{"start":1945,"end":1949,"marker":"bibr","target":"#b21"},{"start":2039,"end":2043,"marker":"bibr","target":"#b22"},{"start":2043,"end":2046,"marker":"bibr","target":"#b23"},{"start":2370,"end":2371,"marker":"figure","target":"#fig_8"},{"start":3021,"end":3025,"marker":"bibr","target":"#b25"},{"start":3089,"end":3093,"marker":"bibr","target":null},{"start":3261,"end":3265,"marker":"bibr","target":null},{"start":3454,"end":3458,"marker":"bibr","target":"#b26"}]},{"text":"The presence of cryptographic notes and of the bookplates had long been considered as a sign of provenance of Zeno's library. The fact that both have also been found in books printed after his death has led scholars to reinterpret the sources concerning the history of his library. Apostolo Zeno's bequest to the Collegio del Santissimo Rosario would have been implemented only if the library had been kept separate from the one already existing in the convent, if the friars had compiled a new catalogue and had not sold the duplicates. Thus, Andrea Corner, Zeno's step-brother, sued the Dominicans because he wanted the library back; his sons carried on the legal case until 1770. The legal proceedings are still partially available in printed format [39]. To defend themselves from Corner's accusations of selling the duplicates and not keeping the library separate, the friars wrote a large number of memoirs, thoroughly documenting the whole question (Marc. It. X, 55 [=6531]). Thus, in the manuscript housed in the Marciana, on f. 23v it is written: \"Allora fu che, per evitare ogni qualunque minima confusione tra questi nuovi libri, e quelli del Sig.r Apostolo, si pensò di marcare i libri zeniani, uno per uno niun accettuato con un viglietto contenente il nome e cognome del gran benefattore Apostoli Zeni\" (It was then, to avoid even the least confusion among these new books, and those owned by Mr Apostolo, we thought of marking the volumes by Zeno, one by one, with a piece of paper containing the name and surname of the great benefactor Apostoli Zeni); the bookplate was therefore inserted by the Dominicans of the Collegio del Santissimo Rosario, after they received Zeno's library, in order to clearly distinguish his books from the other collections. It is likely that some books not belonging to Zeno were marked by mistake, or others that were acquired with the money raised from the duplicates sold, as happened in other conventual libraries. We can also attribute to the Dominicans the manuscript cryptograms that distinguish Zeno's copies: the \"&\" is in fact attested in the same Marc. It. X, 55 (=6531) [40].","refs":[{"start":753,"end":757,"marker":"bibr","target":null},{"start":2128,"end":2132,"marker":"bibr","target":"#b27"}]},{"text":"The above-mentioned handwritten catalogue of Zeno's collection remains the most reliable, albeit incomplete source, and should be consulted more often in order to determine provenance.","refs":[]},{"text":"The Biblioteca Nazionale Marciana welcomes records by researchers who wish to contribute to the AP. Indeed, in 2015 it published two records concerning handwritten annotations made by Francesco Petrarca and Giovanni Boccaccio that were identified by Marco Cursi in the manuscript Marc. Gr. IX, 29 (=1007).","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"In November 2014, the Biblioteca Nazionale Marciana launched a provenance database on the Library's website.","refs":[]},{"text":"The Archivio dei possessori is a project collecting data and photographic records of data referring to the owners of the Library's printed books and manuscripts: bookplates, stamps, ownership and readers' notes, and binding marks. The project -together with other similar projects implemented by Italian and international libraries -aims at reconstructing the origin of the library's rare collections and retracing the history of previous ownership of every single item.","refs":[]}]}}