{"bibliography":{"title":"Eliciting the Ancient Geography from a Digital Library of Latin Texts","authors":[{"person_name":{"surname":"Lana","first_name":"Maurizio"},"affiliations":[{"department":"Dipartimento di Studi Umanistici","institution":"Università del Piemonte Orientale","laboratory":null}],"email":"maurizio.lana@uniupo.it"},{"person_name":{"surname":"Tambassi","first_name":"Timothy"},"affiliations":[{"department":"ICUB","institution":"University of Bucharest","laboratory":null}],"email":"timothy.tambassi@gmail.com"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-73165-0_19","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Owl","Ontology","Classical latin texts","Web","Geography"],"citations":{"b0":{"title":"Geografia storica del mondo antico","authors":[{"person_name":{"surname":"Bianchetti","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"Monduzzi","journal":null,"series":null,"scope":null},"b1":{"title":"Ontological tools for geographic representation","authors":[{"person_name":{"surname":"Casati","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Varzi","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1998","month":null,"day":null},"ids":null,"target":null,"publisher":"IOS Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":77,"to_page":85}}},"b2":{"title":"Parts and Places","authors":[{"person_name":{"surname":"Casati","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Varzi","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1999","month":null,"day":null},"ids":null,"target":null,"publisher":"MIT Press","journal":null,"series":null,"scope":null},"b3":{"title":"Digital geography and classics","authors":[{"person_name":{"surname":"Elliott","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Gillies","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":"http://www.digitalhumanities.org/dhq/vol/3/1/000031/000031.html","publisher":null,"journal":"DHQ: Digital Humanities Quarterly, Changing the Center of Gravity: Transforming Classical Studies Through Cyberinfrastructure","series":null,"scope":{"volume":3,"pages":null}},"b4":{"title":"Spatial ontology","authors":[{"person_name":{"surname":"Frank","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1997","month":null,"day":null},"ids":null,"target":null,"publisher":"Kluwer Academic","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":135,"to_page":153}}},"b5":{"title":"Feature of Common Sense Geography. Implicit Knowledge Structures in Ancient Geographical Text","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"Lit Verlag","journal":null,"series":null,"scope":null},"b6":{"title":"Formal ontology and information systems","authors":[{"person_name":{"surname":"Guarino","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"1998","month":"06","day":"08"},"ids":null,"target":null,"publisher":"IOS Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":3,"to_page":15}}},"b7":{"title":"Comparing categories among geographic ontologies","authors":[{"person_name":{"surname":"Kavouras","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Kokla","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Tomai","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Comput. Geosci","series":null,"scope":{"volume":31,"pages":{"from_page":145,"to_page":154}}},"b8":{"title":"Ontologies in support of activities in geographical space","authors":[{"person_name":{"surname":"Kuhn","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Int. J. Geogr. Inf. Sci","series":null,"scope":{"volume":15,"pages":{"from_page":613,"to_page":631}}},"b9":{"title":"Ontologies and the cultural heritage. The case of GO!","authors":[{"person_name":{"surname":"Lana","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Borgna","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Ciotti","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Tambassi","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2016","month":"05","day":"30"},"ids":null,"target":null,"publisher":null,"journal":null,"series":"CEUR Workshop Proceedings","scope":{"volume":1595,"pages":{"from_page":7,"to_page":18}}},"b10":{"title":"Alien Wisdom. The Limits of Hellenization","authors":[{"person_name":{"surname":"Momigliano","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"1975","month":null,"day":null},"ids":null,"target":null,"publisher":"Cambridge University Press","journal":null,"series":null,"scope":null},"b11":{"title":"Why are there no comprehensively digital scholarly editions of classical texts?","authors":[{"person_name":{"surname":"Monella","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2012","month":"09","day":"15"},"ids":null,"target":"http://www1.unipa.it/paolo.monella/lincei/files/why/why_paper.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Digital Scholarly Editing. Theories, Models and Methods","authors":[{"person_name":{"surname":"Pierazzo","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"Ashgate","journal":null,"series":null,"scope":null},"b13":{"title":"Ontology","authors":[{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":"Blackwell","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":155,"to_page":166}}},"b14":{"title":"Ontology and geographic kinds","authors":[{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Mark","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"1998","month":null,"day":null},"ids":null,"target":null,"publisher":"International Geographical Union","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":308,"to_page":320}}},"b15":{"title":"Geographical categories: an ontological investigation","authors":[{"person_name":{"surname":"Smith","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Mark","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Int. J. Geogr. Inf. Sci","series":null,"scope":{"volume":15,"pages":{"from_page":591,"to_page":612}}},"b16":{"title":"Rethinking geo-ontologies from a philosophical point of view","authors":[{"person_name":{"surname":"Tambassi","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.4458/7800-04","arXiv":null},"target":"https://doi.org/10.4458/7800-04","publisher":null,"journal":"J. Res. Didactics Geogr. (J-Reading)","series":null,"scope":{"volume":2,"pages":{"from_page":51,"to_page":62}}},"b17":{"title":"Ontologie informatiche della geografia. Una sistematizzazione del dibattito contemporaneo","authors":[{"person_name":{"surname":"Tambassi","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Magro","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Rivista di estetica","series":null,"scope":{"volume":58,"pages":{"from_page":191,"to_page":205}}},"b18":{"title":"Introduction to NeoGeography","authors":[{"person_name":{"surname":"Turner","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":"O'Reilly Media Inc","journal":null,"series":null,"scope":null}},"sections":[{"title":"Steps for the Creation of GO!","paragraphs":[{"text":"Given the plurality of domain interests, the creation of GO! [10] imposed a division of work in different steps: a search and analysis of the existing ontologies which can or could be of interest for the geography in order to start to understand to which extent they could be reused for the scope of describing the geographical knowledge contained in the Latin classical texts; this was done through a critical review of contemporary geo-ontologies 3 , aimed to identify common classes 4 and properties 5 , and also missing classes and properties needed to describe ancient geography -the scope was to to establish if an ontology had to be built ex novo or if more simply classes and properties can be selected and imported from other existing ontologies, emphasizing in this way the specific contribution of Geolat ontology to the contemporary debate.","refs":[{"start":61,"end":65,"marker":"bibr","target":"#b9"},{"start":486,"end":487,"marker":null,"target":"#foot_1"},{"start":503,"end":504,"marker":null,"target":"#foot_2"}]},{"text":"After that the analysis of Latin literature texts started, in order to identify geographical entities, classes, properties and relations; practically speaking it meant that around 15.000 pages of translated Latin texts were read (no problem with the the translation because not concepts but things were searched for), and everything related to geography in broad sense was highlighted: proper nouns (e.g. Rome); common nouns (mons, mare); names of populations; space/place indications: above, below, beyond, etcetera; all the verbs having any geography related nuance: build, move, settle, etcetera; properties and relations related to these entities or describing them.","refs":[]},{"text":"Then all the relevant passages where re-read in Latin in order to check for possible translation problems and the highlighted entities were listed by type and author subsequently agreements and disagreements among the Latin authors were analysed and highlighted, focusing on their basic distinctions; the study of the differences between ancient and contemporary geography, in terms of domains, presuppositions, representations and vagueness; the scope was that of understanding was could be expressed An ulterior check against the Latin texts of the first phase was made to be sure that the conceptualization which was arising was effectively usable to describe the knowledge contained in those texts; and an additional similar check was made with other authors (minor historians -Eutropius, Velleius Paterculus, etc.; plus, some works from Cicero, Seneca, Vergil, Plautus, Catullus, Terentius) to be sure that relevant concepts didn't appear which were forgotten.","refs":[]}]},{"title":"GO!: A Geo-Ontology for Latin Literature","paragraphs":[{"text":"The result of this work 6 is GO!, a geo-ontology which provides a description of the geographical knowledge emerging from Latin literature and an inventory of classes and relation mainly focused towards semantically annotating Latin texts, identifying the places mentioned in these texts, and connecting them with their contemporary equivalents. The fundamental scopes of this ontology are essentially four: informativeness, completeness, reusability and accessibility (both for the scientific community and for general public). The main challenge of the project has been to put together all the different disciplinary areas -which include, at least, Computer Science, Contemporary Geography, Ancient (History and) Geography, Latin Literature, Ontology of Geography -that constitute the domain of this geo-ontology. Accordingly, the idea behind this ontology was that the study of common sense (geographical) conceptualizations -that is the body of knowledge that (ancient) people have about the surrounding geographic world -could constitute a fundamental infrastructure for the ontological representation and for the communication among different areas of research. forks of the ontology; requests to the managing team are instead welcome. Graphical representations of the modules can be found at this address: http://vowl.visualdataweb. org/webvowl/index.html#iri=https://w3id.org/geolit/ontologies/GO-TOP (replace GO-TOP with GO-PHY, GO-HUM, GO-FAR for the graphical view of the other ontologies). 4 The Modules and the Modelling Choices GO-TOP contains 21 classes, 38 object properties, 15 datatype properties, 4 individuals. It is the top level ontology which connects all the other modules and contains the most general elements that describe all the geographic entities included in GO!. In particular, all the most general classes and (object and data) properties belong to the GO-TOP and are used by the other three modules.","refs":[{"start":24,"end":25,"marker":null,"target":"#foot_3"},{"start":1502,"end":1503,"marker":"bibr","target":"#b3"}]},{"text":"GO-PHY contains 127 classes, 3 individuals. It imports the GO-TOP module, and includes a taxonomy which represents geographical entities with physical-natural aspects. All the classes of GO-PHY are sub-classed of astronomical entity, physical entity, geographic entities, natural entities, event and terrestrial entity classes of GO-TOP.","refs":[]},{"text":"GO-HUM contains 204 classes, 8 object properties. It imports the GO-TOP module, and is organized in a taxonomy which constitutes an inventory of geographical entities created by humans. The high level classes imported from GO-TOP are astronomical entity, anthropic entity, geographic entity, event, go entity, length, nonphysical entity, physical entity and terrestrial entity, from which GO-HUM defines its specific subclasses. The main specific object properties are: fought between, composed by, has stop over, has length, has path, has cultural heritage of and won.","refs":[]},{"text":"GO-FAR contains 87 classes, 2 object properties. It imports the GO-TOP module, and describes all (and only) the geographic features (including places, people and events) produced by human during ancient times, with particular reference to ancient Rome as the main scope of this ontology is the annotation of Latin texts. Moreover, it includes, among others, some specific entities and classes which describe the Ancient World imported from ancient entity, socio-institutional entity, group of people, populated place, and artifact classes of GO-HUM, geographic entity from GO-TOP. Finally, it has has real place among the Object Properties.","refs":[]},{"text":"An example of the connection of these modules might be represented by the class of GO! Entities, which includes, among others, Natural Entities, Anthropic Entities, Astronomical Entities, Physical Entities, Terrestrial Entities and Unreal Entities, as can be seen in Fig. 1.","refs":[{"start":272,"end":273,"marker":"figure","target":null}]},{"text":"Each of these subclasses of GO! Entities contains further subclasses and is characterized by specific properties and relations (name, location, length, size, spatial relation and so forth). In this sense, the GO! modelling choices allow to express a range of information about geographical places (i.e. their evolution through time as attested by the texts which mention them, GPS coordinates, physical and geopolitical descriptions, switch of name, and so forth); they also allow to describe historical events connected with specific places. Connections with places data available in Pleiades are used; moreover GO! can manage imaginary places; the Open Annotation ontology is adopted to cite the passages.","refs":[]}]},{"title":"Envisioned Uses","paragraphs":[{"text":"In the digital humanities field a geographical turn happened, whose meaning is that the geography is seen no more simply as a specific discipline rather its meaning is that of the environment where most of the activities and knowledge lie. A glue, a substrate connecting most of what exists and happens in the human world [4]. The Geolat project is a product of this idea.","refs":[{"start":322,"end":325,"marker":"bibr","target":"#b3"}]},{"text":"In fact, in Geolat the annotation of texts based on the ontology is conceived for at least two different scopes:","refs":[]},{"text":"• browsing and searching texts on the basis of the internal geographical content and knowledge, made visible and usable thanks to the ontology; • production of digital (online) and printed critical editions of new type: geographical critical editions.","refs":[]}]},{"title":"GO! Entities Natural Entities","paragraphs":[{"text":"Anthropic Entities","refs":[]}]},{"title":"Astrono mical Entities Physical Entities","paragraphs":[{"text":"Terrestrial Entities","refs":[]}]},{"title":"Unreal Entities","paragraphs":[{"text":"Fig. 1. GO! entities","refs":[{"start":5,"end":6,"marker":"figure","target":null}]},{"text":"The first scope can be exemplified saying that the reader draws an area on a map and the system shows on the map the places mentioned in the texts of the digital library underlying the map. That is the interconnection between the library of digitally annotated texts and the map allows for a truly exploratory (the reader has not to know anything very precise about the area s/he are investigating), yet controlled (the reader can fine tune the texts collection which is analysed: period, authors, genres, …) approach to a given collection of texts. But the same cartographical query can produce lists of authors, works, passages, mentioning places belonging to the area traced by the reader on the map. Or inversely the reader starts from one or more works and can display on the map the places mentioned in those works. The apparently simple scope of searching can become very powerful if one considers that in the annotation of places events and involved people with their roles can be described. This way one can search e.g. for the geographical places where proconsules are mentioned. This is not possible with more simple NER approaches where the place name is a string and not -as it happens instead when using an underlying rich ontology -a complex entity of meaning full of connections and implications.","refs":[]},{"text":"In the second scope the concept of \"digital edition of a text\" is developed/expanded. The \"edition of a text\" has today -at least for classical works, but many things are similar for the editions of medieval or modern texts -two main forms: with or without the description of the variants and their evaluation by the curator of the edition in the apparatus criticus. In the first case the edition is usually qualified as a scholarly edition, in the second one it is usually called a variorum edition. In both cases the editor of the texts offers what he judges being the best reconstruction of the true text issued by the hand of the author. And this type of work on the text was consolidated through thousands of years (the first critical editions of texts were produced more than 2000 years ago). The scope of a scholarly edition (be it of the first or of the second type just described) is that of offering those who want to study a given work a rich informational environment. Until these years the main type of information offered is that of an accurate description of the state of the manuscript tradition. Nowadays, tools are available allowing to expand the type of critically assessed information which is offered to the researchers who study a given text, what is both the cause and the effect of new study perspectives. For example, we are more aware of the fact that the geography conveys political and ideological meanings: giving names to specific points on the surface of Earth means affirming a property on them; the same is for defining boundaries; and mentioning specific place names in groups is a way of declaring interpretations of facts, or of affirming political or religious positions. This type of research interest needs the support of an edition of the text giving space to this study approach: a geographer will probably appreciate a scholarly edition enriched by a geographical apparatus that is an edition with a good comment of the text plus a full spectrum of documentation about the geographical knowledge contained in the text that is link the source describing in all the possible ways the places which are mentioned (Fig. 2): while a classical scholar will probably appreciate a scholarly variorum edition enriched by a geographical apparatus, that is an edition where it is possible to cross-reference the variants of the manuscript tradition with the geographical knowledge. But other types of information could be equally interesting: historical information about the events mentioned in the text, or prosopographical information about the persons involved in the events, or both types merged. No single printed edition, nor single scholar could bear the weight of this complexity:","refs":[{"start":2158,"end":2159,"marker":"figure","target":"#fig_0"}]},{"text":"(variorum: yes/no) AND/OR (geographical: yes/no) AND/OR (historical: yes/no) AND/OR (prosopographical: yes/no) which can probably only be managed if the edition is conceived as a collaborative work of different scholars and gives origin to an edition whose content typology is dynamically generated on the basis of the researcher's interest (strictly philological AND/OR geographical, etc.). In other words we suggest here that the complexity of the digital edition be conceived not at the very philological level only (as variorum edition, with complex discussions about what it must contain and how the content must be presented also in rapport with the printed version of this type of edition) but also as a research tool which creates a research environment which configures itself according to the scope and the interests of the researcher/reader (Fig. 3).","refs":[{"start":858,"end":859,"marker":"figure","target":null}]},{"text":"All the above is possible because the specific value of a digital edition is not only in the digital form of representation of textual information: dynamic rather than static, resulting in better visual or practical usability; but it mainly lays in the ability to work with computational methods on the text and on the information it conveys [12,13].","refs":[{"start":342,"end":346,"marker":"bibr","target":"#b11"},{"start":346,"end":349,"marker":"bibr","target":"#b12"}]},{"text":"In conclusion, the digital edition of a text should aim to provide adequate data and functionality to further forms of processing. Hence the idea that the \"digital scholarly edition\" until now often identified with the \"digital critical edition\" also known as \"digital variorum edition\", can also take other forms focused on other types of 'scholarly research': from the geographical knowledge contained in the text, to the So, if the digital critical edition (digital variorum edition) is a type of digital scholarly edition containing an apparatus that analyses and describes the state of the text in the witnesses, then we can conceive e.g.","refs":[]},{"text":"• the digital scholarly geographical edition of a workwhose apparatus contains an analytical description of the geographical knowledge contained in the place names; • the digital critical geographical edition (digital variorum geographical edition) whose geographical apparatus is layered over a base critical edition:","refs":[]},{"text":"To do so the knowledge contained in the text must be expressed in a highly formal manner -the same way that the critical apparatus is a highly formal deviceand an ontology is a good and very complex means to do that. Here below an abstract sample of a passage of text where the place name Lydia is annotated with reference to the GO! ontology (Fig. 4):","refs":[{"start":349,"end":350,"marker":"figure","target":null}]},{"text":"More references to our studies in this field can be found also in forthcoming publications, namely the proceedings of the conferences DHANT (MSH-Alpes, Grenoble 2015) and Dixit (Köln 2016). ","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Geolat -Geography for Latin Literature is a research project, aimed at making accessible a digital library containing the works of Latin literature (from its origins in 240 BCE to the end of the Roman Empire in 476 CE) through a query interface of geographic/cartographic type representing the geographic knowledge expressed in the Latin texts themselves. A core activity of the project has been the development of the ontology GO!, which describes the geographical knowledge contained in the texts of the library. The ontologically annotated texts will allow for a variety of scientifically relevant uses, apart from the geo-based browsing: for example the production of digital and printed critical editions.","refs":[]}]}}