{"bibliography":{"title":"On Synergies Between Information Retrieval and Digital Libraries","authors":[{"person_name":{"surname":"Agosti","first_name":"Maristella"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"maristella.agosti@unipd.it"},{"person_name":{"surname":"Fabris","first_name":"Erika"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"erika.fabris@unipd.it"},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"gianmaria.silvello@unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-11226-4_1","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Trends in digital libraries (dl)","Emerging interrelationships between","Trends in information retrieval (ir)"],"citations":{"b0":{"title":"","authors":[{"person_name":{"surname":"Grobid","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":"https://github.com/kermitt2/grobid","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Design of an OPAC database to permit different subject searching accesses in a multi-disciplines universities library catalogue database","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Masotti","first_name":"M"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Proceedings of the 15th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval","authors":[],"date":{"year":"1992","month":"06","day":"24"},"ids":{"DOI":"10.1145/133160.133207","arXiv":null},"target":"https://doi.org/10.1145/133160.133207","publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":245,"to_page":255}}},"b3":{"title":"Future trends in digital libraries and scientific communications","authors":[{"person_name":{"surname":"Appleton","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.1016/j.procs.2014.10.004","arXiv":null},"target":"https://doi.org/10.1016/j.procs.2014.10.004","publisher":null,"journal":"Procedia Comput. Sci","series":null,"scope":{"volume":38,"pages":{"from_page":18,"to_page":21}}},"b4":{"title":"DLib: Recommendations-as-a-Service (RaaS) for Academia","authors":[{"person_name":{"surname":"Beel","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Aizawa","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Breitinger","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Gipp","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Mr","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":313,"to_page":314}}},"b5":{"title":"SIGIR's 30th anniversary: an analysis of trends in IR research and the topology of its community","authors":[{"person_name":{"surname":"Hiemstra","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Hauff","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"De Jong","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Kraaij","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":{"DOI":"10.1145/1328964.1328966","arXiv":null},"target":"https://doi.org/10.1145/1328964.1328966","publisher":null,"journal":"SIGIR Forum","series":null,"scope":{"volume":41,"pages":{"from_page":18,"to_page":24}}},"b6":{"title":"The Online Catalogue: Developments and Directions","authors":[{"person_name":{"surname":"Hildreth","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"1989","month":null,"day":null},"ids":null,"target":null,"publisher":"Library Association","journal":null,"series":null,"scope":null},"b7":{"title":"GROBID: combining automatic bibliographic data recognition and term extraction for scholarship publications","authors":[{"person_name":{"surname":"Lopez","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-642-04346-8_62","arXiv":null},"target":"https://doi.org/10.1007/978-3-642-04346-8","publisher":"Springer","journal":null,"series":null,"scope":{"volume":5714,"pages":{"from_page":473,"to_page":474}}},"b8":{"title":"From puppy to maturity: experiences in developing Terrier","authors":[{"person_name":{"surname":"Macdonald","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Mccreadie","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Santos","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Ounis","first_name":"I"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":60,"to_page":63}}},"b9":{"title":"Information retrieval challenges for digital libraries","authors":[{"person_name":{"surname":"Rasmussen","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-540-30544-6_10","arXiv":null},"target":"https://doi.org/10.1007/978-3-540-30544-610","publisher":"Springer","journal":null,"series":null,"scope":{"volume":3334,"pages":{"from_page":95,"to_page":103}}},"b10":{"title":"Analysis of papers from twenty-five years of SIGIR conferences: what have we been doing for the last quarter of a century","authors":[{"person_name":{"surname":"Smeaton","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Keogh","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Gurrin","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Mcdonald","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sødring","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":{"DOI":"10.1145/945546.945550","arXiv":null},"target":"https://doi.org/10.1145/945546.945550","publisher":null,"journal":"SIGIR Forum","series":null,"scope":{"volume":36,"pages":{"from_page":39,"to_page":43}}},"b11":{"title":"Improving subject access painlessly: recent work on the Okapi online catalogue projects","authors":[{"person_name":{"surname":"Walker","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"1988","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Program","series":null,"scope":{"volume":22,"pages":{"from_page":21,"to_page":31}}},"b12":{"title":"Data citation: giving credit where credit is due","authors":[{"person_name":{"surname":"Wu","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Alawini","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Davidson","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":{"DOI":"10.1145/3183713.3196910","arXiv":null},"target":"https://doi.org/10.1145/3183713.3196910","publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":99,"to_page":114}}},"b13":{"title":"Library personalized recommendation service method based on improved association rules","authors":[{"person_name":{"surname":"Yi","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Chen","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Cong","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Libr. Hi Tech","series":null,"scope":{"volume":36,"pages":{"from_page":443,"to_page":457}}},"b14":{"title":"Joint modeling and optimization of search and recommendation","authors":[{"person_name":{"surname":"Zamani","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Croft","first_name":"W"},"affiliations":[],"email":null}],"date":{"year":"2018","month":"08","day":"31"},"ids":null,"target":"http://ceur-ws.org/Vol-2167","publisher":null,"journal":null,"series":null,"scope":{"volume":2167,"pages":{"from_page":36,"to_page":41}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The area of Digital Libraries (DL) is a multidisciplinary research field and Information Retrieval (IR) is a research area which, amongst other things, addresses methods and technologies for accessing digital information persistently preserved in digital libraries and archives. As a matter of fact, preservation would be useless without means and techniques of accessing stored information, to find and extract useful data. There has always been a strong interrelationship among IR and DL, and one significant example of this is the major organization which promotes IR, the Association for Computing Machinery Special Interest Group on Information Retrieval (ACM SIGIR), 1 which is also one of the co-promoters of one of the major international forums focusing on digital libraries, the Joint Conference on Digital Libraries (JCDL). 2 Moreover, the programs of all conferences on DL also cover IR topics, and many methods and techniques designed and developed by the IR research community are used in the design and building of DL. Another significant example of this synergy is the ideation and development of the first \"online public access catalogues\" (OPACs) [2,6,11], which made broad use of state-of-the-art IR methods in a typical DL setting. Thus, as stated by Edie Rasmussen in [9], \"it would appear that digital library developers have the opportunity to incorporate the best results of information retrieval research\".","refs":[{"start":835,"end":836,"marker":null,"target":"#foot_0"},{"start":1165,"end":1168,"marker":"bibr","target":"#b1"},{"start":1168,"end":1170,"marker":"bibr","target":"#b6"},{"start":1170,"end":1173,"marker":"bibr","target":"#b11"},{"start":1289,"end":1292,"marker":"bibr","target":"#b9"}]},{"text":"The goal of this work is to conduct a longitudinal analysis of relevant IR research results with the aim of understanding the influence of IR research on the theory and practice of DL; moreover, we aim to identify, if possible, the topics that seem most important among those that the two areas are going to address together in the future. We are convinced that by studying IR trends we can garner useful information about the future trends of the DL community.","refs":[]},{"text":"Hence, this study targets two main research questions:","refs":[]},{"text":"1. Is current IR research relevant to DL? 2. Does DL research affect IR?","refs":[]},{"text":"In order to answer these questions, we explore the recent evolution of IR research. To do so, we created a corpus containing all papers that have been published in the proceedings of the last 15 years of the ACM SIGIR Conference, one of the most relevant conferences in IR. We extracted useful information from the main text of published papers, the bibliography, topics and keywords. Afterwards, we conduced statistical analyses to identify research trends in IR and discover if there are DL topics discussed by the IR community.","refs":[]},{"text":"The remainder of the paper is organized as follows: in Sect. 2 we present some related work; in Sect. 3 we describe the process of creating the corpus and present some statistics on the collected data; in Sect. 4 we investigate the relationships between DL and IR; and in Sect. 5 we summarize the results of our study, make some final remarks and reveal our future directions.","refs":[{"start":211,"end":212,"marker":"bibr","target":"#b4"}]}]},{"title":"Related Work","paragraphs":[{"text":"Bibliometrics and topic analysis of corpora of scientific conference papers are quite common especially in information science. These analyses attract the researchers attention since they can offer an interesting viewpoint on the evolution of the topics addressed in the scientific areas related to the conferences.","refs":[]},{"text":"As an example, in 2003, for the commemoration of the 25th anniversary of ACM SIGIR Conference, Smeaton et al. [10] did a content analysis on all papers presented at the ACM SIGIR Conferences from its beginning up to 2002; Smeaton et al. investigated the evolution of topics over the selected period and provided the most central author in the co-authorship graph. Five years later, Hiemstra et al. [5] provided further analysis on papers presented in the ACM SIGIR Conferences from 1978 to 2007 focusing on other aspects such as the contributions of countries in terms of number of papers published and common aspects, such as the analysis of the co-authorship graph.","refs":[{"start":110,"end":114,"marker":"bibr","target":"#b10"},{"start":398,"end":401,"marker":"bibr","target":"#b5"}]},{"text":"The general results we report in this paper complement the results presented in [5,10], because we present general results for the period from 2003 to 2017 that is not fully covered in the other two works. Furthermore, in order to conduct our study and answer our two research questions, rather than rely on an already populated database, we chose to create and populate our own database so as to have all the different data and metadata needed to carry out the study. Unlike [5,10] we also analyzed the synergy between IR and DL. Some considerations of interest for this further study are contained in [3], where key trends that can have implications in DL were identified and highlighted, i.e. new emerging technologies such as big data techniques on search, the growth in importance of documents containing information other than articles such as datasets, presentations, the growth in importance of other sources of data such as media and the recent broadening of technology providers of information. Other considerations have been reported in [9] where, by studying the IR research history, the synergy between IR and DL is shown and some IR key challenges that can have an impact on DL research are highlighted, i.e. multilingual and cross-lingual search, retrieval in non-textual formats, use of relevance feedback, comprehensive retrospective research and user interactive IR systems.","refs":[{"start":80,"end":83,"marker":"bibr","target":"#b5"},{"start":83,"end":86,"marker":"bibr","target":"#b10"},{"start":476,"end":479,"marker":"bibr","target":"#b5"},{"start":479,"end":482,"marker":"bibr","target":"#b10"},{"start":603,"end":606,"marker":"bibr","target":"#b3"},{"start":1048,"end":1051,"marker":"bibr","target":"#b9"}]}]},{"title":"Dataset Creation and Statistics","paragraphs":[{"text":"The steps needed to gather together and organize the corpus used for the study are:","refs":[]},{"text":"1. data collection and database design; 2. data processing and data storage. These two steps are outlined below.","refs":[]},{"text":"We collected all the ACM SIGIR conference proceeding papers published between 2003 and 2017 by downloading them from the ACM digital library3 as PDF files. The collection includes long papers, short papers/posters, workshop papers and tutorials. As a result our data set consists of 2974 distinct papers.","refs":[{"start":140,"end":141,"marker":null,"target":"#foot_1"}]},{"text":"After having built the corpus, the next step was to design and build the database for storing all the data needed to conduct the analyses of interest for our study: the general details and affiliations of authors, the denomination and location of institutions, metadata of ACM SIGIR papers (DOI, year of publication, title, abstract, keywords, ACM Computing Classification System -CCS rev. 20124 -categories), and lists of references for each paper. It is worth noting that the database keeps track of every change of affiliation of the authors in the years of interest. We encoded the PDF files of the corpus by obtaining structured TEI-encoded XML files. 5 This pre-processing step was performed by using the open source GROBID library [1,7].","refs":[{"start":394,"end":395,"marker":null,"target":"#foot_2"},{"start":657,"end":658,"marker":null,"target":"#foot_3"},{"start":738,"end":741,"marker":"bibr","target":"#b0"},{"start":741,"end":743,"marker":"bibr","target":"#b7"}]},{"text":"Subsequently, we parsed the TEI-encoded files by a set of custom methods to extract the raw data about papers and authors and to store them in the database. These methods were designed to allow interactive controls in order to manually solve possible homonyms amongst different authors and to detect possible errors introduced by GROBID.","refs":[]},{"text":"After this process, we performed a manual inspection of the stored information in order to find and fix possible inconsistencies (e.g. different denominations or abbreviations for the same institution were solved). As a result, we obtained a clean database storing all the information necessary to conduct our analyses.","refs":[]},{"text":"Before going deeper into the content analysis and examination of synergy between Digital Library and Information Retrieval, we present relevant statistics that provide a visual insight of the information within the database that clearly demonstrates the growth in activity within the IR community over the last 15 years.","refs":[]},{"text":"Our database stores a total of 2974 papers published in the ACM SIGIR proceedings, 1155 of those are full papers and the other 1819 are short papers, posters, demos, tutorials and workshops. Table 1 compares the evolution in the number of published papers and the number of active authors. The amount of publications increased noticeably from 2003 to 2007, then, from 2008 to 2017 there were some minor fluctuations with a minimum of 206 and a maximum of 255 papers per year.","refs":[{"start":197,"end":198,"marker":"table","target":"#tab_0"}]},{"text":"Moreover, the number of active authors per year has been growing considerably suggesting that IR is emerging as a primary research area and that the number of researchers that choose to work in this field is growing.","refs":[]},{"text":"This consideration is strengthened by the inspection of the distribution of the country contributions which are reported in Fig. 1 and that highlight the worldwide expansion of IR research. The contribution of each country was computed by considering the number of papers in which there is at least one author affiliated with an organization/institution located in that country. The countries with the highest number of publications are the United States, with a percentage of presence in author affiliations of 37%, and the Republic of China, with a percentage of presence of 14%. It is worth noting that located in these two countries are (were) the most active and central organizations in the research area, such as Microsoft and some universities, such as Tsinghua University and the University of Massachusetts Amherst.","refs":[{"start":129,"end":130,"marker":"figure","target":null}]}]},{"title":"Data Analysis","paragraphs":[{"text":"In this section we investigate the research trends in IR and the role of DL research within the IR community. We focus on the evolution of the most used terms, keywords and topics in ACM SIGIR papers from 2003 to 2017.","refs":[]}]},{"title":"Most Used Keywords and Cited Terms","paragraphs":[{"text":"We analyzed the evolution of term frequencies in the title and abstract fields and the frequencies of the keywords generated by the authors in the long papers published in the ACM SIGIR Conference between 2003 and 2017.","refs":[]},{"text":"We used the Terrier IR Platform, 6 an open source search engine which provides indexing and retrieval functionalities [8], to process the text documents of the corpus. Paper titles and abstracts have been extracted by removing stopwords (we used the Terrier default stoplist), then they were indexed and finally word frequencies were calculated.","refs":[{"start":33,"end":34,"marker":null,"target":"#foot_4"}]},{"text":"Table 2 shows the most used words in title and abstract fields alongside the most used keywords extracted from the text of the papers of the corpus.","refs":[{"start":6,"end":7,"marker":"table","target":"#tab_1"}]},{"text":"We can see that the most common and consolidated topics are \"Evaluation\", \"Learning to Rank\" or \"Web Search\", but it is also interesting to note that some topics were preponderant for a certain period of time and then vanished -a noticeable example is \"Diversity\" which appeared in 2010 and lasted for 4 yearswhereas other topics have appeared only in recent years, such as \"Twitter\" which appeared in 2009 and was the second most used keyword in 2012 although since it has not been used as much in the past (as shown in Fig. 2).   Another relevant aspect is that in the initial years of the period we have analyzed, the main focus of IR research was on system-oriented topics, including data-centered and information processing aspects -keywords such as \"Language Models\", \"Text Classification\" and \"Evaluation\" were preponderant -whereas in later years the focus progressively shifted towards user behavior and user-system interaction -in this case the most common keywords are \"Personalization\", \"Relevance Feedback\", \"Query Reformulation\" and \"Recommender Systems\" (Fig. 3).","refs":[{"start":526,"end":527,"marker":"figure","target":"#fig_0"},{"start":1075,"end":1076,"marker":"figure","target":"#fig_1"}]},{"text":"It is interesting to note that a crucial disruptive topic appeared in 2015: \"Deep Learning\" which strengthened the \"Machine Learning\" topic already present in the previous years, even though it was not as central as it is nowadays (Fig. 3).","refs":[{"start":237,"end":238,"marker":"figure","target":"#fig_1"}]},{"text":"The analysis of word frequencies underlines the presence of the same words appearing as the most used words in the paper title and abstract sections over all the study years; this was expected because a compiled stop-word list provided by the Terrier tool was used and not a customized stop-word list. However, this analysis is not without worth, because it supports the previous result on the transition from a data-centered to user-centered focus of the IR community that is underlined by the increasing frequency of the words \"User\" and \"Users\".","refs":[]}]},{"title":"CCS Categories","paragraphs":[{"text":"It is worth noting that the results presented in Sect. 4.1 reported on the evolution of core topics by analyzing frequent words and keywords that are informally defined by authors without any specific standardization. By contrast, good indicators of the topics that appeared and those that were left out over the last 15 years in the IR area can be derived from the analysis of the categories associated to ACM SIGIR papers. In fact all the categories associated to the papers of the ACM SIGIR collection were updated and revised in 2012 using the categories of the ACM CCS rev. 2012, which is a standard classification system. This is one of the reasons why we decided to rely on the ACM digital library, because it provides a standard updated classification system applied to all papers of all years and revised in 2012. Therefore, we analyzed the evolution of these categories, which increased the validity of our investigation, and found some particular and noticeable trends. Figures 4 and5 show the most interesting CCS category frequencies on the ACM SIGIR Conference long papers between 2003 and 2017.","refs":[{"start":989,"end":990,"marker":"figure","target":"#fig_2"},{"start":994,"end":995,"marker":"figure","target":"#fig_3"}]},{"text":"Some IR topics are consolidated and have been relatively stable in the past 15 years, such as \"Document Representation\", \"Retrieval Model and Ranking\", \"Retrieval Task and Goal\", \"Evaluation of Retrieval Results\". Other categories have been introduced in recent years such as \"Query Log Analysis\" and \"Query Reformulation\" which appeared only in the last two years, while \"Search Personalization\", \"Search Interfaces\", \"Sentimental Analysis\", \"Retrieval on Mobile Devices\", \"Specialized Information Retrieval\", \"HCI Design and Evaluation Methods\" started to play a preponderant role only in 2016. This means that IR is constantly expanding its application domain, and the expansion is driven by new and emerging technologies and changes in social lifestyle, growth both in more specific applications and in human-centered systems. Moreover, IR reacts to the effect of the dizzying growth rate of the new computer science areas: this emerges from the appearance of the use, only since 2016, of \"Machine Learning Algorithms\" and \"Machine Learning Theory\" categories.","refs":[]}]},{"title":"Focused Analysis on Digital Library Topics","paragraphs":[{"text":"For the sake of our study, it is worth noting the presence of \"Digital Libraries and Archives\" both as a subcategory of \"Applied Computing\" and a subcategory of \"Information Systems\". Figure 4 reports that 10 long papers are classified under the \"sub-tree\" of the first subcategory and Fig. 5 reports that 11 long papers are classified on the other sub-tree of the classification system. Thus, we extended our analysis to all types of papers (long, short, demos, poster, ...) and we considered the presence of the \"digital library\" keyphrase in the abstract field. We found that the presence of \"digital library\" in the categories does not necessarily mean the presence of the term \"digital library\" in the abstract field and vice versa.","refs":[{"start":191,"end":192,"marker":"figure","target":"#fig_2"},{"start":291,"end":292,"marker":"figure","target":"#fig_3"}]},{"text":"We found that a total number of 31 ACM SIGIR 2003-2017 papers are categorized with at least one \"Digital Libraries and Archives\" category (11 of those are long papers). Figure 6 shows the evolution of the number of papers (long papers, short papers, posters, workshops, demos) classified with \"Digital Libraries and Archives\" and shows a peak of 6 papers which present DL in the CCS Categories in 2007, about 3% of the total amount of ACM SIGIR papers published in that year, and a peak of 5 papers dealing with DL in the abstract field in 2013, that is about 2.5% of the total number of ACM SIGIR papers published in that year. Further investigation revealed that there were 81 authors for these papers, most of whom came from the USA and the Netherlands (as shown in Table 3). Moreover, it is worth noting that all of these authors are academic researchers, with no affiliations other than universities.   We therefore investigated what the topics of these 31 papers were and found that they mostly present, elaborate and evaluate new approaches and techniques to be applied in Digital Libraries, such as XML retrieval, natural language processing, text mining, recommendation methods, federated text retrieval, duplicate detection and methods for managing large collections.","refs":[{"start":176,"end":177,"marker":"figure","target":"#fig_4"},{"start":775,"end":776,"marker":"table","target":"#tab_2"}]}]},{"title":"Final Remarks","paragraphs":[{"text":"Discussion. In this work we analyzed the evolution of IR research topics in the last 15 years with a specific focus on DL-related aspects.","refs":[]},{"text":"The first results we would like to emphasize are how the IR research community has been growing in recent years and how it has adapted to the most recent trends in computer science; this is clearly highlighted by the growing importance of topics such as \"Deep Learning\" and \"Social Media\" (expressed with different categories and keywords such as \"Twitter\" in 2012).","refs":[]},{"text":"Another relevant aspect is the growing attention towards user-centered aspects of search, such as human-computer interaction, user studies, understanding and modeling how users search and what the most relevant tasks are nowadays. This aspect is strictly connected with the DL research field since the role of users in DL has always been preponderant, as highlighted by Rasmussen in [9]. The synergy between DL and IR foreseen in [9] can also be found in the most relevant topics addressed by ACM SIGIR papers, especially with regard to the use of relevance feedback and cross-lingual search. Digital libraries also played a relevant role within the ACM SIGIR community because they provided (and still provide) interesting search tasks and challenging collections to work with. Most of the ACM SIGIR papers categorized with \"Digital Library\" deal with: searching documents in semi-structured formats such as XML, identifying math formulas and retrieving formulas from textual documents, cooperative search done by expert users, finding translations or searching scanned book collections, federated document retrieval and using user feedback to improve search results. All these aspects are clearly related to DL since they provide wide and challenging document collections that need to be accessed and efficiently searched; in past years XML was a central format for document exchange and encoding, now RDF is growing and the use of semantics and relations between entities and documents are gaining traction. DL on the one hand provides the data and user requirements that can be addressed by IR research, while on the other hand it employs the results that the IR community produces. The relation between IR and DL constitutes a positive and factual technology transfer channel between the two disciplines.","refs":[{"start":383,"end":386,"marker":"bibr","target":"#b9"},{"start":430,"end":433,"marker":"bibr","target":"#b9"}]},{"text":"Other aspects that relate DL to IR are user profiling and the definition of specialized search services for different user types such as general users, expert users, domain experts and so on. This is an aspect that has always been central in the DL context and that is slowly gaining traction also in IR. IR and recommendation systems are increasingly intertwined [14] as they become increasingly integrated into DL services [4,13].","refs":[{"start":364,"end":368,"marker":"bibr","target":"#b14"},{"start":425,"end":428,"marker":"bibr","target":"#b4"},{"start":428,"end":431,"marker":"bibr","target":"#b13"}]}]},{"title":"Conclusion.","paragraphs":[{"text":"It is important to highlight the role of public and private investment in DL research; indeed, in the first decade of the century both the European Commission and the National Science Foundation in the USA invested conspicuously in DL-related research projects. This resulted in a growth in the interest of researchers in the DL area with positive spill-overs into other fields as shown by a growing number of DL-related papers published at ACM SIGIR in 2006-2007. In recent years, research investments have shifted to other topics, thus reducing the interest in DL topics which translated into a smaller number of researchers dedicated to this field; this is also evident when considering ACM SIGIR publications in the last three years, in fact there were almost no DL-related paper presented at the conference.","refs":[]},{"text":"By conducting this study we realized that DL is a field which still has great potential because it has unique collections of textual and non-textual documents and a wide and heterogeneous user base with all kinds of access and search tasks. Nevertheless, in order to keep up the high level of research activity in this field it is necessary to maintain a highly multidisciplinary profile that can continue to attract researchers from other fields and that can \"feed\" other related research fields with challenging data and tasks to be addressed. This synergy, if constantly sustained and nurtured, has a true potential for improving DL services as well as search and access methods in general.","refs":[]}]},{"title":"Future Directions.","paragraphs":[{"text":"For the presented analysis we relied on a text mining approach; on the other hand, a bibliometrical approach would allow us to better investigate the interrelationships among papers and authors of the IR and DL fields, and how these two fields influence each other. This would also allow us to identify which authors are peculiar to the DL and who instead belong to both the IR and DL communities. Thus, we plan to use a bibliometric approach to undertake further analyses in the future, and we plan to extend the analysis considering in addition the impact of the public and private funding initiatives in the DL community. To this end, we could leverage on DBLP-NSF [12], that connects computer science publications extracted from DBLP to their NSF funding grants, by extending it also to European and National funding agencies.","refs":[{"start":668,"end":672,"marker":"bibr","target":"#b12"}]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"Number of papers published in ACM SIGIR proceedings from 2003 to 2017 and number of active authors per year.","rows":[["Year Number of papers Number of active authors"],["2003 106","252"],["2004 133","293"],["2005 138","341"],["2006 152","335"],["2007 221","482"],["2008 206","461"],["2009 207","501"],["2010 217","504"],["2011 238","559"],["2012 224","562"],["2013 210","512"],["2014 229","588"],["2015 204","524"],["2016 234","647"],["2017 255","705"]]},"tab_1":{"heading":"Table 2 .","description":"Top 15 most used words in title and abstract and most used keywords in ACM SIGIR papers in the period 2003-2017.","rows":[["Country","Contribution Percentage"],["USA","37%"],["Republic of China","14%"],["United Kingdom","8%"],["Canada","4%"],["Singapore","4%"],["Spain","3%"],["The Netherlands","3%"],["Hong Kong","3%"],["Australia","3%"],["Italy","2%"],["Israel","2%"],["Japan","1%"],["Brazil","1%"],["Switzerland","1%"],["Japan","1%"],["India","1%"],["South Korea","1%"],["Russia","1%"],["Taiwan","1%"],["Finland","1%"],["France","1%"],["Other","4%"],["Fig. 1. Heat map and table showing country contributions on ACM SIGIR Conference"],["between 2003 and 2017.",""]]},"tab_2":{"heading":"Table 3 .","description":"Country contribution percentages on ACM SIGIR papers classified with \"Digital Libraries and Archives\" CCS Category.","rows":[["Country","Contribution percentage"],["USA","23.4%"],["The Netherlands 20.2%"],["Germany","13.8%"],["United Kingdom 11.7%"],["China","8.5%"],["Australia","7.4%"],["Brazil","3.2%"],["Italy","3.2%"],["India","1.1%"],["Qatar","1.1%"],["Portugal","1.1%"],["Denmark","1.1%"],["Japan","1.1%"],["France","1.1%"],["Singapore","1.1%"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"In this paper we present the results of a longitudinal analysis of ACM SIGIR papers from 2003 to 2017. ACM SIGIR is the main venue where Information Retrieval (IR) research and innovative results are presented yearly; it is a highly competitive venue and only the best and most relevant works are accepted for publication. The analysis of ACM SIGIR papers gives us a unique opportunity to understand where the field is going and what are the most trending topics in information access and search.","refs":[]},{"text":"In particular, we conduct this analysis with a focus on Digital Library (DL) topics to understand what is the relation between these two fields that we know to be closely linked. We see that DL provide document collections and challenging tasks to be addressed by the IR community and in turn exploit the latest advancements in IR to improve the offered services.","refs":[]},{"text":"We also point to the role of public investments in the DL field as one of the core drivers of DL research which in turn may also have a positive effect on information accessing and searching in general.","refs":[]}]}}