{"bibliography":{"title":"Metadata as Semantic Palimpsests: The Case of PHAIDRA@unipd","authors":[{"person_name":{"surname":"Bellotto","first_name":"Anna"},"affiliations":[{"department":"The University Library Centre \"ULC\"","institution":"University of Padova","laboratory":null}],"email":"anna.bellotto@unipd.it"},{"person_name":{"surname":"Bettella","first_name":"Cristiana"},"affiliations":[{"department":"The University Library Centre \"ULC\"","institution":"University of Padova","laboratory":null}],"email":"cristiana.bettella@unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-11226-4_14","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Web of data","Cultural heritage object metadata","Crosswalk","Data model"],"citations":{"b0":{"title":"The user in focus: an inclusive approach to the presentation of digital collections of GLAM institutions","authors":[{"person_name":{"surname":"Andreoli","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Carrer","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Drago","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Turetta","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Zane","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Mitteilungen der Vereinigung Österreichischer Bibliothekarinnen und Bibliothekare","series":null,"scope":{"volume":71,"pages":{"from_page":125,"to_page":135}}},"b1":{"title":"Defining University museums' objects for the web","authors":[{"person_name":{"surname":"Andreoli","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Fornasiero","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Menegazzi","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Talas","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2015","month":"06","day":"13"},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Esperienze e modelli di dati: il caso Phaidra","authors":[{"person_name":{"surname":"Turetta","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"PHAIDRA_DC Metadata Element Set Version 1.1","authors":[{"person_name":{"surname":"Bettella","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Andreoli","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Cappellato","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Carrer","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Drago","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Turetta","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":"http://phaidra.cab.unipd.it/static/phaidra_dc-metadata-element-set.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"PHAIDRA_MODS Metadata Element Set Version 1","authors":[{"person_name":{"surname":"Bellotto","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Bettella","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"PHAIDRA, a repository project of the University of Vienna","authors":[{"person_name":{"surname":"Budroni","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Höckner","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"LOM Univie Schema","authors":[{"person_name":{"surname":"Budin","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2006","month":"04","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"CanCore Guidelines for the Implementation of Learning Object Metadata","authors":[{"person_name":{"surname":"Friesen","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Fisher","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Roberts","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":"http://cancore.athabascau.ca/en/guidelines.html","publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"A Librarian's Guide to Graphs, Data and the Semantic Web","authors":[{"person_name":{"surname":"Powell","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Hopkins","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":"Chandos Publishing","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":130,"to_page":130}}},"b9":{"title":"Implementation of a classification server to support metadata organization for long term preservation systems","authors":[{"person_name":{"surname":"Kopácsi","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Hudak","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Ganguly","first_name":"R"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Mitteilungen der Vereinigung Österreichischer Bibliothekarinnen und Bibliothekare Bd","series":null,"scope":{"volume":70,"pages":null}},"b10":{"title":"World Wide Web Consortium (W3C): SKOS Simple Knowledge Organization System Primer","authors":[],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":"Working Group Note","journal":null,"series":null,"scope":null},"b11":{"title":"C): SKOS Simple Knowledge Organization System Reference","authors":[],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Skosmos Homepage","authors":[],"date":null,"ids":null,"target":"http://vocab.phaidra.org/skosmos/en/?clang=en","publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"Publishing SKOS concept schemes with Skosmos","authors":[{"person_name":{"surname":"Suominen","first_name":"O"},"affiliations":[],"email":null}],"date":{"year":"2016","month":"04","day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":25,"to_page":25}}},"b14":{"title":"Linee guida per la compilazione dei metadati","authors":[{"person_name":{"surname":"Cappellato","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b15":{"title":"MODS to RDF Mapping Recommendations","authors":[{"person_name":{"surname":"Samvera","first_name":"Mods"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":null,"target":"https://docs.google.com/document/d/1FZI8KJiW4qSKYUUKe0mAwqlx0ppVRFyPtsfLDqQE5T8/edit","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Phaidra (Permanent Hosting, Archiving and Indexing of Digital Resources and Assets) is the platform of the University Library System of the University of Padova for the long-term archiving of digital objects and collections, currently hosting a vast range of 390,000 digital objects including antiquarian books, manuscripts, photographs, wall charts, maps, learning objects, films, archival material and museum objects [1].","refs":[{"start":419,"end":422,"marker":"bibr","target":null}]},{"text":"Designed and developed by the University of Vienna 1 [2] beginning in 2008 based on the digital architecture of the Fedora open source system, Phaidra was adopted by the University of Padova in 2010, when the two institutions signed a bilateral collaboration agreement which led to the creation of the organisational structure and the formation of the Phaidra.org network infrastructure [3], which gradually continued to grow, both locally and internationally, by hosting cultural institutions such as Galleries, Libraries, Archives, and Museums, also known by the acronym GLAM [4,5] (See Fig. 1).","refs":[{"start":387,"end":390,"marker":"bibr","target":null},{"start":578,"end":581,"marker":"bibr","target":"#b0"},{"start":581,"end":583,"marker":"bibr","target":"#b1"},{"start":594,"end":595,"marker":"figure","target":"#fig_0"}]},{"text":"The distinctive characterisation of the Paduan instance of Phaidra since its inception has on the one hand been the illustrative and heterotopic2 valorisation of the heterogeneous richness of the University's digital collections of cultural heritage, such as those from departments and research centres, archives and museums, as well as from libraries' digitisation projects [6]. On the other hand, it acts as an attraction for other academic institutions in the region3 , triggering a virtuous cycle of cultural and technological infrastructural osmosis which has conferred upon Phaidra, in addition to its primary function as a Digital Asset Management system, as well as the interinstitutional aggregator, an organisation that collects and aggregates, creates and administers metadata from multiple content providers.","refs":[{"start":144,"end":145,"marker":null,"target":"#foot_1"},{"start":375,"end":378,"marker":"bibr","target":null},{"start":469,"end":470,"marker":null,"target":"#foot_2"}]},{"text":"Given the definition of aggregator, Phaidra serves at the same time as a service provider, through its portal and Web API [4,7] 4 , and as a data provider to external service providers, exposing its metadata through the OAI-PMH protocol [8,9]. The expansion of this aggregative and meta-aggregative function of heterogeneous metadata from similarly heterogeneous origins has raised the urgent need for a critical analysis of the foundational data model of Phaidra Universität Wien metadata (hereinafter UWmetadata), both from the point of view of its mapping and conversion into the Dublin Core metadata scheme aimed at its publication in the OAI-PMH Phaidra data provider, as well as the visualisation and presentation of data in the Phaidra web interface [10].","refs":[{"start":122,"end":125,"marker":"bibr","target":"#b0"},{"start":125,"end":127,"marker":"bibr","target":null},{"start":128,"end":129,"marker":null,"target":"#foot_3"},{"start":237,"end":240,"marker":"bibr","target":null},{"start":240,"end":242,"marker":"bibr","target":"#b2"},{"start":757,"end":761,"marker":"bibr","target":"#b3"}]},{"text":"This presentation provides evidence of the solutions which were identified and their outcomes, aimed on the one hand at the distinctive valorisation of the dual analoguedigital identity of the Phaidra cultural heritage object, highlighting its profile from the authorial point of view (people ! Who), from the physical-digital materiality of the work being described (works ! What), from the space-time dimension (Where and When) and from the traceability of the provenance; and, on the other hand, it is aimed at metadata reuse as a visual function and for accessibility to content, used in the conception of the new graphic design of the web interface, which is being done in order to encourage discovery, even serendipitously, of the content found in Phaidra by digital researchers and browsers.","refs":[]},{"text":"Coherent to a process intended to be evolutionary and seamless, the implementation project of the Metadata Object Description Schema (MODS) standard in Phaidra will also be illustrated. Through the prototype processing of mapping from UWmetadata, this has allowed for a retrospective and recursive review of some coding choices previously defined in the mapping between the UWmetadata schema and the Dublin Core elements set, resulting in the updating to a new version of the profile and regeneration of Dublin Core metadata in the Phaidra web interface [11].","refs":[{"start":554,"end":558,"marker":"bibr","target":"#b4"}]},{"text":"Finally, we intend to highlight how the MODS implementation is also functional in the prospects of ongoing and future development of the Phaidra platform, focused on Resource Description Framework (RDF) migration and adoption of standards and their technologies of the Semantic Web, in line with the semantic evolution of the concept of metadata to linked open data, meant as a new informational entity which necessarily eludes the identity and exclusiveness of a single catalogue, a single digital repository, or a single digital library system, by presenting here an unpublished example of the Simple Knowledge Organization System (SKOS) prototype and last, but not least, suggesting the definition of a new Phaidra data model.","refs":[]}]},{"title":"The PHAIDRA_DC Profile (and PHAIDRA_MODS Profile)","paragraphs":[{"text":"The foundational data model of Phaidra, called Universität Wien metadata and abridged as UWmetadata, informs the design of Phaidra metadata, both in terms of representation of the values as well as the description of the contents [12]. It is the result of the expansion of the IEEE Learning Object Metadata (LOM) standard (IEEE 1484.12.1 -2002), and the combination of elements of different metadata namespaces. This places UWmetadata among the examples of application profile (AP), which for example include the data profile of the portal for CulturaItalia PICO, the data profile of the portal for Europeana E(uropeana)D(ata)M(odel) and the former E(uropeana)S (emantics)E(lements) as well as the application of EDM in the context of the Digital Public Library of America and the German Digital Library.","refs":[{"start":230,"end":234,"marker":"bibr","target":"#b5"}]},{"text":"In general, the LOM schema is a data model, usually encoded in XML, used to describe learning objects or digital resources for educational purposes such as learning supports. LOM, as its UWmetadata application profile, structures the metadata in accordance with a hierarchy of elements defined in nine top-level categories, and containing groups of attributes in a tree structure. In the following images (Figs. 2, 3 and 4), see respectively the LOM conceptual map [13], the explanation of its top-level categories and an XML snippet of UWmetadata schema: UWmetadata extends the LOM schema with further additional categories aiming to represent primary data stored in Phaidra (Contextual allegation and Provenience respectively) 5 , digital books (Digital book) 6 , and electronic theses (eThesis) 7 : 5 The Institute History of Arts at the University of Vienna asked for these new sections [12]. 6   7 The eThesis category has not been implemented at Phaidra@unipd since theses are currently hosted at the EPrints repositories Padua@thesis (http://tesi.cab.unipd.it/) and Padua@research (http:// paduaresearch.cab.unipd.it/), the latter specifically devoted to doctoral dissertations.","refs":[{"start":465,"end":469,"marker":"bibr","target":"#b6"},{"start":891,"end":895,"marker":"bibr","target":"#b5"}]},{"text":"The analysis of mapping between the UWmetadata schema source and the Dublin Core target schema has established, as each of metadata crosswalk activities, the mapping of the correspondences of elements, the syntax and semantics of the two schemas involved, adopting a relative translation mode, namely trying to map each source element into at least one of the target elements, in order to avoid as much as possible any loss of information recorded in the source schema.","refs":[]},{"text":"Each correspondence has also determined, depending on the encoding purposes, an inter-schema relationship such as one-to-one, one-to-many, many-to-one, and many-tomany, a fortiori if one considers the conversion of a descriptive schema organised in blocks, or nuclei, semantic and nested like UWmetadata in a flat schema such as the Dublin Core metadata schema.8 Fig. 3. LOM (Source: [14]) and UWmetadata top-level categories. By way of example, the authorial entity has been defined both from the point of view of the intellectual level of contribution in the creation of the described resource (Creator, Contributor) and from that of the mode and form established for the value recorded in the source elements 9  Each inter-schema encoding relationship has been described and reviewed following a system of standard analytical matrix accompanied by the following informational units: standard textual descriptions and definitions of the elements adapted to the Phaidra informational context; their unique identification (Uniform Resource Identifier, URI) and possible classification into the corresponding elements refined by DCMI Metadata Terms; the compulsoriness and replicability of conversion encoding; the version of the mapping, namely replacement of an earlier version; notes where the reasons for the encoding choices adopted are critically discussed, also in terms of historical stratification of the mapping, together with the formalisation of any logical conditions to be complied with for a correct writing of the conversion code; the exemplary extrapolation of XML snippets from source and target elements; the label adopted in the display element and its real representation from the point of view of the form prescribed for the value of the reference being converted [10]:","refs":[{"start":361,"end":362,"marker":null,"target":"#foot_4"},{"start":368,"end":369,"marker":"figure","target":null},{"start":384,"end":388,"marker":"bibr","target":"#b7"},{"start":712,"end":713,"marker":null,"target":"#foot_5"},{"start":1785,"end":1789,"marker":"bibr","target":"#b3"}]},{"text":"As a reflection of the inter-schema complexity of mapping of the two schemas involved, we can use the example of encoding the Dublin Core Date element compared to its specular version in the temporal elements of the MODS standard, from which, however, the Dublin Core mapping has recursively derived benefits both in terms of information quality of the metadata and in their presentation.","refs":[]}]},{"title":"Date","paragraphs":[{"text":"In the context of PHAIDRA_DC profile, the Date element <dc:date> translates a temporal event related to the lifecycle of the resource, certain or inferred, in terms of the date of publication (dateIssued) or creation (Created), which can be expressed either in exact form or as a time interval, open or closed, according to the formats that conform to the ISO 8601 Date and time format standard.","refs":[]},{"text":"UWmetadata sources for coding the Date element are:","refs":[]},{"text":"1. sub-element <ns1:date> of Contribute <ns1:contribute> in Lifecycle <ns1:lifecycle> 2. sub-elements <ns10: date_from><ns10:date_to> of Contribute <ns10:contribute> in Provenience <ns10:provenience> 3. the element <ns12:releaseyear> in Digitalbook <ns12:digitalbook>.","refs":[]},{"text":"The conversion to <dc:date> of sub-elements <ns10:date_from> <ns10:date_to> from Contribute <ns10:contribute> in Provenience <ns10: provenience> was introduced in version 1.1 2018, on the basis of the encoding example of MODS temporal sub-elements, in order to permit the allocation of uncertain or inferred dating to the described resource.","refs":[]},{"text":"In fact, MODS provides granular and distinctive representation about the temporalisation of the resource by hosting in the upper element <originInfo> the subelements specific to each type of dating: <dateIssued>, <dateCreated>, <dateValid>, <dateModified>, <copyrightDate>, <dateOther>, partially also represented by qualified terms of the Dublin Core vocabulary.","refs":[]},{"text":"By contrast, encoding of the Date <dc:date> element not only translates the values of heterogeneous source elements, but also if, and only if, there are the predetermined conditions, which are in order:","refs":[]},{"text":"1. <ns12:releaseyear> of <ns12:digitalbook>. If <ns12:re-leaseyear> is not filled, then: 2. <ns1:date> of <ns1:contribute> in <ns1:lifecycle> with <ns1: role> code 47 equal to Publisher type institution (<ns3:type>institution </ ns3:type>) OR with <ns1:role> code 1557141 of Printer type person or institution. If these elements are not populated, then: 3. the first occurrence <ns1:date> of <ns1:contribute> in <ns1:life-cycle> with <ns1:role> code 1552095 same as Author, whether the entity is a person or an institution. If these elements are not populated, then: 4. the first occurrence of <ns1:date> of <ns1:contribute> of <ns1: lifecycle> if the value of <ns1:role> has different code than 47 Publisher institution type, and from 1557141 Printer to code 1552154 Author of the digitisation, whether the entity is a person or an institution.","refs":[]},{"text":"If the conditions described in paragraphs 1-4 are not met, then they take the values of the sub-elements Date from <ns10:date_from>; Date to, Date up to <ns10:date_to> of Contribute <ns10:contribute> in Provenience, which can represent an uncertain or inferred date of the resource, according to the following modes and forms: If the conditions set out in paragraphs 1-5 are not met, the <dc:date> is omitted, and the date of publication of the digital object in PHAIDRA recorded in <ns1: upload_date> of <ns1:lifecycle> is not published.","refs":[]},{"text":"See the example of display of the target elements, which significantly highlights the translational operation described, in particular by observing the outcome displayed: DC_Target <dc:date>ns12:releaseyear</dc:date> If not then: <dc:date>ns1:date</dc:date> → as expressed by conditions 2) and 3)","refs":[]},{"text":"If not then: <dc:date>ns10:date_from=ns10:date_to</dc:date> → as expressed by conditions 5a)","refs":[]},{"text":"If not then: <dc:date>ns10:date_from-ns10:date_to</dc:date> → as expressed by conditions 5b)","refs":[]},{"text":"If not then: <dc:date>ns10:date_from-</dc:date> → as expressed by conditions 5c)","refs":[]}]},{"title":"Example","paragraphs":[{"text":"Date 1822 1820-1830 1822-","refs":[]}]},{"title":"Some Remarks in the Margin","paragraphs":[{"text":"The mapping and conversion of UWmetadata to Dublin Core is de facto a chance conversion, sometimes acrobatic, aimed at informing a qualified and comprehensive informative aggregate in the conceptual simplification of the Dublin Core element, which has made it possible at once to identify the functional requirements needed to accommodate schemas of refined metadata, such as for example the MODS standard, whose prototype mapping analysis has made further refinement possible in the Dublin Core encoding choices.","refs":[]},{"text":"Additionally, it has enhanced precision in the representation of data and information content of Phaidra by disclosing its data profile and conceptualising the source model of data by qualifying and formalising its core elements. It also encouraged reflection in evolutionary terms of its ontological structure, outlining where possible the classes of Persons, Works, Space, and Time.","refs":[]},{"text":"It has clarified and characterised the different levels and the interdependence of the dimensional combination of physicality and digitality of the information content (and knowledge) conveyed by the Phaidra cultural heritage object.","refs":[]},{"text":"It has, in particular, made it possible to experience and evaluate the vital importance of standards, the adoption of which creates interoperability, leading to the decontextualisation of data from the scope of their original creation, accelerating their exposure and potential for reuse in different contexts and by different services, with the valorisation and development of the informative and cognitive value of which they are a memorial device.","refs":[]},{"text":"It has helped to strengthen the methodological attitude for a correct reading of the data, or of reading of the data as \"semantic palimpsests\" given the stratified and permanent coexistence of heterogeneous data models, and their evolutionary and generative function in terms of schema, structure, profile, model, in aggregate form and as corpora of data, stressing the knowledge that each mapping activity is an inter-data conceptual negotiation which implies, more than anything else, a mutual understanding and compromise (See Fig. 5). 3 Towards a Semantic Data Modelling \"In libraries, metadata is a first-class object. Metadata doesn't just describe a library resource, it also connects that resource to entities such as people, places, events, and to other resources\" [15]. The persisting validity of this statement in the context of digital repositories can be easily let it be understood. Rather, it is here considered of greater value to focus on how the technical set of established standards and technologies, collectively referred to as \"Linked Data\", are able to implement and increase the faceted connective potential of metadata.","refs":[{"start":535,"end":536,"marker":"figure","target":"#fig_4"},{"start":774,"end":778,"marker":"bibr","target":"#b8"}]},{"text":"Since 2016, within a broader workflow pursued by the team of the University of Vienna targeting an enhanced interoperability and accessibility of Phaidra, the development and implementation of a Classification Server has been assessed as one task needed to be carried out. Consisting of an external component to the digital asset management system, the Classification Server would handle and provide in one place all relevant thesauri, classification schemes, taxonomies and controlled vocabularies potentially needed for the assignment of well-defined metadata to digital objects [16] (see Fig. 6). The ideal goal of the Classification Server would be to ensure that during the upload of new items to the repository, when the user adds metadata information to these resources, as well as during the search for objects, when the user types terms in order to search for specific digital objects, Phaidra's users could have access to the main Knowledge Organization Systems (KOSs) as much as easy, comfortable and user-friendly as possible [16]. The opportunity represented by this tool to remarkably enrich both the platform usability and metadata interoperability of the repository was recognised by the working group of the University of Padova as well; this team thus decided in the last few months to start its own narrower implementation analysis of the new component in its local management system. From a technical point of view, the required import format for the various controlled vocabularies and classification schemes to be imported and locally managed by the database and the web application that form up the Classification Server architecture (see Fig. 7) is Simple Knowledge Organization System (SKOS) data model. This is defined as a data-sharing standard recommended by the W3C community for representing in Semantic Web and Linked Data technologies context, that is in Resource Description Framework (RDF) language, the many existing systems used to organise information. Based on the assumption that the Knowledge Organization Systems share a similar structure and content, SKOS allows them to be transformed from isolated and stand-alone entities of organized information into a global machine-readable network of highly integrated conceptual schemes, which are thus publishable in the Web, shareable, readable, wider re-usable and therefore automatically (and much more meaningfully) discoverable by software applications [17,18].","refs":[{"start":581,"end":585,"marker":"bibr","target":"#b9"},{"start":596,"end":597,"marker":"figure","target":"#fig_5"},{"start":1038,"end":1042,"marker":"bibr","target":"#b9"},{"start":1667,"end":1668,"marker":"figure","target":"#fig_6"},{"start":2443,"end":2447,"marker":"bibr","target":"#b10"},{"start":2447,"end":2450,"marker":"bibr","target":"#b11"}]},{"text":"To date, within Phaidra archival system, the most concrete attempt towards the use of standardised values as metadata has resulted into two locally-implemented lists of descriptors intended to index the catalogued objects and to facilitate their easy retrieval. They are the Phaidra Type of Material Vocabulary 10 and the Phaidra Roles Vocabulary 11 , relating respectively to the material of the resource and the role of the entities contributing to the creation of the (analogue or digital) object. Given this premise, the first phase of implementation of the Classification Server was thus focused on transferring these two (not machine-readable) local vocabularies to the Semantic Web technology context. Their representation in SKOS format was tested towards their future migration from data silos to largely linkable and shareable Linked Open Vocabularies.  Overall, during the prototypal encoding of these two lists of terms, the essential emphasis of SKOS data model on semantics rather than on terminology enabled the problematic and poorly interoperable approach of the \"term\" to be replaced with the less ambiguous and much more effectively understandable notion of the \"concept\". The concept is what constitutes the fundamental element of SKOS vocabulary: it is an abstract unit of thought, i.e. an idea, a meaning, a class of objects or events, uniquely identified by an URI and independent from the multiform expressions used to label it in natural language [17,18]. The example in Fig. 8 visually displays the aforementioned theoretical core of SKOS standard: the concept of \"calligrapher\" (<skos:Concept>), contained in Phaidra Roles Vocabulary, is noticeably distinct from its corresponding bilingual terminological expressions, both the preferred lexical label (<skos:prefLabel>) and the alternative one (<skos:altLabel>), as well as from the explanatory note about the intended meaning of the concept (<skos:definition>).","refs":[{"start":1472,"end":1476,"marker":"bibr","target":"#b10"},{"start":1476,"end":1479,"marker":"bibr","target":"#b11"},{"start":1501,"end":1502,"marker":"figure","target":"#fig_7"}]},{"text":"Nevertheless, within a scenario of future feasibility, the true most valuable enhancement in terms of data association and integration lies on the mapping of semantic relations between concepts. The logic of the \"Web of Data\", consisting in expressing the relationships among data in order to define and describe the same data, mirrors the crucial features of SKOS data model. In this context, asserting which relationships exist between concepts of a single concept scheme and, more importantly, which links could be established between concepts of two or more different (but still semantically-related) schemes, constitutes the real key advantage for the different communities of Knowledge Organization Systems. Indeed, SKOS mapping properties would enable information retrieval tools to make use of a widely disseminated and heterogeneous web of Knowledge Organization Systems, causing concepts even supposedly modelled according to dissimilar principles and coming from different contexts to be automatically connected, compared and matched [17].","refs":[{"start":1045,"end":1049,"marker":"bibr","target":"#b10"}]},{"text":"According to these terms, the step of specifying the semantic relations for each concept of the two local vocabularies of Phaidra, whether they be associative, hierarchical or equivalent links, gained a remarkable weight. By way of example, at the time of a search by type of material of the digital objects stored in Phaidra, the SKOSformatted concept \"photograph\" shown below (see Fig. 9) not only would let the Phaidra search engine to suggest the user all the available materially-related resources, i.e. all the digital objects labelled as \"microfilm\" or \"negative\" (as encoded in the tag <skos:narrower>). Additionally, the accessibility and visibility of the resources existing in the preservation system of the University of Padova would be increased by the potential interlinking of their metadata with external datasets in the Web, described according to concepts relatively similar or equivalent to the aforementioned local term \"photograph\". In the snippet represented in Fig. 9 see respectively <skos:closeMatch>, referencing to the concept \"Fotografie\" in Nuovo soggettario edited by the National Central Library of Florence, and <skos:exactMatch>, linking for example to the concept \"Photographs\" in Art & Architecture Thesaurus® (AAT).","refs":[{"start":388,"end":389,"marker":"figure","target":"#fig_8"},{"start":989,"end":990,"marker":"figure","target":"#fig_8"}]}]},{"title":"Future Outcome","paragraphs":[{"text":"Despite the limited extent of this case study, it is well-known that standards as RDF, SKOS and SPARQL, key means as ontologies, controlled vocabularies and authority files, and back-end architectures such as triplestores and reasoners, are comprehensively pivotal. They all would be equally demanded for a long-term digital archive, as is Phaidra, to be migrated to the \"Web of Data\" in an actual and full manner. An unparalleled data interoperability and a serendipitous networked knowledge discovery would be the granted benefits (see Fig. 10).","refs":[{"start":543,"end":545,"marker":"figure","target":"#fig_9"}]},{"text":"But at least, this is the promising outcome, and efforts are now set on this future perspective. The whole work which has been done so far on the theoretical mapping of UWmetadata schema to MODS was undertaken by both the Universities of Padova and Vienna in the light of a broader outlook, namely the announcement of a development and implementation of a new version of Fedora web-architecture, i.e. Fedora 4, which would have stored metadata in RDF standard. Mostly on the basis of recommendations and discussions guided by an international community of institutions engaged in transitioning their MODS-based digital repository systems to RDF [22], both the working groups of Phaidra are currently involved in outlining a new foundational data model represented in RDF triples. By the potential use of an arbitrary number of external vocabularies and ontologies, along with the possibility of RDF graphs to be extended with new nodes and new relationship types effortlessly, this new semanticsembedding model would be much more flexible, extendable to every future needs as well as highly interoperable.","refs":[{"start":645,"end":649,"marker":"bibr","target":"#b15"}]},{"text":"In these terms, the forthcoming achievement of such a framework might thus exactly represent the most effective means to disclose the associative potential of metadata that was cited at the beginning of Sect. 3. ","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper illustrates the experience of the Library System of the University of Padova in reviewing the data model of Phaidra (Permanent Hosting, Archiving and Indexing of Digital Resources and Assets), the digital repository for the long-term management and preservation of digital objects in place since 2010, whose system was created and developed by the University of Vienna. In order to provide better informational representation and visualisation of data, both in terms of metadata quality and display, this re-examination consisted in a critical analysis of the foundational metadata profile of Phaidra, its mapping and conversion into the Dublin Core metadata schema (Dublin Core Metadata Element Set 1.1) and, at prototype level, into the Metadata Object Description Schema (MODS). This paper discusses the evidence of the identified solutions being guided by two core principles: on the one hand, the distinctive valorisation of the dual analogue-digital nature of the Phaidra cultural heritage object, on the other, the metadata reuse in the visual function for the graphic updating of the new web interface, which is being done in order to encourage the discovery, even serendipitously, of its content by the digital researcher. Finally, the presentation considers the development activities being carried out by the Phaidra working groups of the Universities of Padova and Vienna, focused on the semantic evolution of the concept of metadata to open data, by presenting here an unpublished example of the Simple Knowledge Organization System (SKOS) prototype and last, but not least, suggesting the definition of a new Phaidra data model.","refs":[]}]}}