{"bibliography":{"title":"Experiences and Perspectives in Management for Digital Preservation of Cultural Heritage Resources (Panel)","authors":[{"person_name":{"surname":"Agosti","first_name":"Maristella"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"agosti@dei.unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Cultural heritage resources","Digital preservation","Digital cultural heritage","Digital agenda for italy","Digitisation","Online accessibility"],"citations":{"b0":{"title":"Digital libraries","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":"The Information Retrieval Series","scope":{"volume":33,"pages":{"from_page":1,"to_page":26}}},"b1":{"title":"Commission Recommendation of 27.10.2011 on the digitisation and online accessibility of cultural material and digital preservation","authors":[],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Official Journal of the European Union L","series":null,"scope":{"volume":283,"pages":{"from_page":39,"to_page":45}}}},"sections":[{"title":"Panel Objectives","paragraphs":[{"text":"This paper reports on the panel conducted in the context of IRCDL 2012, the eighth edition of the Italian Research Conference on Digital Libraries1 . The objectives of the panel are consistent with the focus of IRCDL 2012 which is devoted to legacy and cultural heritage material, and in particular to curating the digital cultural heritage resources and making them available to a wider audience of scholars as well as general public.","refs":[{"start":146,"end":147,"marker":null,"target":"#foot_0"}]},{"text":"Digital Libraries have attracted much attention in recent years both from academics and professionals interested in envisaging and designing new tools and systems able to manage diversified collections of documents, artifacts, and data in digital form in a consistent and coherent way [1].","refs":[{"start":285,"end":288,"marker":"bibr","target":"#b0"}]},{"text":"As reported in [2]:","refs":[{"start":15,"end":18,"marker":"bibr","target":"#b1"}]},{"text":"The Digital Agenda for Europe seeks to optimise the benefits of infor- It is the time to build on the experience that has been gained in past recent years with the digital libraries initiatives to invest in systems and tools that make effective the online accessibility of cultural heritage resources. In fact, digitisation is an initial important step towards online accessibility, but it must be supplemented with methods and techniques that permit diversified representations of the contents of the digitised resources. Those diversified representations are necessary for the effective management of the resources through information management systems able to give users online access to the resources. In recent years, much experience both of digitisation of cultural heritage resources and of design and development of systems able to manage cultural heritage resources have been gained. The systems have been developed in a close relationship with the digitisation of cultural and scientific collections and efforts have been made so that traditionally different communities of specialists become better acquainted with one other. One relevant example of these efforts is Europeana 2 which can be considered a single access point to books, paintings, films, museum objects and archival records that have been digitised throughout Europe.","refs":[]},{"text":"The new challenge is to succeed in dealing with the fragmentation and specificity of past solutions and envisage new systems able to become part of the cultural exploration and the study of professionals and users of cultural heritage resources. In this way tools will be supplied that incorporate methods that can change the cultural experience of professional and general users.","refs":[]}]},{"title":"The Panelists","paragraphs":[{"text":"The reports of the speeches of the panelists are included in the following volume and they address the different facets related to the necessary differentiated methods and skills.","refs":[]},{"text":"The panelists and their representative areas are:","refs":[]},{"text":"-Dino Buzzetti, Humanities Area of the University of Bologna -semantic technologies for representation and management, -Onofrio Erriquez, Physics Area of the University of Bari -digitisation of historical document archives, and -Nicola Barbuti, Archives and Libraries Area of the University of Baripreservation of cultural heritage resources and management.","refs":[]}]},{"title":"Discussion","paragraphs":[{"text":"After the presentations of the panelists a lively discussion took place. Many conference participants contributed to the discussion of the different panel topics, including Floriana Esposito (University of Bari), Carlo Meghini (ISTI-CNR Pisa), Anna Maria Tammaro (University of Parma), Mariella Guercio (University of Rome \"La Sapienza\"), Carlo Dell'Aquila (University of Bari), Francesca Tomasi (University of Bologna), Stefano Ferilli (University of Bari), and Donato Malerba (University of Bari). An aspect that emerged from all the contributions to the discussion is the need to discuss and define a shared Digital Agenda for Italy.","refs":[]},{"text":"Acknowledgements. Sincere thanks are due to Floriana Esposito, Stefano Ferilli and Nicola Ferro for the time they spent with the author discussing the aspects related to the management of cultural heritage resources and the way to address them in the context of the panel.","refs":[]},{"text":"The author would like to thank the Panelists for accepting to participate in the panel and to write a report of their speech, thus actively contributing to laying the foundation for the definition of a new approach to dealing with digital cultural heritage resources.","refs":[]},{"text":"The work reported has been partially supported by the CULTURA project (reference: 269973) 3 , and by the PROMISE network of excellence project (reference: 258191) 4 , as part of the Seventh Framework Programme of the European Commission.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper reports on the panel objectives, on the topics addressed during the panel, and on the following discussion.","refs":[]},{"text":"A relevant conclusion that emerges from the panel is the need to discuss and define a shared Digital Agenda for Italy.","refs":[]}]}}