{"bibliography":{"title":"D4Science: an e-Infrastructure for Supporting Virtual Research Environments","authors":[{"person_name":{"surname":"Candela","first_name":"Leonardo"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"Alessandro Faedo","institution":"Consiglio Nazionale delle Ricerche Via G. Moruzzi","laboratory":null}],"email":"candela@isti.cnr.it"},{"person_name":{"surname":"Castelli","first_name":"Donatella"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"Alessandro Faedo","institution":"Consiglio Nazionale delle Ricerche Via G. Moruzzi","laboratory":null}],"email":"castelli@isti.cnr.it"},{"person_name":{"surname":"Pagano","first_name":"Pasquale"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione \"Alessandro Faedo","institution":"Consiglio Nazionale delle Ricerche Via G. Moruzzi","laboratory":null}],"email":"pagano@isti.cnr.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"The Anatomy of the Grid: Enabling Scalable Virtual Organization","authors":[{"person_name":{"surname":"Foster","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Kesselman","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Tuecke","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"The International Journal of High Performance Computing Applications","series":null,"scope":{"volume":15,"pages":{"from_page":200,"to_page":222}}},"b1":{"title":"The Physiology of the Grid: An Open Grid Services Architecture for Distributed Systems Integration","authors":[{"person_name":{"surname":"Foster","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Kesselman","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Nick","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Tuecke","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"DILIGENT: integrating Digital Library and Grid Technologies for a new Earth Observation Research Infrastructure","authors":[{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Akal","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Avancini","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Fusco","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Guidetti","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Langguth","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Manzi","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Schuldt","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Simi","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Springmann","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Voicu","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2007","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal on Digital Libraries","series":null,"scope":{"volume":7,"pages":{"from_page":59,"to_page":80}}},"b3":{"title":"Taming development complexity in serviceoriented e-infrastructures: the gcore application framework and distribution for gcube","authors":[{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Simeoni","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Simi","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Zero-In e-Infrastructure News Magazine","series":null,"scope":{"volume":1,"pages":{"from_page":19,"to_page":21}}},"b4":{"title":"An Extensible Virtual Digital Libraries Generator","authors":[{"person_name":{"surname":"Assante","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Frosini","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Lelii","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Manghi","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Manzi","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Simi","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2008","month":"09","day":"14"},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":"Lecture Notes in Computer Science","scope":{"volume":5173,"pages":{"from_page":122,"to_page":134}}},"b5":{"title":"The DELOS Digital Library Reference Model -Foundations for Digital Libraries","authors":[{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Ioannidis","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Koutrika","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Meghini","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Ross","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Soergel","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Dobreva","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Katifori","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Schuldt","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"Today research activities require collaborations among parties that are widely dispersed and autonomous. Collaborations are often cross-discipline and require innovative research environments that make available data, processing and interaction intensive workflows to produce new knowledge able to stimulate further research.","refs":[]},{"text":"To support such a demanding scenario a very promising approach is based on e-Infrastructures. By definition, an e-Infrastructure is a framework enabling secure, cost-effective and on-demand resource sharing [1] across organisation boundaries. A resource is here intended as a generic entity, physical (e.g. storage and computing resources) or digital (e.g. software, processes, data), that can be shared and interact with other resources to synergistically provide some functions serving its clients, either human or inanimate. Thus, an e-Infrastructure poses as a \"mediator\" in a market of resources having the role to accommodate the needs of resource providers and consumers. The infrastructure layer gives support to: (i) resource providers, in \"selling\" their resources through it; (ii) resource consumers, in \"buying\" and orchestrating such resources to build their applications. Further, it provides organizations with logistic and technical aids for application building, maintenance, and monitoring. A well-known instance of such an e-Infrastructure is represented by the Grid [2], where a service-based paradigm is adopted to share and reuse low-level physical resources. Application-specific e-Infrastructures are in their turn inspired by the generic e-Infrastructure framework and bring this vision into specific application domains by enriching the infrastructural resource model with specific service resources, i.e. software units that deliver functionality or content by exploiting available physical resources.","refs":[{"start":207,"end":210,"marker":"bibr","target":"#b0"},{"start":1086,"end":1089,"marker":"bibr","target":"#b1"}]},{"text":"This potentially unlimited market of resources allows a new development paradigm that becomes reality through Virtual Research Environments, i.e. integrated environments providing seamless access to resources and facilities for communication, collaboration and any kind of interaction among scientists and researchers. A Virtual Research Environment is built by aggregating the needed constituents after hiring them through the e-Infrastructure and can be considered as an organised 'view' built atop the pool of available assets, ranging from computers and servers to collections and services.","refs":[]},{"text":"This paper presents the realisation of these two very challenging approaches in the context of the D4Science EU project.  3 and DILI-GENT [3] projects have initiated towards establishing networked, grid-based, and datacentric e-Infrastructures that accelerate multidisciplinary research by overcoming barriers such as those related to heterogeneity, sustainability and scalability.","refs":[{"start":122,"end":123,"marker":null,"target":"#foot_3"},{"start":138,"end":141,"marker":"bibr","target":"#b2"}]}]},{"title":"D4Science Overview","paragraphs":[{"text":"In particular, D4Science is currently operating an infrastructure consisting of heterogeneous resources ranging from hardware resources, i.e. machines acting as computing and storage resources providers (in part borrowed from the EGEE infrastructure) or hosting environment supporting dynamic software deployment, to software resources, i.e. software packages implementing specific functions, services, i.e. running instances of software resources providing functions, and data resources, i.e. collection of compound information objects representing various kind of information.","refs":[]},{"text":"This infrastructure is currently supporting the operation of two very large and challenging scientific communities: Environmental Monitoring and Fisheries and Aquaculture Resources Management. These scientific communities are served through three virtual organizations (VOs): Environmental Monitoring VO, Fishery Country Profiles Production System VO and Integrated Capture Information System VO. These VOs are dynamic group of individuals and/or institutions defined around a set of sharing rules in which resource providers and consumers specify clearly what is shared, who is allowed to share, and the conditions under which sharing occurs to serve the needs of a specific community. These VOs consists of various resources including collection of Earth images, satellite products, species distribution maps, reports, statistical data, and tools for processing and analyzing them.","refs":[]},{"text":"The development and operation of the D4Science infrastructure is supported by the gCube software system [4]. gCube is a distributed system for the operation of largescale scientific infrastructures. It has been designed from the ground up to support the full life-cycle of modern scientific enquiry, with particular emphasis on applicationlevel requirements of information and knowledge management. To this end, it interfaces pan-European Grid middleware (gLite4 ) for shared access to high-end computational and storage resources, but complements it with a rich array of services that collate, describe, annotate, merge, transform, index, search, and present information for a variety of multidisciplinary and international communities. Services, information, and machines are infrastructural resources that communities select, share, and consume in the scope of collaborative Virtual Research Environments.","refs":[{"start":104,"end":107,"marker":"bibr","target":"#b3"},{"start":461,"end":462,"marker":null,"target":"#foot_4"}]}]},{"title":"Building and Operating Virtual Research Environments","paragraphs":[{"text":"The D4Science e-Infrastructure supports the creation and management of VREs by offering mechanisms for the VRE definition, deployment and operation [5].","refs":[{"start":148,"end":151,"marker":"bibr","target":"#b4"}]},{"text":"The definition process is organized in steps each allowing the designer to characterize different aspects of the expected VRE. These steps enable to specify the features of the expected environment and allow the D4Science enabling system to put in operation it by automatically allocating and deploying the most appropriate resources selected between the ones available in the VO. The identification of these steps and the dependences between them have been strongly influenced by the digital library model presented in the DELOS Digital Library Reference Model [6]. In particular, these steps aim at capturing VRE constituent elements belonging the Content, Functionality, Users, and Architecture dimensions. Once the specification is completed, the VRE generation logic implemented by the D4Science infrastructure analyses it and derives an optimal deployment plan aiming at maximizing existing resources usage and eventually including dynamic resource generation. The infrastructure guarantees an optimal consumption of the available resources by selecting the minimal amount of them sufficient to meet its established performance and robustness criteria. By using these mechanisms four VREs have been created serving very different application domains:","refs":[{"start":562,"end":565,"marker":"bibr","target":"#b5"}]},{"text":"Fishery Country Profiles Production System (FCPPS) supports scientists in the generation of fisheries and aquaculture reports. The production of country profiles requires complex aggregation and editing of continuously evolving multi-lingual data from a large number of heterogeneous data sources. Availability of the FCPPS VRE permits to the scientists producing them to update and web-publish these vital reports as frequently as the community requires, while also having access to additional resources when needed. Integrated Capture Information System (ICIS) supports scientists in integrating regional and global capture and distribution information of aquatic species, from a number of Regional Fishery Management Organisations and international organisations (FAO, WorldFish Center) into a common system. The VRE provides not only access to the necessary data. Rather it organises a number of services for providing an harmonised view of catch statistics and allowing the community to overlay them according to pre-defined reallocation rules. Global Ocean Chlorophyll Monitoring (GCM) offers to scientists an environment that integrates satellite data of microscopic marine plants and sea surface temperature. This environment supports research on biodiversity by facilitating process like the measuring, distribution, monitoring, and modelling of phytoplankton (microscopic marine plants), the provision of forecasts of sea state and currents, the monitoring of algal blooms and marine pollution, and the measuring of changes in the ocean productivity. Global Land Vegetation Monitoring (GVM) provides a virtual environment that integrates satellite images of vegetative land cover. It facilitates specific research on how climate changes and land cover influence environmental resources. By having access to the data and tool of this VRE scientists can determine important measures like the total green leaf area for a given ground area, how much water will be stored and released by an ecosystem, how much leaf litter it will generate, and how much photosynthesis is going on.","refs":[]},{"text":"As it should emerge from the brief description above, these four VREs offer innovative, user-tailored, and dynamically created collaboration environment even by exploiting the same enabling technology. In this environment scientists addressing a specific problems can access a number of geographically disperse cross-domain resources of different nature and operate with them as if these resources were belonging to their own organization (although in the limits imposed by the resources regulating policies).","refs":[]}]},{"title":"Concluding Remarks","paragraphs":[{"text":"e-Infrastructures that provide application services for a range of user communities cannot ignore the diversity and specificity of their requirements. In this paper, we have argued that such requirements can be conveniently met by implementing a development approach based on Virtual Research Environments and briefly presented how this approach has been put in place in the context of the D4Science project.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"e-Infrastructure is the term coined for innovative research environments that provide modern scientists with seamless access to shared, distributed and heterogeneous resources. Virtual Research Environments (VREs) are applications whose constituents are dynamically borrowed from the e-Infrastructure, bound (and deployed) instantly, just at the time and for the period they are needed. In this paper we describe D4Science, an e-Infrastructure supporting the design and deployment of VREs.","refs":[]}]}}