{"bibliography":{"title":"Engaging the User: Elaboration and Execution of Trials with a Database of Illuminated Images","authors":[{"person_name":{"surname":"Ponchia","first_name":"Chiara"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua Piazza Capitaniato","laboratory":null}],"email":"chiara.ponchia.1@studenti.unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"IPSA: A Digital Archive of Herbals to Support Scientific Research","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":2911,"pages":{"from_page":253,"to_page":264}}},"b1":{"title":"Annotating illuminated manuscripts: an effective tool for research and education","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":121,"to_page":130}}},"b2":{"title":"Methods of personalising a collection of images using linking annotations","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Mariani Canova","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Ponchia","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":10,"to_page":17}}},"b3":{"title":"To envisage and design the transition from a digital archive system developed for domain experts to one for non-domain users","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":11,"to_page":14}}},"b4":{"title":"A Task-Oriented Approach to Information Retrieval Evaluation","authors":[{"person_name":{"surname":"Hersh","first_name":"W"},"affiliations":[],"email":null},{"person_name":{"surname":"Pentecost","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"1996","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of the American Society for Information Science","series":null,"scope":{"volume":47,"pages":{"from_page":50,"to_page":56}}},"b5":{"title":"Le miniature del Libro Agregà de Serapiom nella cultura artistica del tardo Trecento","authors":[{"person_name":{"surname":"Bettini","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"1974","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":55,"to_page":60}}},"b6":{"title":"Serapion il Giovane, Liber Agregà","authors":[{"person_name":{"surname":"Mariani Canova","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"1999","month":"06","day":"27"},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":154,"to_page":157}}},"b7":{"title":"Nicolò Roccabonella. Liber de semplicibus","authors":[{"person_name":{"surname":"Marcon","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":null,"target":null,"publisher":"Ricci","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":113,"to_page":115}}},"b8":{"title":"La tradizione europea degli erbari miniati e la scuola veneta","authors":[{"person_name":{"surname":"Mariani Canova","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"1988","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":25,"to_page":26}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"IPSA (Imaginum Patavinae Scientiae Archivum) is a digital archive of illuminated manuscripts which includes both astrological and botanical codices produced mainly in the Veneto region during the 14th and 15th centuries 1 . The database was created specifically for professional researchers of History of Art and History of Illumination to allow them to compare the illuminated images held in the database and verify the development of a new scientific mentality in the 14th century at the University of Padua and a new realistic way of painting closely associated with the new scientific studies [1]. Disclosing new relationships between images is one of the main purposes of art historical research, because it brings further knowledge on a specific artistic period, on a painter or an illuminator, on a work of art, and so on. According to this specific user requirement, in IPSA professional researchers are provided with tools that allow images to be linked and annotated, thus sharing knowledge in a collaborative environment [2].","refs":[{"start":597,"end":600,"marker":"bibr","target":"#b0"},{"start":1032,"end":1035,"marker":"bibr","target":"#b1"}]},{"text":"Due to involvement in the CULTURA project 2 , it was decided to open the database to other categories of users, such as non-domain professional researchers, the student community and the general public. This new task required the identification of the needs, wishes and preferences of these categories in order to define the required changes and improvements to IPSA [3]. User requirements were elicited in different ways. Firstly, thorough interviews with professional researchers were held, both with the domain professional researchers involved in the creation of IPSA from the very beginning, and with non-domain researchers expert in the field of History of Medieval Art but not acquainted with the IPSA collection and the History of Illumination in general. All the interviews were held on an individual basis.","refs":[{"start":367,"end":370,"marker":"bibr","target":"#b2"}]},{"text":"The difficulty founded in eliciting professional researchers requirements highlighted the need to elaborate new ways to carry out user requirements elicitation, also for other user categories. For that reason, when it was decided to involve the student community, the elaboration of task-oriented trials was thought to be the best solution, as explained in Section 2. In Section 3 a description of the trials is presented, while in Section 4 can be found an overview of the first outcomes obtained.","refs":[]},{"text":"This paper focusses on the elaboration and the description of the trials; information on the design and implementation of the computer system for user access can be found in [4].","refs":[{"start":174,"end":177,"marker":"bibr","target":"#b3"}]}]},{"title":"The Design of the Trials: Preliminary Considerations","paragraphs":[{"text":"The IPSA database trials were developed specifically for two groups of students of the Faculty of Humanities of the University of Padua, Italy: The starting point for developing the trials were the outcomes reached in the first eight months of work of the CULTURA project. Most of this period was dedicated to drawing a profile and to identifying needs and wishes of the new categories of IPSA users. In this period we focussed on two user categories: professional researchers, namely established academics experienced in the general area covered by the resource, but not necessarily with the specific content of the resource, and the student community, particularly the university students. From these evaluation experiences, especially from the interviews with the professional researchers and the non-domain professional researchers, it was noted that the user should not only be presented the system and its functionalities, but also be provided with a task-oriented hands-on experience. Actually, interactions with professional researchers and non-domain professional researchers were twofold: firstly, the interviewees were shown IPSA and its functionalities, and then they were asked about their impressions and their suggestions for improvement.","refs":[]},{"text":"When it came to this point, generally the interviewees showed a certain lack of imagination, concentrating on poorly relevant details, like the font or the colour of the text. We noticed that this happened because lack of motivation in using the system may reduce the effort put into learning how to interact with it, and this inevitably affects the quality of the interaction and of the reflection on the experience. When we decided to involve the student community, we hence knew it was necessary to work out at least two tasks that would require the students to interact with the system in different ways. Actually, task-oriented experience is generally acknowledged as the best way to carry out systems evaluation because of several reasons. For instance, it allows for measuring effectiveness of systems such as how well the system enables a user to find an information needed or to answer a question, as can be seen in [5].","refs":[{"start":925,"end":928,"marker":"bibr","target":"#b4"}]},{"text":"In line with these considerations, two tasks were developed to be carried out by students in two different trials. After in-depth discussions on the issue, it was decided that the tasks needed to be:","refs":[]},{"text":"-The same for all the students involved in the trials, in order to obtain easily comparable data; -Specifically tailored to the groups of students chosen for the exercises: considering that the first group of students had just begun their University career and that the second group of students is not attending a degree in History of Art, the development of some simple tasks that would not require a thorough knowledge of History of Art and History of Illumination was preferred; -One task related to the botanical codices collection, and the other related to the astrological codices collection, in order to allow students to work with both the collections of the IPSA database.","refs":[]},{"text":"In order to obtain further feedback, after each trial the students had to answer an evaluation questionnaire developed specifically by a team of psychologists from the University of Graz. The questionnaire aimed mainly at evaluating interaction with the system and user acceptance.","refs":[]}]},{"title":"The Trials","paragraphs":[{"text":"For both trials, students were given a researcher account so they could enter the digital archive using the same tools as professional researchers. Hence they were able to set links between images and annotate them.","refs":[]}]},{"title":"First Trial","paragraphs":[{"text":"Task 1. This task is related to the botanical codices and proposes a guided comparison between the Liber Agregà de Serapion (London, British Library, ms. Egerton 2020) and the Erbario Roccabonella (Venice, Biblioteca Marciana, ms. Lat.VI.59). Liber Agregà is a remarkably important manuscript made in Padua at the end of the 14th century and commissioned by the prince of Padua, Francesco II da Carrara [6]. It shows the realistic representations of many different plants, with a short text explaining their therapeutic virtues [7]. Erbario Roccabonella is a Renaissance illuminated botanical codex written by the Medician Nicol Roccabonella in the 15th century [8]. It includes representations of hundreds of plants, some of which are also described in the Liber Agregà. Art historians understood that Roccabonella must have studied and partially copied images from the Liber Agregà because of the similarities of many images in his book with those in the Paduan manuscript [9]. The students were required to verify this relation as well as find out which plants in the Erbario Roccabonella manuscript are copied from the Liber Agregà and which are not copied from this model but from other sources. So every student was assigned a page number belonging to the Liber Agregà. They had to check which plant was painted in the assigned page, and search whether the Erbario Roccabonella had an image of the same plant. Once they had found a second image, they had to analyse the two illuminations and decide whether the plant looked the same in both images, and if this was the case, set a link between the two illuminations, specifying the kind of link between them. They could choose between the following options:","refs":[{"start":403,"end":406,"marker":"bibr","target":"#b5"},{"start":528,"end":531,"marker":"bibr","target":"#b6"},{"start":662,"end":665,"marker":"bibr","target":"#b7"},{"start":975,"end":978,"marker":"bibr","target":"#b8"}]},{"text":"-Copied in: the subject of the older image is quite faithfully re-proposed in the newer image; -Not related to: the two illuminations show subjects belonging to different iconographic traditions; -Same tradition of: the two illuminations show subjects belonging to the same iconographic tradition; this kind of relation is valid both for images markedly distant in time and for images closer in time; -Siblings: the two illuminations were copied from the same model; -Similar to: the two illuminations show some analogies, but it is not possible to further specify the kind of relation existing between them.","refs":[]},{"text":"Afterwards, students could annotate the link, specifying the reason why they had chosen that link. Clearly this is an \"art historian task\", since it requires the comparison and analysis of two different images to discover the kind of link existing between them, so it was a good exercise for the Bachelor students in History of Artistic and Musical Heritage to become acquainted with the History of Art methodology.","refs":[]},{"text":"Furthermore, this task points out one of the most valuable aspects of IPSA: the art historian is given the possibility to compare two different images and understand the relation between them simply by sitting at a computer. In the specific case of the Liber Agregà and the Erbario Roccabonella, the art historian need not travel to Venice and London to study these manuscripts. This is a great help for scholars, and perhaps not so immediately evident for young students who have no research experience: the task aims to show them the enormous potential of IPSA.","refs":[]},{"text":"Task 2. This task is related to astrological manuscripts. The objective of this task was to have the students read the catalogue files and mine information from the database. Each student was given an astrological subject, namely:","refs":[]},{"text":"representations of constellations, i.e. Ursa major (Great bear); -astrological signs, i.e. Sagittarius.","refs":[]},{"text":"They were required to do a search by the subject assigned and analyse the first or the last five images in the results list. Then they were required to put them in chronological order. In this way, not only did they have to compare images, but they also had to read the catalogue files of five different manuscripts. Once the chronological order was set, they had the possibility of following the iconographic development of the subject.","refs":[]}]},{"title":"Second Trial","paragraphs":[{"text":"Both tasks were planned to have a further development in the second trial (30 November for Group 1; 21 December for Group 2). On this occasion a short explanation of the IPSA functionalities was given before the trial in order to check whether the results changed and to what degree. Task 1. Each student was re-assigned the same illuminated page from the first trial. This was the starting point for another kind of search: students were required to find out whether there were other images of the same plant in other botanical codices of the collection. Since plant names were not precisely codified in the Middle Ages, the students had to pay attention not only to the images, but also to the name variables. For example, the plant represented in f. 14v of the Liber Agregà is called Stichados, but in other botanical manuscripts held in the IPSA database the same plant is spelled Sticados, so the student working on this subject needed to search by every name variable, and to verify whether the plant was the same by carefully analysing the illuminations found. Once the student had verified that the represented plant was the same, he had to create a link between the two illuminations as in the previous trial. Task 2. Each student was re-assigned the astrological subject of the previous trial. They had to make a search by this subject, and create links between the illuminations they found. So this time not only did they have to establish a chronological order, but they also had to analyse the kind of relation existing between all the images.","refs":[]},{"text":"In the second trial the tasks were quite similar, but they presented different kinds of difficulty:","refs":[]},{"text":"-In Task 1 the students had few manuscripts, a limited number of images, but a large number of etymological variables; -In Task 2 the students had a larger number of manuscripts and images, but the illuminations were easier to find, since they only had two name variations or none at all.","refs":[]}]},{"title":"First Outcomes","paragraphs":[{"text":"Since the analysis of the outputs of the trials is still an ongoing study, it is too early to have a comprehensive overview of the results obtained. Nonetheless, the trials seem to be a successful way of creating an useful and dynamic relation with users. In fact, in the first trial it was already possible to identify some necessary improvements that were immediately made to the database, in order to test them in the second trial. The most important improvement needed was to work out a more practical and faster way to present the illuminations to the users. For example, the Erbario Roccabonella holds hundreds of illuminations that required some minutes to be loaded. In the second trials the images were shown divided into smaller groups, and the loading was faster. This example clearly shows how the trials are bringing about a useful process of eliciting user requirements, immediately inserting changes into the database and subsequently evaluating the modifications made. The trials also prompted some preliminary considerations on how such a specialist collection is perceived by a non-specialist user. First of all, it was noted that people not used to working with images as historical documents focus their attention mainly on the text. When asked to find the images of the same plant in the Liber Agregà and in the Erbario Roccabonella, most of the students preferred to look for the images by searching with their names, rather than comparing the illuminations. This is not the best way to proceed, since in the Middle Ages names had a lot of variations, and a painted representation is normally more trustworthy. For example, the word citron means both lemon and cucumber, and some students set a link between the images of these two plants without noticing that they are far different, as can be seen comparing Figure 1 with Figure 2. This is a very important consideration, since it points out the need to develop a way to draw user attention to the illuminations, to make the user understand the real meaning and value of the IPSA collection and the way art historians work. Lastly, the trials brought about a reflection on what can be interesting for the student community. The students involved in the trials showed a particular attention to the Renaissance illuminations, probably because this is the bestknown artistic period in Italy and the most studied in high school. This points out that users are mainly interested in something they can recognize or they mainly refer to something already known. So underlining the links between the IPSA collection and the history of Padua, of the Veneto region and of the Italian History of Art could be a good way to make the database more involving for nonspecialist users. For example, underlining the connection between the botanic illuminations and the development of the scientific mentality in the University of Padua can make the database more interesting for students belonging to the same University.","refs":[{"start":1839,"end":1840,"marker":"figure","target":"#fig_0"},{"start":1853,"end":1854,"marker":"figure","target":"#fig_1"}]}]},{"title":"Conclusions","paragraphs":[{"text":"This is a very important consideration, since it points out the need to develop a way to draw user attention to the illuminations, to make the user understand the real meaning and value of the IPSA collection and the way art historians work. Lastly, the trials brought about a reflection on what can be interesting for the student community. The students involved in the trials showed a particular attention to the Renaissance illuminations, probably because this is the bestknown artistic period in Italy and the most studied in high school. This points out that users are mainly interested in something they can recognize or they mainly refer to something already known. So underlining the links between the IPSA collection and the history of Padua, of the Veneto region and of the Italian History of Art could be a good way to make the database more involving for nonspecialist users. For example, underlining the connection between the botanic illuminations and the development of the scientific mentality in the University of Padua can make the database more interesting for students belonging to the same University.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Currently one of the most important challenges for curators and providers of digital cultural heritage is to increase and enhance the engagement of users and communities with digital humanities collections. The reflections and efforts made to open up the IPSA database to new user categories is an ongoing process able to offer useful suggestions and contributions to this field of investigation. The considerations taken into account to elaborate the IPSA database trials engaging non-domain users are presented and the design of the trials is described.","refs":[]}]}}