{"bibliography":{"title":"EuropeanaLabs: An Infrastructure to Support the Development of Europeana","authors":[{"person_name":{"surname":"Aloia","first_name":"Nicola"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione","institution":"National Research Council","laboratory":null}],"email":"nicola.aloia@isti.cnr.it"},{"person_name":{"surname":"Concordia","first_name":"Cesare"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione","institution":"National Research Council","laboratory":null}],"email":"cesare.concordia@isti.cnr.it"},{"person_name":{"surname":"Meghini","first_name":"Carlo"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione","institution":"National Research Council","laboratory":null}],"email":"carlo.meghini@isti.cnr.it"},{"person_name":{"surname":"Trupiano","first_name":"Luca"},"affiliations":[{"department":"Istituto di Scienza e Tecnologie dell'Informazione","institution":"National Research Council","laboratory":null}],"email":"luca.trupiano@isti.cnr.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Europeana","Sandbox","Digital library infrastructure"],"citations":{"b0":{"title":"","authors":[{"person_name":{"surname":"Munin","first_name":null},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"http://munin-monitoring.org/","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Xymon","authors":[],"date":null,"ids":null,"target":"http://xymon.sourceforge.net/","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"nTop, nprobe","authors":[],"date":null,"ids":null,"target":"http://www.ntop.org/","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Definition of Application Landscape","authors":[],"date":{"year":"2009","month":"01","day":"21"},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b4":{"title":"Not just another portal, not just another digital library: A portrait of Europeana as an application program interface","authors":[{"person_name":{"surname":"Concordia","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Grad-Mann","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Siebinga","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IFLA Journal","series":null,"scope":{"volume":36,"pages":{"from_page":61,"to_page":69}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"In the wide public, the Europeana Digital Library is primarily perceived as a portal exposing a great amount of cultural heritage information. Even though this perception is not entirely misleading, Europeana is much more. More precisely Europeana is an open services platform enabling users and cultural institutions to provide, manage and access a very large collection of information objects representing digital and digitized content [9]. Europeana is also a set of resources and tools open to the Community for developing, creating and disseminating new information resources. The set of these instruments provides the infrastructure, called EuropeanaLabs, on which is based the development of Europeana. The EuropeanaLabs provides development environments and various tools for building and managing digital libraries. These tools range from application servers for harvesting data and metadata (eg Repox), to Customers Relationship Manager (CRM), to collaborative work environments, products management, software validation, application showcasing, etc. From the organizational point of view the Europeana DL is the result of a number of activities run by different actors located across Europe, coordinated by the Europeana Digital Library Foundation (EDLF).","refs":[{"start":438,"end":441,"marker":"bibr","target":"#b4"}]},{"text":"To define such a complex organization we can use the classical definition of Information System (IS): \"a combination of Information Technology (IT) and people's activities that support operations, management and decision making [8]\".","refs":[{"start":228,"end":231,"marker":"bibr","target":"#b3"}]},{"text":"According to this definition, the Europeana Portal is a component of the system, more specifically it is a web application using the Europeana API to provide services, in particular content discovery, to the Europeana Digital Library.","refs":[]},{"text":"This paper focuses on, the computer system that act as a backend for Euro-peanaLabs.","refs":[]}]},{"title":"2","paragraphs":[{"text":"The EuropeanaLabs","refs":[]},{"text":"As previously mentioned the Europeana DL is a collaborative work coordinated by EDLF and, up to today, the most part of the activities are carried on inside specific EU funded projects.","refs":[]},{"text":"From the organization point of view this means that the community of users working on Europeana is composed by autonomous teams, usually geographically distributed, and number and needs of the community do vary over time.","refs":[]},{"text":"We can individuated the following main features of the community of users working on Europeana:","refs":[]},{"text":"• Distribution: there are geographically distributed teams, working on separate processes, often needing a close interaction each other to execute their activities. • Heterogeneity: different teams can use different approaches for the same activity.","refs":[]},{"text":"For instance the various development teams could use different development methodologies.","refs":[]},{"text":"• Scalability: at any moment new teams can join (or retire from) the organization • Autonomy: every team must have a complete, autonomous working environment.","refs":[]},{"text":"Up to November 2012 the community working on Europeana is composed by 1660 registered users, grouped in 42 main teams and each team works on one or more Europeana related activity.","refs":[]}]},{"title":"Fig. 1. The distribution of EuropeanaLabs community by email domains","paragraphs":[{"text":"In such a scenario, the role of EDLF is crucial. It is EDLF that coordinates activities of the Europeana community, collects and validates results, publishes them in Europeana (in form of new content or as new Europeana services).","refs":[]},{"text":"The EuropeanaLabs has been designed to implement all needed tools and facilities to enable community users and EDLF to carry on their tasks.","refs":[]}]},{"title":"Fig. 2. New users registered in EuropeanaLabs every year","paragraphs":[]},{"title":"The Europeana Sandboxes","paragraphs":[{"text":"Basically the EuropeanaLabs provides computational and storage resources in form of autonomous systems called Europeana sandboxes. Generally speaking, the term sandbox, in computing, may refer to:","refs":[]},{"text":"• an isolated runtime environment used to run untrusted code (security sandbox)","refs":[]},{"text":"• a testing environment that isolates untested code changes and outright experimentation from the production environment or repository, in the context of software development including Web development and revision control (development sandbox) [1].","refs":[{"start":244,"end":247,"marker":"bibr","target":null}]},{"text":"We designed Europeana sandboxes by joining features of both categories; essentially a Europeana sandbox has the following features:","refs":[]},{"text":"• it is a complete host computer on which a conventional operating system boots and runs • it provides a controlled set of resources (main memory, storage, cpu, etc) and is accessible via the network • it can be easily migrated between different hardware servers.","refs":[]},{"text":"Every team working on one Europeana project, can ask for one or more sandboxes for tasks related to their activity; if the request is accepted, sandboxes are created and assigned to the team.","refs":[]},{"text":"Europeana sandboxes are implemented using Hardware virtualization [6]: every sandbox is a Virtual Machine (VM). This is an obvious choice, virtualization paradigm enable us to fully implement the specification defined by the project. The challenge is to define an architecture reliable, scalable and flexible enough to support the Europeana ambitious goals.","refs":[]}]},{"title":"Architectural Description","paragraphs":[{"text":"The EuropeanaLabs infrastructure has been designed, developed and is maintained by CNR-ISTI. The work started in 2008: the initial configuration comprises a small server and a backup storage.","refs":[]},{"text":"Over the years the complexity of the infrastructure has increased with the complexity of the project. It has finally conformed to a highly flexible, scalable and robust model. Among typical requirements for complex information systems (reliability, fault tolerance, etc) scalability is a major one for EuropeanaLabs: the infrastructure must be easily upgraded or remoulded to be adapted to the changing demands. The actual EuropeanaLabs model can really fulfil the current resources needs and easily meet the future ones, without requiring substantial changes. It comprises four main logical components:","refs":[]},{"text":"1. the computational component, 2. the storage component, 3. the network component, 4. the administration component.","refs":[]}]},{"title":"Fig. 3. EuropeanaLabs infrastructure components","paragraphs":[{"text":"The computational component, composed by 4 virtualization servers, is responsible of creating and running all the sandboxes and provides them with CPU and main memory. It also handles the storage space, remotely provided by the storage component, making it available to the sandboxes. Finally, it provides Internet access to the sandboxes.","refs":[]},{"text":"The network component, is composed by 2 high speed network switches. It provides LAN services and Internet connectivity to both the servers and the sandboxes. The data traffic between the virtualization servers and storage servers is done through standard protocols (AOE and iSCSI) and isolated from the Internet traffic, thus forming a storage area network (SAN). All network connections are made via a redundant structure both at the level of apparatuses that of physical links to provide fault tolerance and modularity.","refs":[]},{"text":"The storage resources, composed by 2 servers, are redundant (all disks are in RAID configurations) to provide fault tolerance. They have grown with the project both in size and technology, and moved from general-purpose operating systems to dedicated storage systems with specialized hardware with the aim of improving performance and modularity.","refs":[]},{"text":"The management and monitoring facilities, which make up the administration component, are provided by various software applications hosted on dedicated workstations. The management part makes use of standard hypervisor's tools, customized scripts and multiple servers management tools. The monitoring part uses Munin [3] to actively check all the relevant resources and services using a software agent installed on every virtualization and storage server. Another tool, Xymon [4], is used to check the status of the relevant network services of each sandbox without installing any software agent. The Internet traffic from and to the sandboxes is monitored in real time using tools like nProbe and nTop [5].","refs":[{"start":317,"end":320,"marker":"bibr","target":"#b0"},{"start":476,"end":479,"marker":"bibr","target":"#b1"},{"start":703,"end":706,"marker":"bibr","target":"#b2"}]},{"text":"As all the sandboxes can be run on every virtualization server and have disk space provided by every storage server, this kind of architecture is reliable, flexible and easily expandable: virtualization servers can be added to increase the number of sandboxes, storage servers to increase the disks size, network switches to increase the number of connection links. If needed, all the sandboxes can be moved between virtualization servers, and the resources allocated to them can be changed.","refs":[]}]},{"title":"EuropeanaLabs Software","paragraphs":[{"text":"The software used in the EuropeanaLabs infrastructure is open source. Besides from the servers operating system (Debian and OpenIndiana), the infrastructure needs hypervisoring, managing and monitoring software. \"Hypervisor or virtual machine manager (VMM) is a piece of computer software, firmware or hardware that creates and runs virtual machines\" [7]. As virtualization hypervisor Xen [2], being a widely tested and robust software, was chosen and installed on every virtualization server. The grown of the infrastructure over time and the analysis of its usage by the community has resulted in the need for a dedicated middleware to manage and monitor all its resources, which can make the infrastructure still more flexible to adapt to the users requirements. We are currently working on this.","refs":[]}]},{"title":"Conclusions and Future Works","paragraphs":[{"text":"The infrastructure, after five years of deployment, has been set up to fulfil all Europeana requirements. It currently provides enough computational, storage and communication resources to meet the needs of the project. It has the flexibility that allowed different reconfiguration to be done when needs have changed, has proved to be reliable with no data loss reported, has experienced minimal downtime without impacting the work of the Europeana community participants. However some work still has to be done in order to make the infrastructure more flexible and manageable, in particular we're currently implementing the following features:","refs":[]},{"text":"• live migration of sandboxes from any server to any other, • monitoring and management operations done by a centralized middleware which would be able to define, create, migrate and destroy virtual machines and dynamically reallocate all the physical resources.","refs":[]},{"text":"Another mayor activity being carried on by ISTI team is the design and implementation of a new and dedicated user interface for monitoring the infrastructure's resources status and usage, aggregating existing control data in a different way and paying particular attention to dependencies between sandboxes.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This document describes the Europeana Development and communication infrastructure, called EuropeanaLabs, built inside the EU projects Europeana and Europeana v. 2. The EuropeanaLabs consists of a number of servers, storages and communication devices; it is used to create Virtual Machines, called sandboxes, used by Europeana foundation communities. EuropeanaLabs provides a test environment, for applications and demos, to several cultural heritage and technology projects, most of them funded by EU, in addition it features a set of servers for cooperative work. In this paper we present the general architecture of the EuropeanaLabs infrastructure.","refs":[]}]}}