{"bibliography":{"title":"FAIR RDM (Research data Management): Italian initiatives towards EOSC implementation","authors":[{"person_name":{"surname":"Gargiulo","first_name":"Paola"},"affiliations":[],"email":"paola.gargiulo@gmail.com"},{"person_name":{"surname":"Galimberti","first_name":"Paola"},"affiliations":[{"department":null,"institution":"Università di Milano","laboratory":null}],"email":"paola.galimberti@unimi.it"},{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"Università di Parma","laboratory":null}],"email":"annamaria.tammaro@unipr.it"},{"person_name":{"surname":"Zane","first_name":"Antonella"},"affiliations":[],"email":"antonella.zane@unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Fair data","Eosc","Fair rdm initiatives italy","Research data management rdm"],"citations":{"b0":{"title":"EOSC Pillar National Initiatives GARR","authors":[{"person_name":{"surname":"Garr","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":"https://zenodo.org/record/3937318#.X8QLBC9aZN0","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"What do Italian Researchers think about Open Research Data?","authors":[{"person_name":{"surname":"Fava","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Gargiulo","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":"http://hdl.handle.net/10760/29671","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Open science and evaluation SCIRES-IT -SCIentific RESearch and Information Technology","authors":[{"person_name":{"surname":"Galimberti","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":{"DOI":"10.2423/i22394303v10Sp65","arXiv":null},"target":"http://dx.doi.org/10.2423/i22394303v10Sp65","publisher":null,"journal":null,"series":null,"scope":{"volume":10,"pages":{"from_page":65,"to_page":70}}},"b3":{"title":"La valutazione della ricerca a livello istituzionale: problemi, sfide e possibili soluzioni. Il caso dell'Italia","authors":[{"person_name":{"surname":"Galimberti","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":"http://eprints.rclis.org/20216/","publisher":null,"journal":"Rassegna italiana di valutazione","series":null,"scope":{"volume":null,"pages":{"from_page":66,"to_page":80}}},"b4":{"title":"Open Science, open research data and the role of IOSSG SCIRES-IT -SCIentific RESearch and Information Technology","authors":[{"person_name":{"surname":"Gargiulo","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":{"DOI":"10.2423/i22394303v10Sp53","arXiv":null},"target":"http://dx.doi.org/10.2423/i22394303v10Sp53","publisher":null,"journal":null,"series":null,"scope":{"volume":10,"pages":{"from_page":53,"to_page":58}}},"b5":{"title":"Knowledge infrastructures in science: data, diversity, and digital libraries","authors":[{"person_name":{"surname":"Borgman","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":{"DOI":"10.1007/s00799-015-0157-z","arXiv":null},"target":"https://escholarship.org/uc/item/32q2z1c9","publisher":null,"journal":"Int. J. Digit. Libr","series":null,"scope":{"volume":16,"pages":{"from_page":207,"to_page":227}}},"b6":{"title":"Digital Libraries for Open Science: Using a Socio-Technical Interaction Network Approach","authors":[{"person_name":{"surname":"Beamer","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-030-11226-4_10","arXiv":null},"target":"https://scholarship.claremont.edu/cgi/viewcontent.cgi?article=1071&context=library_staff","publisher":"Springer","journal":null,"series":"Communications in Computer and Information Science","scope":{"volume":988,"pages":null}},"b7":{"title":"Research assessment in the transition to Open Science","authors":[],"date":{"year":"2019","month":"02","day":"04"},"ids":null,"target":"https://eua.eu/downloads/publications/research%20assessment%20in%20the%20transition%20to%20open%20science","publisher":"European University Association","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The aim of the paper is to describe the undergoing initiatives in Italy towards EOSC implementation, to stimulate awareness among the different stakeholders and creation of services, professional figures, tools needed to the fulfillment of EOSC objectives.","refs":[]},{"text":"The paper intends to be a stepping stone and initial contribution to further reflections and studies. The European Open Science Cloud (EOSC) 1 refers to the development promoted by European Commission of an e-infrastructure facilitating Open Science and sharing and reusing academic research results. FAIR Data (Findable Accessible Interoperable Reusable) principles are a building block for the future collaborative data driven research. The development of EOSC requires technical infrastructures, policies and organizational processes putting together research domains and institutions.","refs":[{"start":141,"end":142,"marker":"bibr","target":"#b0"}]}]},{"title":"Open Science in Italy","paragraphs":[{"text":"The implementation of the European Open Science Cloud in Italy is based on the activities of GARR and CNR. GARR (which coordinates ICDI) and ICDI (Italian Computing and Data Infrastructure) have assumed responsibility for the technological infrastructure. Within ICDI, CNR ISTI leads the activities to achieve awareness and training through the organization of Workshops and courses, shortly will launch a national Competence Centre on research data management. GARR as coordinator of the EOSC-Pillar Project (2020) has conducted the 'National Initiatives' survey among universities, funding bodies, research infrastructures and e-infrastructures in five EOSC-Pillar countries, Austria, Belgium, France, Germany, and Italy. Italy is lagging behind to organize the research data infrastructure towards EOSC implementation and in a recently published report GARR [1] writes:","refs":[]},{"text":"\"Italy is the country where social regulations concerning RDM are least common, with less than a fifth of the universities that have adopted them (17%) against a mean across countries of 28% [..","refs":[]}]},{"title":"..] A similar situation can be observed for written regulations or policies on the long-term availability of research data [….] which again are less frequently found in Italy (11% against a mean across countries of 21%)\"","paragraphs":[{"text":"Written regulations and policies are limited. The legislative framework includes the law n. 112 of 7 October 2013 about access and valorization of cultural assets encompassing Open Access to research publications, but not to Open Data. A new provision \"Open access to scientific information\" is under discussion in the Senate2 but the last discussion was in November 2019. Social regulations show strengths and weaknesses. Adoption of institutional policies contemplating the deposit and open access of digital copies of research products to institutional repositories is widespread thanks to integration with the institutional CRIS (Current Research Information System). Open access, after a long start-up phase and many transformations, entered the negotiations overwhelmingly: in recent years in Italy the interest in the green road has prevailed and therefore during the negotiations the essential objective was to reach satisfactory conditions for the deposit of papers in open access to the institutional repositories. With reference to Open Access to publications, the CRUI Open Access / Open Science Committee has completed its mandate and now has been replaced by the Osservatorio per la Scienza Aperta (Open Science Monitoring Group). Today the situation is much more complex and the gold road has taken hold alongside the green road, in all its wide facets, such as Plan S 4 and Transformative agreements. The CRUI-CARE 5 Committee has been introducing the subject for some time in all its multi-year agreements, negotiating ad hoc clauses where possible, in the forms that have been and will be possible from time to time.","refs":[{"start":325,"end":326,"marker":null,"target":"#foot_0"},{"start":1384,"end":1385,"marker":"bibr","target":"#b3"},{"start":1431,"end":1432,"marker":"bibr","target":"#b4"}]}]},{"title":"Concerning Open","paragraphs":[{"text":"Regarding Open Research Data the situation is still fragmented and, above all, coordination is lacking. In the Re3data.org registry only about 30 Italian research data repositories are listed. A data culture is still lacking among researchers, the EU project OpenAIRE (Open Access Infrastructure for Research in Europe) 6 has contributed to promote an open culture and practice among the Horizon 2020 research project recipients in Italy, but more work is needed. Within the framework of OpenAIRE, Fava and Gargiulo [2]conducted a survey to find out what Italian researchers and all the people involved with research in universities and research centres were doing with reference to research data archiving, management and access policies. Their conclusions are:","refs":[{"start":320,"end":321,"marker":"bibr","target":"#b5"}]}]},{"title":"\"It seems clear that more information about open access to data and publication needs to be delivered among the research community. More emphasis should be given to data as products suitable for National research assessment exercises, which currently consider publications only for evaluation\".","paragraphs":[{"text":"Galimberti [3,4] stresses that the current research evaluation process is based on impact measures linked to commercial publishers and therefore an obstacle to the opening of data and publications. She also adds that in a situation in which quantitative indicators occupy the agendas of researchers and these indicators are firmly in the hands of a few monopolists, it is difficult to talk about cultural change just as it is difficult develop criteria and evaluation procedures in which openness finds a role at a local level.","refs":[]},{"text":"As a result of this context, FAIR RDM initiatives in Italy are still based on communities of practice that voluntarily carry out national awareness and training activities. The objective of the research was to investigate the current situation of FAIR RDM initiatives by asking these communities of volunteers.","refs":[]},{"text":"IOSSG 7 Italian Open Science Support Group is a community of professionals with multidisciplinary skills sharing their experience towards the implementation of EOSC in Italy. IOSSG was founded in 2016 with the aim of promoting the development of EOSC and has been indicated by the European Commission as a member of the Coalition of doers in EOSC. IOSSG has produced many tools such as: a policy model on research data management, a research data management plan checklist, a study for the creation of a single, visible access point within a research performing organization (Single Point of Entry), contribution to the Italian translation of the Open Science Training Handbook produced by the EU funded project FOSTER [5].","refs":[{"start":6,"end":7,"marker":"bibr","target":"#b6"}]}]},{"title":"Methodology","paragraphs":[]},{"title":"Aims and objectives","paragraphs":[{"text":"Far from making a complete list of FAIR RDM initiatives in Italy, the authors tried of investigating the perception of IOSSG members and two key informants. The objective pursued was to highlight the good practices implemented by the Open Science initiatives in Italy, together with the challenges and the strategic vision to be sought. Research questions include:","refs":[]},{"text":"• What is the vision of Open Science in Italy?","refs":[]},{"text":"• What are the drivers and elements of success?","refs":[]},{"text":"• What are the challenges?","refs":[]},{"text":"2. Social Organization: support services, organization of disciplinary communities, and perception of the actors involved; 3. Technological: state of the infrastructures and their implementation.","refs":[]}]},{"title":"FAIR RDM Initiatives in Italy: findings","paragraphs":[{"text":"The questionnaire was sent to 11 members of IOSSG and five responded (45%).","refs":[]}]},{"title":"State of the art","paragraphs":[{"text":"The support services offered to researchers focus mainly on a Data Management Plan which represents the service available in all the respondent institutions (23,5%). Secondly, the support services are involved in the management of institutional repositories (17,65). Other efforts are focused on institutional policies (17,6%).","refs":[]},{"text":"Other services that are made available concern research data organization including research data management and selection (11,8%).","refs":[]},{"text":"The majority of respondents dedicate most of their time to training researchers (11,8%).","refs":[]},{"text":"Less attention is given to data catalogs (5,9%) and no efforts has been evidenced for business plan and sustainability issues.","refs":[]}]},{"title":"Drivers","paragraphs":[{"text":"The construction of a community is the first action to build a socio-technological system. This was essentially built in the Italian initiatives in two ways: 1) by promoting information in the various administrative and research departments, 2) by changing the workflow to implement participatory collaboration.","refs":[]},{"text":"There are different practices to engage the community. Some respondents reported the tools they used to improve communication such as:","refs":[]},{"text":"Community communication and awareness activities: videos, infoday, workshops, web pages.","refs":[]}]},{"title":"We made many presentations and started with a pilot project on research data management involving PhD students of the 36th cycle (10 PhD students who will produce a DMP for their research project) I have created a community by organizing two types of events: short introductory generic events to attract the attention of the public, and specific courses on OS. Each event has almost always been dedicated to a single category of stakeholders: librarians / research support staff, researchers, etc.","paragraphs":[{"text":"A very innovative and participatory approach of all actors has been called \"Single Point of Entry\". This approach has created a good practice with a virtuous workflow that integrates different skills. One respondent briefly describes how the participatory procedure was implemented:","refs":[]},{"text":"Mapping of process activities, formal involvement of various technical and administrative areas that intervene in various capacities in the process through service protocols, sharing of objectives.","refs":[]}]},{"title":"Training","paragraphs":[{"text":"Another element of success is linked to training and orientation activities. The purpose of training is to provide and share the skills to manage the research data management cycle with different responsibilities. In addition to this, training leads to creating communities, and contributes to raising awareness on the importance of changing current data management. Respondents affirm:","refs":[]}]},{"title":"Training interventions addressed to both the technical staff and the education of researcher. I am dedicating myself to OS courses devoted to a specific domain (Earth and environmental sciences, Health sector, etc.), organized in collaboration with the Research Infrastructures in each specific field , in order to give participants tools and detailed information.","paragraphs":[{"text":"Training researcher and staff is therefore a very important activity. The most common topics of the courses are:","refs":[]}]},{"title":"Intellectual property and privacy.","paragraphs":[{"text":"There is also a need to update the skills of data librarians (or data stewards) which requires new skills beyond the traditional ones. One respondent for example says:","refs":[]}]},{"title":"I attended the Erasmus Staff Program at the University of Vienna (2) courses held by LERU on the LEARN project, online courses (University of Delft) in the Epigeum course on Research integrity.","paragraphs":[]},{"title":"3.4","paragraphs":[]},{"title":"Challenges","paragraphs":[{"text":"The challenges can be divided into obstacles of various types that must be removed and cultural barriers that are partly more difficult to overcome. In the first category of obstacles we find legal and ethical problems perceived by different domains:","refs":[]}]},{"title":"Difficulties are related to different disciplinary domains:","paragraphs":[{"text":"• in the humanities and social sciences, difficulty in recognizing the nature of one's data and lack of logical-formal skills and technical knowledge for their FAIR data management;","refs":[]},{"text":"• in the technological -engineering field, reluctance to share in the short term for possible industrial applications;","refs":[]},{"text":"• in the biomedical field, uncertainties prevail regarding the ethical aspects and the protection of personal data, particular uncertainties regarding the technological procedural measures to be adopted in compliance with regulations in the phase of active data management (secure infrastructures); problems of protection of personal data also concern data in social sciences both in the phase of active management and in long-term storage and sharing.","refs":[]},{"text":"Other obstacles are evidenced in the quality evaluation process related to impact metrics, such as:","refs":[]},{"text":"The main real obstacle remains the research evaluation system.","refs":[]}]},{"title":"In the second category of cultural barriers we find the difficulty in changing ways of working relations and research behaviors:","paragraphs":[{"text":"There is distrust on the part of those who produce data and little political sensitivity It is difficult to get in touch with management, to reach out to this type of stakeholder (policy makers) I organize dedicated meetings of about one or two hours. The cultural barriers encountered are almost all based on preconceptions that are easily debunked during the meeting.","refs":[]}]},{"title":"Vision, mission, strategy","paragraphs":[{"text":"EOSC's vision of opening the research cycle and facilitating the collaboration of researchers will certainly lead to better quality science and in theory it is easy to share. However, its realization must be made possible through policies at national and institutional level. The obstacles to research change lie in the lack of time coordination in the different initiatives carried out at different levels. Concerning this issue, some of the respondents would prefer a more leading role of the Ministry of Research. For example respondents say:","refs":[]},{"text":"Producing guidelines with minimum data management requirements that all research institutions should follow.","refs":[]}]},{"title":"Activating a governmental policy mandatory for all public institutions","paragraphs":[{"text":"Creating a Competence Centre for training and support. This initiative is currently in the process of being defined in ICDI.","refs":[]},{"text":"Other respondents see a scenario with different but synergistic responsibilities:","refs":[]},{"text":"As it has already been said several times, it is necessary to operate on 3 levels: 1) strategic, under the patronage of the ministry and with the support of policies and the engagement of universities governance to outline and clarify the various levels of political and infrastructural actions and services in relation to European policies and infrastructures; 2) national technical infrastructure: levels and rules of participation, role of GARR and the various European networks federated to EOSC, are to be clearly defined 3) development of services and training of support staff at local level. There have already been initiatives in this respect, but the circle is not full yet, GARR distributed a questionnaire, the results were discussed in a European workshop, it is necessary to reactivate the Italian debate. Covid-19 has been an obstacle but perhaps an online event rather than in person is now easier to organize.","refs":[]},{"text":"The two key informants helped to clarify the strategic development perspectives of EOSC in Italy.","refs":[]},{"text":"Giglia's vision is the one outlined in the National Open Science Plan draft requested by the former head of the Research Department at MIUR (now MUR), prof. Valditara: \"We had drawn up the National Open Science Plan with a group of 12 experts (for IOSSG Paola Gargiulo), it was to be made public in October 2019 then the government fell and therefore it was never released. MUR  • Sharing experiences in the effort to define competencies, skills, functions, and training curricula,","refs":[]},{"text":"• Building consensus at the local and national level to raise awareness of department heads, rectors, young researchers, and all stakeholders to include these skills in academic curricula,","refs":[]},{"text":"• Creating functions and services locally.\"","refs":[]}]},{"title":"Conclusion","paragraphs":[{"text":"There is a need of creating a socio-technical infrastructure in order to improve FAIR RDM in Italy. We would like to conclude our paper posing some questions and giving tentative answers. We hope these issues and challenges will be taken up by the stakeholders and receive the attention and the commitment they deserve in the upcoming future:","refs":[]}]},{"title":"What is the vision for Open Science in Italy?","paragraphs":[{"text":"To implement EOSC in Italy, MUR investments and policies are needed to support the initiatives and services launched by the forerunner institutions. We also need trained data stewards as competent professionals.","refs":[]}]},{"title":"What are the drivers and elements of success?","paragraphs":[{"text":"A push to launch many FAIR RDM initiatives in Italy originated from the need to provide a support service to researchers who had obtained funding for Horizon 2020 and were required to write a Data Management Plan. A first successful element is initiating collaboration and active participation within institutions such as the Single Point of Entry initiative. A second element of success is training and orientation activities to empower the communities of interest.","refs":[]}]},{"title":"What are the challenges?","paragraphs":[{"text":"The first obstacles highlighted concern research evaluation as it is currently carried out. European University Association [8] study could guide the new evaluation process which is needed. Other obstacles concern research behaviors in different disciplinary domains that do not change mainly due to lack of awareness of FAIR RDM.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"EOSC's vision of opening the research cycle and facilitating the collaboration of researchers will certainly lead to better quality science and in theory it is easy to share. However, its realization must be made possible through policies at national and institutional level. There is a need of creating a socio-technical infrastructure in order to improve FAIR RDM in Italy. FAIR RDM initiatives in Italy are still based on communities of practice that voluntarily carry out national awareness and training activities. The authors have investigated the perception of some leaders of FAIR RDM initiatives in Italy with respect to good practices, challenges and the strategic vision that should be sought. Findings evidence that to implement EOSC in Italy, investments and policies are needed to support the initiatives and services launched by the forerunner institutions. There is also the need of trained data stewards as competent professionals.","refs":[]}]}}