{"bibliography":{"title":"Historical Digital Archive and Geo-referenced Contents of the Francigena Librari Web Portal","authors":[{"person_name":{"surname":"Martinoli","first_name":"Adriana"},"affiliations":[{"department":"General Direction for Libraries","institution":"Cultural Institutes and Copyright Ministry for Cultural Heritage and Activities","laboratory":null}],"email":"adriana.martinoli@beniculturali.it"},{"person_name":{"surname":"Esposito","first_name":"Alfredo"},"affiliations":[{"department":"General Direction for Libraries","institution":"Cultural Institutes and Copyright Ministry for Cultural Heritage and Activities","laboratory":null}],"email":"alfredo.esposito-01@beniculturali.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Historical itinerary","Religious itinerary","Cultural itinerary","Valorization","Francigena route","Indexing","Digitization","Libraries","Metadata","Gps tracks"],"citations":{"b0":{"title":"Via Francigena Portal","authors":[],"date":null,"ids":null,"target":"http://www.francigena.beniculturali.it","publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"Administrative Metadata Management","authors":[],"date":null,"ids":null,"target":"http://www.iccu.sbn.it/opencms/opencms/it/main/standard/metadati/pagina_267.html","publisher":null,"journal":null,"series":null,"scope":null},"b2":{"title":"Dublin Core Metadata","authors":[],"date":null,"ids":null,"target":"http://dublincore.org/","publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"","authors":[],"date":null,"ids":null,"target":"http://thes.bncf.firenze.sbn.it/","publisher":null,"journal":"Thesaurus","series":null,"scope":null},"b4":{"title":"Promotion of the historical, cultural and religious routes, and the help of information technology","authors":[{"person_name":{"surname":"Fallace","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Via Francigena, the Magazine of the Major Cultural Route of the Council of Europe","series":null,"scope":{"volume":28,"pages":{"from_page":7,"to_page":9}}},"b5":{"title":"Minutes of the meeting of the scientific committee of the national Council of the historical, cultural and religious route, held on 31 March 2009","authors":[{"person_name":{"surname":"Giannetto","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2009","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Via Francigena, the Magazine of the Major Cultural Route of the Council of Europe","series":null,"scope":{"volume":29,"pages":{"from_page":6,"to_page":13}}},"b6":{"title":"Agreement for the promotion of cultural routes (in conformity with legislative decree no. 42. art 112 of 22","authors":[{"person_name":{"surname":"Bonito","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2004","month":"01","day":null},"ids":null,"target":null,"publisher":null,"journal":"Via Francigena, the Magazine of the Major Cultural Route of the Council of Europe","series":null,"scope":{"volume":31,"pages":{"from_page":17,"to_page":26}}},"b7":{"title":"The Via Francigena in the framework of the European cultural routes: The web Portal of the Direction General for Libraries, Cultural Institute and Copyright. In: Via Francigena","authors":[{"person_name":{"surname":"Bonito","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Martinoli","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"the Magazine of the Major Cultural Route of the Council of Europe","series":null,"scope":{"volume":33,"pages":{"from_page":18,"to_page":21}}},"b8":{"title":"The multimedia historical archives of the \"Francigena Librari\" web Portal. In: Via Francigena","authors":[{"person_name":{"surname":"Esposito","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Martinoli","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"the Magazine of the Major Cultural Route of the Council of Europe","series":null,"scope":{"volume":34,"pages":{"from_page":13,"to_page":15}}},"b9":{"title":"BAICR consorzio cultura","authors":[],"date":null,"ids":null,"target":"http://www.baicr.it","publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"Handbook on virtual exhibitions and virtual performances","authors":[],"date":null,"ids":null,"target":"http://www.indicate-project.org/getFile.php?id=412","publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"The Via Francigena in the National Policy of the Italian Ministry for Cultural Heritage and Activities. In: 7th Final Workshop Per Viam Project -Pilgrim's Routes in Action Via Francigena and the Pilgrimage Ways","authors":[{"person_name":{"surname":"Bonito","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Handbook for quality in cultural Web sites: improving quality for citizens","authors":[],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Project Minerva","series":null,"scope":{"volume":null,"pages":{"from_page":15,"to_page":15}}},"b13":{"title":"","authors":[],"date":null,"ids":null,"target":"http://www.inera.it","publisher":null,"journal":"Inera s.r.l","series":null,"scope":null},"b14":{"title":"Liferay Portal","authors":[],"date":null,"ids":null,"target":"http://www.liferay.com/home","publisher":null,"journal":null,"series":null,"scope":null},"b15":{"title":"PostgreSQL","authors":[],"date":null,"ids":null,"target":"http://www.postgresql.org/","publisher":null,"journal":null,"series":null,"scope":null},"b16":{"title":"Apache Solr","authors":[],"date":null,"ids":null,"target":"http://lucene.apache.org/solr/","publisher":null,"journal":null,"series":null,"scope":null},"b17":{"title":"Fedora Database","authors":[],"date":null,"ids":null,"target":"www.europeana.eu","publisher":"World Digital Library","journal":null,"series":"Istituto Centrale per il Catalogo Unico delle Biblioteche Italiane -ICCU,","scope":null}},"sections":[{"title":"Digital Historical Archive","paragraphs":[{"text":"It represents the core of the Portal which includes data of documents and books preserved in libraries, archives and cultural Institutes. Data are organized in a logical and user-friendly way.","refs":[]},{"text":"The browse page displays the following available searches: free search, advanced search, thematic areas, type of item, Institutions.","refs":[]},{"text":"The advanced search allows refining by several approaches: a) names that includes people, institutions, congress, title. It appears the number of digital documents associated and then it is possible to narrow the set of results; b) topics; c) Place; d) Time.","refs":[]},{"text":"The project implementation process involved different research and work stages for the selection of documents:","refs":[]},{"text":"• Data analysis, collection and selection (bibliographic, archival, audiovisual and iconographic materials) equipped with standard descriptions [2-4], ;","refs":[]},{"text":"• Description of the document/object aimed to the creation of Metadata necessary to the digitization process and to the web search of integrated information with other areas of the portal as well;","refs":[]},{"text":"• Creation of rules for the automatic caption generation; • Editing of captions and abstracts; • Management of controlled and structured vocabulary for thematic indexing [5].","refs":[{"start":170,"end":173,"marker":"bibr","target":"#b3"}]},{"text":"The Portal hosts a selection of cultural and touristic contents chosen in collaboration with the following libraries which the digitization of historical material has covered 40,140 images: The back-office management of digital documents includes several steps: managing the editorial processing of digital content by assigning index entries referencing to the controlled vocabulary; Multilingual generating captions for viewing summary of digital documents; Referencing digital contents through geographical approach; Screen access to the controlled vocabulary; Browsing the controlled vocabulary management Tree to add terms and items.","refs":[]},{"text":"The front-end page result of the digital document shows content information acquired [6-7-8-9-10].","refs":[]}]},{"title":"Itinerary and Walkway","paragraphs":[{"text":"This section includes data collection and mapping development of the pedestrian path along the Francigena Route through the use of the download official guide that shows all the information about road book of the route, maps and GPS tracks.","refs":[]},{"text":"The official walkway was born through these procedures:","refs":[]},{"text":"• Collection of data mapping and development of the pedestrian path along the Francigena Route [11]. • Implementation of the official guide download that lists all the path information, Different or alternative paths are evaluated by a \"Procedure for the assessment of changes to the pedestrian Francigena Way\", whose objective is to define the mode of assessment and \"certification\" of the changes to the pedestrian path of the Francigena Way. Through the \"Stages\" you can find travel guides already divided into small steps of 20-25 km that the tourist can download (road book). There are also GPS tracks to download on their device in order to have the path that is already configured in your device.","refs":[{"start":95,"end":99,"marker":"bibr","target":"#b9"}]},{"text":"The macro area \"Along the Francigena Way\" dedicated to cultural and tourist trails consists of:","refs":[]},{"text":"• news, events, information, cultural tours and tourist exhibitions [12] editing and editorial content, united being multilingual and fully geo-referenced, queried and integrated • the function \"Create your itinerary\" (definisci il tuo percorso) gives the user the possibility to define your own itinerary and then to create and print a practical guide containing all information about tourist and cultural attractions, digital documents, cultural events and cultural places (libraries, archives and Cultural Institutes).","refs":[{"start":68,"end":72,"marker":"bibr","target":"#b10"}]},{"text":"The Portal shares web 2.0 functionality and potentialities. The Facebook profile is open to promote and communicate the initiative in this popular social network. Tagging functionalities is available to create your own path.","refs":[]},{"text":"Moreover concerning the development of the web 2.0 we are confident to enlarged the functionalities considering the valuation and the propriety of the information to insert in the web-page portal [13].","refs":[{"start":196,"end":200,"marker":"bibr","target":"#b11"}]}]},{"title":"Technological Framework","paragraphs":[{"text":"This section shows an overall view of the technological architecture and describes the used software, the RDBMS and the communication protocol employed between different modules of the Francigena system. The technological platform uses open source software. The Via Francigena Portal, [14] was developed by computer company Engineering Ingegneria Informatica [15] and managed, in the last time, by computer company Inera s.r.l. [16].","refs":[{"start":285,"end":289,"marker":"bibr","target":"#b12"},{"start":428,"end":432,"marker":"bibr","target":"#b13"}]},{"text":"The main component of the Portal Architecture is Liferay Enterprise Portal [17] that is employed as portlet container and as CMS of the whole system. Liferay works with a Search Engine SOLR for browsing and indexing the contents. It is also used to access the Digital Library and to make metadata and digital items available. The protocol is used to share Digital Library data through calls and responses web services (SOAP over HTTP).","refs":[{"start":75,"end":79,"marker":"bibr","target":"#b14"}]},{"text":"Calls and responses of the web services (SOAP over HTTP) allows the sharing of Digital Library data.","refs":[]},{"text":"Fig. 1 describes the Francigena system with its different subsets and their main interactions. This framework allows a great modular scalable through the use of standard protocols.","refs":[{"start":5,"end":6,"marker":"figure","target":"#fig_1"}]},{"text":"Digital Archives: provide a secure storage of information, metadata, items and digital contents. It is realized with the object-relational database management system (ORDBMS) PostgreSQL [18]. Enterprise Search Engine (SOLR) [19]: indexes all the metadata of digital content in the Archive Digital and the editorial content managed by the portal. The index then allows you to perform full-text searches on the various fields of metadata and editorial content in the system. The interaction is done through requests encoded in XML format over HTTP protocol. [20]: it implements the functionality of the digital library which allow the administration and use of digital content and metadata. The description of the objects of the entire Fedora is based on the use of Administrative Metadata Management (MAG) to describe documents and reports and their relation. The Metadata are sent to the search engine for indexing when the medadata are inserting or editing or deleting. To do this it uses the form gSearch that translates and sends it to the indexing engine JMS messages generated by the management functions of the persistence of digital objects metadata. The DL exposes an OAI-PMH service provider that enables the system to the sharing of digital content and metadata with other repositories of digital content.","refs":[{"start":186,"end":190,"marker":"bibr","target":"#b15"},{"start":224,"end":228,"marker":"bibr","target":"#b16"},{"start":556,"end":560,"marker":"bibr","target":"#b17"}]}]},{"title":"Fedora-Commons (Digital Library -DL)","paragraphs":[]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The General Direction for Libraries, Cultural Institutes and Copyright is promoting a project on the \"Historical, cultural and religious itineraries valorization\" and is achieving an institutional Portal dedicated to Italian Francigena track to create an unified gateway access for cultural and touristic contents concerning the Francigena route. The aim of the Portal is to offer news, events, cultural itineraries, interactive maps, virtual exhibitions, information, documents and images that represent the historical, cultural and religious heritage along one of the most important European pilgrimage routes, catalogued with innovative tools for managing taxonomies which allow advanced searches and geographical access to wide information. User may organize, in \"Create your itinerary\", his virtual or real journey sharing contents on the Francigena in the \"community\".","refs":[]}]}}