{"bibliography":{"title":"0 Years of IRCDL: 2005-2014 (Invited Paper )","authors":[{"person_name":{"surname":"Agosti","first_name":"Maristella"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"maristella.agosti@unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-41938-1","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Italian research conference on digital libraries","Digital archives systems","Ircdl","Digital humanities","Digital libraries systems","Digital libraries","Interoperable systems"],"citations":{"b0":{"title":"Pushing the Boundaries of the Digital Libraries Field -10th Italian Research Conference on Digital Libraries: Preface IRCDL","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"Elsevier","journal":null,"series":"Procedia Computer Science","scope":{"volume":38,"pages":null}},"b1":{"title":"Digital library interoperability at high level of abstraction","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":"http://www.sciencedirect.com/science/article/pii/S0167739X15003003","publisher":null,"journal":"Future Gener. Comput. Syst","series":null,"scope":{"volume":55,"pages":{"from_page":129,"to_page":146}}},"b2":{"title":"Future trends in digital libraries and scientific communications","authors":[{"person_name":{"surname":"Appleton","first_name":"G"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b3":{"title":"Pushing the Boundaries of the Digital Libraries Field -10th Italian Research Conference on Digital Libraries, IRCDL","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"Elsevier","journal":null,"series":"Procedia Computer Science","scope":{"volume":38,"pages":{"from_page":18,"to_page":21}}},"b4":{"title":"A content based approach to social network analysis: a case study on research communities","authors":[{"person_name":{"surname":"De Nart","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Degl'innocenti","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Basaldella","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Tasso","first_name":"C"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"IRCDL 2015","authors":[],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-319-41938-1","arXiv":null},"target":null,"publisher":"Springer International Publishing","journal":null,"series":null,"scope":{"volume":612,"pages":null}},"b6":{"title":"The future of digital scholarship","authors":[{"person_name":{"surname":"Thanos","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":"Elsevier","journal":null,"series":"Procedia Computer Science","scope":{"volume":38,"pages":{"from_page":22,"to_page":27}}}},"sections":[{"title":"The Initiative","paragraphs":[{"text":"The \"Italian Research Conference on Digital Libraries (IRCDL)\" series of conferences was originally conceived and organized in the context of the activities of DELOS, the Network of Excellence on Digital Libraries, partially funded by the European Union under the Sixth Framework Programme from 2004 to 2007 1 .","refs":[{"start":308,"end":309,"marker":null,"target":"#foot_0"}]},{"text":"The first IRCDL conference took place in 2005, as an opportunity for Italian researchers to present recent results on their research activities related to the wide world of Digital Libraries. In particular, young researchers were (and still are) invited to submit the results of their ongoing research, which were presented in a friendly and relaxed atmosphere to facilitate constructive discussion and exchange of opinions.","refs":[]},{"text":"Much of the credit for the IRCDL series of conferences still being very active today goes to DELOS. As a matter of fact, DELOS started its activities many years ago as a working group under the ESPRIT Programme, then continued as a Thematic Network under the 5th Framework Programme and after that went on as a Network of Excellence under the 6th Framework Programme. It is generally recognized that during these years DELOS has made a substantial contribution to the establishment in Europe of a research community on Digital Libraries. At the end of 2007 the funding of the DELOS Network of Excellence came to an end. In order to keep the DELOS spirit alive, a DELOS Association was established as a not-for-profit organization, with the main aim of continuing the DELOS as much as possible activities by promoting research activities in the field of digital libraries. After some years the DELOS Association completed its scope, but the annual meetings have continued thanks to the Department of Information Engineering of the University of Padua and the other institutions that have hosted and supported IRCDL over the following years.","refs":[]},{"text":"So IRCDL has become a self sustainable yearly meeting point for Italian researchers on digital libraries and related topics that is supported by the national community of researchers on digital libraries. Information on the several editions of the IRCDL series are available in a dedicated web page that also contains the references to the websites of all editions2 .","refs":[{"start":364,"end":365,"marker":null,"target":"#foot_2"}]},{"text":"The Italian community that meets annually at IRCDL is an active community that contributes to the achievement of European and international projects, and through its results can inform on what is happening in general in this area and give some guidance on what the new challenges and the boundaries of the area will be. One of the main focuses of IRCDL is emphasizing the multidisciplinary nature of the research on digital libraries which not only goes from computer science to humanities but also spans several areas in the same field, ranging, for example, from archival to librarian sciences or from information management systems to new knowledge environments. This is a continued challenge for the digital libraries field and there is the need to continue contributing towards the improvement of cooperation between the many communities that share common objectives.","refs":[]}]},{"title":"The Organization","paragraphs":[{"text":"The organization that takes care of IRCDL is a \"Steering Committee\" of senior researchers of Italian research and university institutions where the innovative activities on topics related to the digital libraries area at large have been addressed for years in the context of renowned projects. At present the institutions represented in the steering committee are: The Steering Committee oversees the initiative on a voluntary basis and manages the general course of its operations, identifying each year an institute willing to organize the annual event.","refs":[]},{"text":"The institution that takes care of the organization of the annual conference identifies the general and program chair(s) that set up a program committee of take care of all the entire process of peer review of the submitted papers, the preparation of the program and the organization of the effective event itself.","refs":[]},{"text":"A volume of post-proceedings has been published each year. The volume contains the reports on the invited presentations and the accepted papers. The accepted papers are initially reviewed for presentation at the conference, and after the presentation the papers are resubmitted by the authors in a revised version that includes the suggestions received during the presentation at the conference. The resubmitted versions of the papers are peer reviewed by anonymous reviewers and the post-review accepted papers are revised by the authors taking into considerations the reviewers' suggestions for inclusion in the volume. From 2005 to 2009 the post-proceedings were published by Italian publishers, from 2010 to 2013 the post-proceedings were published in the \"Communications in Computer and Information Science (CCIS)\" series of Springer International Publishing AG, whereas the 2014 post-proceedings were published by Elsevier in the \"Procedia Computer Science\" series and are available as Open Access.","refs":[]},{"text":"Information on the conference editions and the post-proceedings are also available under the name of \"Italian Research Conference on Digital Library Management Systems\" in the DBLP computer science bibliography, the world's most comprehensive open bibliographic data service in computer science 3 .","refs":[{"start":295,"end":296,"marker":null,"target":"#foot_3"}]},{"text":"An analysis of the papers of the first ten editions of the conference has been conducted by the researchers of the Artificial Intelligence Lab of the Department of Mathematics and Computer Science of the University of Udine. This analysis gives an account of the authors network, the most commonly presented concepts, and the network of concepts, as well as a chronological analysis of the topics of all the papers collected in the volumes of the first ten editions of IRCDL; the analysis is reported in [4].","refs":[{"start":504,"end":507,"marker":"bibr","target":"#b4"}]},{"text":"It is also worth recalling that in 2010 the IRCDL steering committee promoted the launch of the \"Italian Information Retrieval (IIR) Workshop\" series, that started in 2010 with its first edition which was supported by IRCDL and organized in Padua side by side with the 2010 edition of IRCDL.","refs":[]}]},{"title":"The Logo","paragraphs":[{"text":"Starting with the first edition of the conference series a logo for the conference was designed and used for the web site and for all publicity material. This logo is shown in Fig. 1. The logo is a collection of colored pencils. This choice is based on the fact that the researchers, regardless of the specific theme of interest of their research and in addition to working with a strictly scientific approach, also need to address their research topic of interest with \"color\" and imagination.","refs":[{"start":181,"end":182,"marker":"figure","target":"#fig_1"}]}]},{"title":"Final Considerations and the Future","paragraphs":[{"text":"In the first ten years the topics addressed by IRCDL have been mostly concerned with the representation and management of the various information resources that are of interest to diversified cultural heritage institutions -such as libraries, archives and museums both of general and specialized type -to build effective integrated collections of digital resources and to design and implement effective digital library systems. Although these systems have been designed and developed to create digital libraries and archive systems that allow users to better exploit the digital resources managed by the different systems, practices are needed to address and manage interoperability among systems at a higher level of abstraction than what is presently done and in line with what has been proposed in [2].","refs":[{"start":801,"end":804,"marker":"bibr","target":"#b1"}]},{"text":"The future that is now unfolding before the communities involved in the evolution of digital libraries systems is really challenging because new areas need to be addressed. Two of these in particular need to be tackled as underlined in [1]:","refs":[{"start":236,"end":239,"marker":"bibr","target":"#b0"}]},{"text":"-It is important to continue to focus on the multidisciplinary nature of research on digital libraries which not only goes from computer science to humanities but also crosses areas in the same field, ranging, for example, from archival to librarian sciences or from information management systems to new knowledge environments. This is an ongoing challenge for the digital library field and there is need to continue to contribute to improve the cooperation between the many communities that share common objectives. -We witness a profound change that is happening in the world of scientific communication, where the object of scientific communication is no longer a linear text, although digital, but an object-centric network that consists of text, data, images, videos, blogs, etc. This change is likely to deeply modify the nature and the role of digital libraries and their relationships with other data centric realities. So future trends in digital libraries and scientific communications must be considered together with the study of the evolution in digital scholarship, because the publication and the consumption of scientific information are witnessing radical changes producing also relevant transformations on the scholarly record [3,5].","refs":[{"start":1246,"end":1249,"marker":"bibr","target":"#b2"},{"start":1249,"end":1251,"marker":"bibr","target":"#b6"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"This paper reports on the presentation made during the \"11th Italian Research Conference on Digital Libraries (IRCDL 2015)\" held in Bolzano-Bozen, 29-30 January 2015, in the main building of the Free University of Bozen-Bolzano. The presentation was given during the conference special session devoted to the report on the first ten editions of Italian Research Conference on Digital Libraries (IRCDL). This paper gives an account on the general aspects of the history of IRCDL, whereas the report on the research topics and trends over time, and over the research community that has been built around IRCDL over ten years, can be found in [4].","refs":[{"start":640,"end":643,"marker":"bibr","target":"#b4"}]}]}}