{"bibliography":{"title":"TELplus: Aimed at Strengthening, Extending and Improving The European Library Service","authors":[{"person_name":{"surname":"Agosti","first_name":"Maristella"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"agosti@dei.unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{},"sections":[{"title":"Introduction","paragraphs":[{"text":"TELplus 1 is a project funded by the European Commission under the eContentplus Programme, within the domain of Digital Libraries. The project is supported by CENL, the Conference of European National Librarians 2","refs":[]},{"text":"The overall goal of TELplus is to strengthen, expand and improve The European Library , and is coordinated by the National Library of Estonia.","refs":[]}]},{"title":"3","paragraphs":[{"text":"The European Library has been officially acknowledged by the European Commission . Managed by CENL, The European Library is an on-line service providing access to the electronic resources of the National Libraries of Europe. During the past years, The European Library has gradually expanded to offer access to the resources of 48 national libraries of Europe in 35 languages. Resources can be both digital -e.g. books, posters, maps, sound recordings, videos -and bibliographical. Quality and reliability are guaranteed by the 48 collaborating national libraries of Europe, where a national library is a library specifically established by a country to store its information database; national libraries usually host the legal deposit and the bibliographic control centre of a nation.","refs":[]},{"text":"TELplus will make a valuable contribution to the further development of Europeana. The project started in October 2007 and it ends in December 2009.","refs":[]}]},{"title":"Objectives and Target Users","paragraphs":[{"text":"The main objectives of the TELplus project are: For direct dissemination through its own website and its other dissemination tools the TELplus project is mainly reaching out to professionals and academics interested in the technical development of The European Library and of digital libraries in the wider sense.","refs":[]},{"text":"The issue of the analysis of user requirements is specifically addressed by the Work Package 5 (WP5) of the project, aimed to develop specifications for the design of innovative personalized services for the final users of Europeana. The work undertaken in WP5 by the University of Padua team so far has been mainly focused on the HTTP log data analysis and the use of annotations as shortly reported in the following.","refs":[]}]},{"title":"User personalisation services","paragraphs":[{"text":"The work on user personalization is necessary to direct the designers of advanced information services giving insights and directions towards new services of interest for the users. The findings serve to guide the design of software components for new added-value services of interest to the final users of digital libraries management systems.","refs":[]}]},{"title":"Log File Analysis","paragraphs":[{"text":"The analysis of HTTP log data has been conducted over a period of time of eighteen months which goes from January 2007 to June 2008. The time span of the HTTP log data available, that is eighteen months, represents an exception on present literature and work conducted at international level, because most of the other studies, that have made public, are based on data of shorter time intervals. The availability of an HTTP log data set over such a long period of time is giving us the opportunity of deriving information that can also inform on the tendency of the use of the portal by final users, giving the opportunity of using these results as an aid in the planning of services and use of the portal.","refs":[]},{"text":"Table 1 1 where it is shown that in the analyzed period of time the number of unique visitors was more than 475 thousands, with an average of 870 visitors per day. More than 700 thousands visits where recorded with a daily average of about 1,300; these visits produced around 58 millions of hits (HTTP requests to the Web server) which corresponds to a daily average of 106 thousands of contacts. The number of Web pages requested were more than 19 millions, which corresponds to almost 35 thousands of pages per day. \"Not viewed\" traffic, both hits and bandwidth, includes traffic generated by robots, worms, or replies with special HTTP status codes.","refs":[{"start":6,"end":7,"marker":"table","target":null},{"start":8,"end":9,"marker":"table","target":null}]}]},{"title":"Use of Annotations","paragraphs":[{"text":"The work undertaken in the area of annotation sharing has designed and built a demonstrator where users can construct over time an useful hypertext, which relates pieces of information of personal interest -inserted by the final user -to the digital objects which are managed by the Digital Library System (DLS). In fact, the user annotations allow the creation of new relationships among existing digital objects by means of links that connect annotations together with existing objects. In addition, the hypertext between annotations and annotated objects can be exploited not only for providing alternative navigation and browsing capabilities, but also for offering advanced search functionalities, able to retrieve more and better ranked objects in response to a user query by also exploiting the annotations linked to them.","refs":[]},{"text":"Therefore, annotations can turn out to be an effective way of associating this kind of hypertext to a DLS to enable the active and dynamic use of information resources. In addition, this hypertext can span and cross the boundaries of the single DLS, if users need to interact with the information resources managed by diverse DLS, as it is the case of The European Library where 48 national libraries cooperate in the service also with their internal implementations. This latter possibility is quite innovative, because it offers the means for interconnecting various DLS in a personalized and meaningful way for the end-user, and this is a big challenge for DLS of the next generation, as it is sketched in Figure 1.  ","refs":[{"start":716,"end":717,"marker":"figure","target":"#fig_1"}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The objectives of the TELplus project, which is aimed at strengthening, extending and improving The European Library service, are outlined together with some relevant results obtained in the first part of the project. In particular some results obtained in the work package 5, devoted to User personalization services -log file analysis and use of annotations -are reported.","refs":[]}]}}