{"bibliography":{"title":"Talmud Yerushalmi Digital Critical Edition","authors":[{"person_name":{"surname":"Katz","first_name":"Menachem"},"affiliations":[{"department":null,"institution":"University of Haifa","laboratory":null}],"email":"katz55@gmail.com"},{"person_name":{"surname":"Gershuni","first_name":"Hillel"},"affiliations":[{"department":null,"institution":"Hebrew University","laboratory":null}],"email":"gershuni@gmail.com"},{"person_name":{"surname":"Bar","first_name":"Yaron"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Jewish studies","Digital editions","Digital humanities","Jerusalem talmud","Digital libraries"],"citations":{"b0":{"title":"The Digital Edition 2.0 and the Digital Library: Services, not Resources","authors":[{"person_name":{"surname":"Van Zundert","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Boot","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Bibliothek and Wissenschaft","series":null,"scope":{"volume":44,"pages":{"from_page":141,"to_page":152}}},"b1":{"title":"Lo Seridim Bilvad: Ginze HaYerushalmi","authors":[{"person_name":{"surname":"Cherlow","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Zion","series":null,"scope":{"volume":86,"pages":{"from_page":631,"to_page":660}}},"b2":{"title":"A Catalogue of Digital Editions","authors":[{"person_name":{"surname":"Franzini","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Terras","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Mahony","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":161,"to_page":182}}},"b3":{"title":"Electronic Scholarly Editions","authors":[{"person_name":{"surname":"Price","first_name":"K"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":"http://www.whitmanarchive.org/about/articles/anc.00267.html","publisher":"Blackwell","journal":null,"series":null,"scope":null},"b4":{"title":"Digital Scholarly Editing: Theories, Models and Methods","authors":[{"person_name":{"surname":"Pierazzo","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b5":{"title":"Scholarly Editions of Three Rabbinic Texts -One Critical and Two Digital","authors":[{"person_name":{"surname":"Milikowsky","first_name":"Chaim"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":"Sidestone Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":137,"to_page":146}}},"b6":{"title":"The Hachi Garsinan Project as a Critical Edition of the Talmud Bavli","authors":[{"person_name":{"surname":"Katz","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Shmeltzer","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Gershuni","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Preis","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2017","month":"09","day":null},"ids":null,"target":"https://bit.ly/3vXiP9T","publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"12 Digital Resources of the Rabbinic Literature: Radical Change with a Click of the Mouse","authors":[{"person_name":{"surname":"Thromas","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.1163/9789004325234_013","arXiv":null},"target":"23.1.22","publisher":"Brill","journal":null,"series":null,"scope":null},"b8":{"title":"Talmud Yerushalmi Neziqin, 3 rd print with fragments from the Italian Genizah and introductions by D. Rosenthal","authors":[{"person_name":{"surname":"Rosenthal","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Lieberman","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b9":{"title":"Jerusalem Talmud Tractate Qiddushin: Critical Edition and a Short Explanation","authors":[{"person_name":{"surname":"Katz","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b10":{"title":"According to Ms. Or. 4720 (Scal. 3) of the Leiden University Library with Restorations and Corrections","authors":[{"person_name":{"surname":"Yerushalmi","first_name":"Talmud"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"Synopse zum Talmud Yerushalmi","authors":[{"person_name":{"surname":"Schäfer","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Becker","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"1991","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"Thesaurus of Talmudic Manuscripts","authors":[{"person_name":{"surname":"Sussman","first_name":"Y"},"affiliations":[],"email":null}],"date":{"year":"2012","month":"09","day":null},"ids":null,"target":"https://fjms.genizah.org)","publisher":null,"journal":null,"series":null,"scope":null},"b13":{"title":"Ginze HaYerushalmi","authors":[{"person_name":{"surname":"Sussman (with","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Elitzur","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b14":{"title":"Tikkoun Sofrim -Combining HTR and Crowdsourcing for Automated Transcription of Hebrew Medieval Manuscripts","authors":[{"person_name":{"surname":"Ts","first_name":null},"affiliations":[],"email":null},{"person_name":{"surname":"Juflik","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Lavee","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Stoekl Ben Ezra","first_name":"V"},"affiliations":[],"email":null},{"person_name":{"surname":"Raziel-Kretzmer","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Ohali","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Wecker","first_name":"U"},"affiliations":[],"email":null},{"person_name":{"surname":"Schor","first_name":null},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"https://dev.clariah.nl/files/dh2019/boa/0568.html","publisher":null,"journal":null,"series":null,"scope":null},"b15":{"title":"Opening Up Rabbinic Manuscripts Towards Scholarly Editions","authors":[{"person_name":{"surname":"Stoekl Ben Ezra","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Mahir","first_name":"Sofer"},"affiliations":[],"email":null}],"date":{"year":"2021","month":"01","day":null},"ids":null,"target":"23.1.22","publisher":null,"journal":null,"series":null,"scope":null},"b16":{"title":"The Book of Ben Sira website","authors":[],"date":null,"ids":null,"target":"https://www.bensira.org/","publisher":null,"journal":null,"series":null,"scope":null},"b17":{"title":"Israel, Ktiv Project","authors":[],"date":null,"ids":null,"target":"https://web.nli.org.il/sites/nlis/en/manuscript","publisher":"National Library","journal":null,"series":null,"scope":null},"b18":{"title":"Yerushalmi Medieval Testimonies Project","authors":[{"person_name":{"surname":"Sussman","first_name":"Y"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"https://testimoniayerushalmi.biu.ac.il/","publisher":null,"journal":null,"series":null,"scope":null},"b19":{"title":"Talmud Yerushalmi Citation Database","authors":[{"person_name":{"surname":"Pinchuk","first_name":"M"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":"https://yerushalmidb.com/","publisher":null,"journal":null,"series":null,"scope":null},"b20":{"title":"Friedberg Jewish Manuscript Society (FJMS) Genizah site and Bavli Variants site (Hachi Garsinan)","authors":[],"date":null,"ids":null,"target":"https://fjms.genizah.org/","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"This paper introduces our new digital critical edition of the Jerusalem Talmud (The Talmud Yerushalmi), presenting its necessity, features, and significance in the realm of Talmudic editions. Further, the paper offers a framework for considering the edition as a digital library of the materials it comprises.","refs":[]}]},{"title":"The Jerusalem Talmud: Extant Textual Witnesses","paragraphs":[{"text":"The Jerusalem Talmud is a major work comprising the dicta and stories of the Jewish sages in Palestine from approximately 3rd-4th Centuries CE. This compilation was not awarded the intensive study and commentary of its Babylonian counterpart (Talmud Bavli), and the text we have today is full of scribal errors and omissions.","refs":[]},{"text":"Since the Jerusalem Talmud was not nearly as popular as the Babylonian Talmud, there are relatively few textual witnesses of this work. The majority of the text is reflected in a single manuscript -the famous MS Leiden. This manuscript was written in Italy 1289, and is the basis for the Venice print of 1523. Another significant manuscript is the Italian Vatican 133, which contains approximately one quarter of the entire Jerusalem Talmud (order Zeraim and tractate Sotah), and is considered one of the most corrupted manuscripts of Talmudic literature, although it does contain many authentic readings. Other manuscripts include significantly smaller portions of the Talmud: The Spanish MS Escorial of tractate Neziqin; a few manuscripts (and an early print) of tractate Sheqalim, and various fragments from the Cairo Genizah and the European Genizah, which were used as book bindings for European manuscripts. In 2012, Y. Sussmann published his Thesaurus of Talmudic Manuscripts, which cataloged, inter alia, all known manuscripts of the Jerusalem Talmud at the time. Additions to the catalog were made by the FJMS team, and in 2020, Sussmann published a new comprehensive edition of all known Genizah fragments of the Jerusalem Talmud (Ginze HaYerushalmi; regarding the edition, its importance, and shortcomings, see: Cherlow, 2021).","refs":[]},{"text":"High-resolution images of the Leiden and Vatican manuscripts are available on the library websites, and high-resolution images (along with transliteration) of the Cairo Genizah fragments are available on the Cairo Genizah Project, under the FJMS Portal. Some scanned versions of the European fragments can be found in the National Library of Israel's Ktiv Project (some in medium quality, and some can only be viewed in the library).","refs":[]},{"text":"The information is thus scattered across various editions and locations. Moreover, no complete critical edition exists for the majority of the Jerusalem Talmud. The first edition to include all the primary features of a desired critical edition is probably Katz's edition of Yerushalmi Qiddushin (2016), based on the MS Leiden text, including the necessary corrections and synopses of the textual witnesses, as well as parallels and citation apparatuses, and a short commentary on the text.","refs":[]},{"text":"The Jerusalem Talmud Tractate Qiddushin was a printed edition; this fact demanded compromises and difficult choices, which the editor of a digital edition would be spared. For example, the editor of the printed edition had to decide whether to present the edition as a continuous text, or divided into Sugyot (free-standing sections of Talmudic text); the synopsis is in the appendix instead of adjacent to the text; the parallels and citations were printed as abbreviations or as references; images of the manuscripts could not be included; and so on.","refs":[]},{"text":"Our Jerusalem Talmud Digital Critical Edition was created as a response to these needs, and offers an edition that suits the needs of the digital world, without compromising scientific value.","refs":[]}]},{"title":"The Jerusalem Talmud Digital Critical Edition 4.1. The Project","paragraphs":[{"text":"Our project aims to create a full critical edition of the Jerusalem Talmud. Our first undertaking is tractate Yevamot, a project which received a grant from the Israel Science Foundation (1717/19). This edition features an amended base text along with a full and flexible synopsis, including all the required apparatuses: parallels in Rabbinic literature, citations in medieval literature, bibliography, and a brief commentary.","refs":[]},{"text":"The edition is based on an exact transcription of MS Leiden, and of the Venice Print in sections in which the MS Leiden text is missing. The project includes the texts of all other direct textual witnesses (in tractate Yevamot: fragments from Munich and Darmstadt). The transcriptions were created manually, with the assistance of previous editions of the manuscripts and first prints (notably Schäfer-Becker's Synopse zum Talmud Yerushalmi, the Academy of the Hebrew Language edition, and Sussmans' Ginze HaYerushalmi), complete with corrections based on thorough review of high-quality images of the manuscripts. Unfortunately, the ability to use OCR to read Hebrew or Aramaic manuscripts is not yet sufficiently developed. When textual manuscript-based projects such as Stoekl et al.'s Sofer Mahir and Tikoun Sofrim will reach a more mature stage, the extension of the edition to the entire Talmud will be far easier to achieve.","refs":[]},{"text":"Indirect witnesses collected from hundreds of later works are also included in this project. High resolution images of the direct textual witnesses are incorporated into the edition. The base text is amended, corrected, and clearly marked, with notes explaining each deviation from the primary text. The text is corrected by the editors (Menachem Katz and Hillel Gershuni) based on previous research, commentaries, and extant direct and indirect textual witnesses.","refs":[]},{"text":"These features define the work as a critical edition. The editors play an important role in selecting and correcting the text. This edition is the first of its kind on two levels: it is the first critical edition of the Jerusalem Talmud (apart from the Tractate Qiddushin edition, which can be viewed as the first stage of the edition's development), as well as the first full critical digital edition of any Talmudic work.","refs":[]}]},{"title":"The Structure, User Interface, and Functions of the Edition 4.2.1. The Text","paragraphs":[{"text":"The user interface includes a simple but powerful structure. Each tractate is divided into chapters and Halakhot, which provide the basic viewing unit. Due to the inconsistency between various editions and prints of the Jerusalem Talmud regarding the division of Halakhot, we based our edition on the division of the Mishnah, which is the base text of the Jerusalem Talmud.","refs":[]},{"text":"Each Halakhah is preceded by the Mishnah text, based on MS Kaufman. MS Leiden also contains the Mishnah text, but the Mishnah was not included in the original Talmudic texts, and was only added at a later stage from manuscripts of the Mishnah; we decided to include a more accurate version of the Mishnah text.","refs":[]},{"text":"The Talmudic text follows the Mishnah. The editors divided the text into sections and short lines, complete with full punctuation. The user can choose to view a 'clean' text of the Talmud without these divisions, and/or without punctuation.","refs":[]},{"text":"The edition for tractate Yevamot consists of 41,060 words in 4,145 lines (an average of 10 words for each line). In each line, the user can choose to view the synopsis of all direct and indirect textual witnesses. In later stages, the user will be able to filter and arrange the synopsis by types of textual witnesses, and highlight different types of changes.","refs":[]},{"text":"The text is accompanied by five apparatuses:","refs":[]},{"text":"1. Parallels in Rabbinic literature, including Tannaitic sources cited by the Talmud, and parallel Sugyot in the Talmuds and in Midrashic literature.","refs":[]}]},{"title":"Citations in medieval literature (Rishonim).","paragraphs":[{"text":"The relevant data from these first two apparatuses is also presented in the synopsis. 3. Editorial notes explaining deviations from the main manuscript text and adding suggested readings. 4. Bibliographical notes, referring to relevant research literature. 5. Explanatory notes. The apparatuses can be viewed in relation to the entire Halakhah, or a specific section, or a specific line. Clicking on a specific note highlights the relevant text in the Talmud, and the user can click again to view a pop-up pane with the full text of the note.  The text can be exported as a TEI encoded file. The user can download an XML file of each Halakhah, which can then be used and interpreted as needed.","refs":[]}]},{"title":"Images","paragraphs":[{"text":"This edition will be accompanied by images of the manuscripts; specifically, for tractate Yevamot, MS Leiden and the fragments from Munich and Darmstadt. The user will be able to browse the images of the manuscript by clicking on a specific line and presenting the image in which the text appears. This enables users to check the transcriptions themselves, and understand the peculiarities of the text.","refs":[]}]},{"title":"Figure 4:","paragraphs":[{"text":"The word ‫ע‬ ‫ץ‬ (tree) in the Munich fragment of Jerusalem Talmud tractate Yevamot (UB München, 2° Cod.ms. 17, fol. Iir; end of the third line). The lengthened shape of the letter ‫ץ‬ may have been designed not only to fill the line, but also to resemble the shape of a tree.","refs":[]},{"text":"The images module is yet to be developed; the proposed concept currently underway provides the user with the option of presenting the images beside the text, or showing the image of a specific manuscript in a pop-up window.","refs":[]},{"text":"A noteworthy model is the one applied by the Mahadura website, under the Friedberg Jewish Manuscripts Society portal (https://fjms.genizah.org/), in which the first two authors of this paper were involved. This website was designed to help editors create a digital edition which include images and texts: Mahadura offers tools that can help editors transcribe the text and present it alongside the image of the manuscript, creating a link between each word in the image and the transcription. Users can hover the cursor over one word in the image, and the corresponding word in the transcription becomes highlighted, and vice versa. Mahadura is a highly sophisticated tool, but it lacks the crucial features of a classical Rabbinic critical edition, such as apparatuses for parallels, citations, and explanatory notes. For this reason, we decided against using it in the preparation of the new Digital Edition of the Jerusalem Talmud project. Nevertheless, the model of Mahadura will be considered while constructing the image module of the edition, albeit with less complex features. Showing an image side by side with each line of the transcription satisfies the needs of most users, and prevents unnecessary complexity, which is also resource-consuming. Several digital editions may be considered as a model for presenting images alongside a text, such as the Book of Ben Sira digital edition (www.bensira.org).","refs":[]}]},{"title":"The Jerusalem Talmud Digital Critical Edition as a Digital Library","paragraphs":[{"text":"The Jerusalem Talmud Digital Critical Edition was designed and constructed as a critical edition: focusing on one work, and using the human mind to reconstruct its original text. However, this edition can also serve as a digital library of information relevant to the Jerusalem Talmud. It is noteworthy that most direct and indirect textual witnesses of this Talmud are European, primarily from Italy: The first print is from Venice; the two major manuscripts are Italian; and a large portion of the fragments come from the European Genizah. The indirect textual witnesses are also most often European in origin.","refs":[]},{"text":"Since this edition includes not only the texts, but also images of these manuscripts, the edition can also be used as a digital library. This creates accessibility not only for scholars and academics, but also for anyone who cherishes the Jewish legacy of manuscript copying and the study of texts, enabling them to see the manuscripts with their own eyes. Here we applied a similar philosophy to the one we utilized in the FJMS Bavli Variants site, which has a similar character of a digital library or museum, presenting full texts and images of the Babylonian Talmud manuscripts and first prints.","refs":[]},{"text":"We would like to propose and encourage the use of this model in other editions in humanities research. Digital editions can also serve as digital libraries; instead of avoiding this important aspect of the digital edition, we believe it should be embraced for its potential. Many digital editions already include this facet, such as the abovementioned Book of Ben Sira digital edition. In our view, this facet should be treated as an integral part of a digital edition.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"presents our project, The Jerusalem Talmud Digital Critical Edition. The edition consists of a reconstruction of the original Talmudic text, along with direct and indirect textual witnesses -mostly of European origin, complete with a bibliography and a short commentary.","refs":[]}]}}