{"bibliography":{"title":"The Construction of the Grammaticographical Textual Genre in Grammars for Italian Speakers With Spanish as a Foreign Language","authors":[{"person_name":{"surname":"Muzzupappa","first_name":"Silvia"},"affiliations":[{"department":null,"institution":"University of Padua","laboratory":null}],"email":"silvia.muzzupappa@phd.unipd.it"}],"date":null,"ids":{"DOI":"10.30687/978-88-6969-381-6","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Grammar","Spanish","Database","Bilingual grammars","Italian","Grammaticography"],"citations":{"b0":{"title":"El papel de las Osservationi della lingua castigliana de Giovanni Miranda (1556) en la historia de la enseñanza del español para italianos","authors":[{"person_name":{"surname":"Carreras","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Goicoechea","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Quaderni del CIRSIL","series":null,"scope":{"volume":1,"pages":{"from_page":9,"to_page":23}}},"b1":{"title":"Pretéritos perfectos simples y compuestos en las gramáticas de español para italófonos: 1801-1875","authors":[{"person_name":{"surname":"Castillo Peña","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Lombardini","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"San","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vicente","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":null,"target":null,"publisher":"Visor Libros","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":276,"to_page":314}}},"b2":{"title":"Note grammaticali su Miranda (1566) e Franciosini (1624) dalla prospettiva della grammaticografia italiana","authors":[{"person_name":{"surname":"Castillo Peña","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"San","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vicente","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Studi di grammatica italiana","series":null,"scope":{"volume":37,"pages":{"from_page":143,"to_page":171}}},"b3":{"title":"Unión y separación de palabras en las \"Osservationi della lingua castigliana\" de Giovanni Miranda","authors":[{"person_name":{"surname":"Peña","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":{"DOI":"10.30687/978-88-6969-381-6","arXiv":null},"target":null,"publisher":"Edizioni Ca'Foscari","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":115,"to_page":144}}},"b4":{"title":"Pretérito perfecto simple y pretérito perfecto compuesto en las gramáticas de Juan de Miranda y de Lorenzo Franciosini","authors":[{"person_name":{"surname":"Castillo Peña","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"San","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Vicente","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Orillas Rivista D'ispanistica","series":null,"scope":{"volume":6,"pages":{"from_page":647,"to_page":670}}},"b5":{"title":"Gramatica spagnuola e italiana","authors":[],"date":{"year":"1709","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"El foco italiano: Giovanni Miranda","authors":[],"date":{"year":"2006","month":null,"day":null},"ids":null,"target":null,"publisher":"Fundación Instituto Castellano Leonés de la Lengua","journal":null,"series":null,"scope":{"volume":1,"pages":{"from_page":239,"to_page":253}}},"b7":{"title":"Grammatica per imparare le lingue italiana, francese e spagnola","authors":[],"date":{"year":"1627","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"Gramatica spagnola e italiana","authors":[],"date":{"year":"1624","month":null,"day":null},"ids":null,"target":null,"publisher":"Sarzina","journal":null,"series":null,"scope":null},"b9":{"title":"El castellano y su codificación gramatical","authors":[{"person_name":{"surname":"Gómez Asencio","first_name":"J"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":"Burgos: Fundación Instituto Castellano y Leonés de la Lengua","journal":null,"series":null,"scope":{"volume":3,"pages":{"from_page":2006,"to_page":2011}}},"b10":{"title":"Contributions à l'histoire de la grammaire italienne,espagnole et française à l'époque de la renaissance","authors":[],"date":{"year":"1974","month":null,"day":null},"ids":null,"target":null,"publisher":"H&S Publishers","journal":null,"series":null,"scope":null},"b11":{"title":"Il rapporto tra gli umanisti italiani e gli umanisti spagnoli al tempo di Alessandro VI: il caso di Antonio de Nebrija","authors":[{"person_name":{"surname":"Mazzocco","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2002","month":null,"day":null},"ids":null,"target":null,"publisher":"Roma nel Rinascimento","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":211,"to_page":236}}},"b12":{"title":"El español como segunda lengua en los siglos XVI y XVII. Los sistemas de clases de palabras, el artículo, el nombre y el pronombre","authors":[],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"Aracne","journal":null,"series":null,"scope":null},"b13":{"title":"Edizione e studio critico di Castillo Peña","authors":[],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b14":{"title":"Bibliografía cronológica de la lingüística, la gramática y la lexicografía del español. Desde el año 1601 hasta el año 1700 (Bicres II)","authors":[],"date":{"year":"1999","month":null,"day":null},"ids":null,"target":null,"publisher":"John Benjamins","journal":null,"series":null,"scope":null},"b15":{"title":"Bibliografía cronológica de la lingüística, la gramática y la lexicografía del español. Desde el año 1701 hasta el año 1800 (Bicres III)","authors":[],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"John Benjamins","journal":null,"series":null,"scope":null},"b16":{"title":"Gramatica Española, o' modo de entender, leier, y escrivir Spañol","authors":[],"date":{"year":"1689","month":null,"day":null},"ids":null,"target":null,"publisher":"Parrino & Mutii","journal":null,"series":null,"scope":null},"b17":{"title":"La tradición gramatical del español en Italia","authors":[{"person_name":{"surname":"Polo","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":"Cleup","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction -State of the art","paragraphs":[{"text":"In the bibliography for Spanish and Italian grammatical tradition [11,15,16] there are three main topics to underline, at least form the Spanish side: the studies on the origins of the Castilian grammatical tradition (Nebrija, 1492), the works on the foundation of the grammatical theory in GRAE (RAE, 1771) and the analysis of the effects of the late nineteenth-century grammars [10]. We also recall the work of Mazzocco [12] which explores the relationship between Nebrija (1492) and the Italian grammatical tradition, examining the influence of Leon Battista Alberti on Nebrija's grammatical education. However, the bibliography does not present exhaustive works on the history of the grammatical codification of GEI. There are only studies on few authors such as Miranda [1,7,14] and Franciosini [3,5,9]. Other grammars [6,8,17] are subject of a small number of studies. At the moment, there is an ongoing project called \"Epigrama\" (by the University of Padua) which aims to digitalize a selected number of GEI, openly available and published on the Web [2,18].","refs":[{"start":66,"end":70,"marker":"bibr","target":"#b10"},{"start":70,"end":73,"marker":"bibr","target":"#b14"},{"start":73,"end":76,"marker":"bibr","target":"#b15"},{"start":380,"end":384,"marker":"bibr","target":"#b9"},{"start":422,"end":426,"marker":"bibr","target":"#b11"},{"start":775,"end":778,"marker":"bibr","target":"#b0"},{"start":778,"end":780,"marker":"bibr","target":"#b6"},{"start":780,"end":783,"marker":"bibr","target":"#b13"},{"start":800,"end":803,"marker":"bibr","target":"#b2"},{"start":803,"end":805,"marker":"bibr","target":"#b4"},{"start":805,"end":807,"marker":"bibr","target":"#b8"},{"start":824,"end":827,"marker":"bibr","target":"#b5"},{"start":827,"end":829,"marker":"bibr","target":"#b7"},{"start":829,"end":832,"marker":"bibr","target":"#b16"},{"start":1058,"end":1061,"marker":"bibr","target":"#b1"},{"start":1061,"end":1064,"marker":"bibr","target":"#b17"}]}]},{"title":"Characteristics of innovation","paragraphs":[{"text":"The history of Spanish grammars and grammatical coding has seen the publication of great reference works and fundamental bibliographic repertories in the last few decades [10,15,16]. The history of GEI also begins to have an excellent bibliographic corpus (see \"Epigrama\" project mentioned above). Yet, since we can recognise an \"external\" approach to linguistic historiography (the texts in their historical and temporal coordinates, their theoretical and methodological sources) and an \"internal\" one (the detailed analysis of the grammatical ideas explained in the text), today a comprehensive analysis on historical evolution of GEI is still almost non-existent.","refs":[{"start":171,"end":175,"marker":"bibr","target":"#b9"},{"start":175,"end":178,"marker":"bibr","target":"#b14"},{"start":178,"end":181,"marker":"bibr","target":"#b15"}]},{"text":"For the time being, we do not have an historical study of GEI, of their features and relationship among Spanish, Italian and French grammatical tradition. Themes such as the adaptation of metalinguistic terminology, the selection of the linguistic subject, the linguistic model of reference, the examples and the perception of contrastive information are yet to be explored. Only for the grammatical categories we have some research on the terminology used, the nature of the definitions (formal, semantic, hybrid), the linguistic and grammatical canon of reference.","refs":[]},{"text":"Since the PhD project is starting in 2022, now it is not possible to present clear and concrete results. This project is divided in three phases. For each phase, it will be used extensively digital tools, such as:","refs":[]},{"text":"• Transkribus for printed text recognition and digital transcription; • SQL based database and tools in order to build a database (see below) that aims to be a starting point for quantitative and qualitative studies on the data; • Sketch Engine or similar software to extract the relevant terminology or data; These tools will be applied to the analysis of the constitutive texts of the grammaticographical Spanish tradition.","refs":[]}]},{"title":"Description","paragraphs":[{"text":"During the first phase, we will build the GEI electronic corpus and it will collect different printed texts:","refs":[]},{"text":"• which first edition is between the 16th and 19th centuries; • whose purpose is to describe and facilitate the learning of both Spanish language and grammar also for an Italian-speaking audience, distinguishing those that: a. use Italian as a metalanguage and present the equivalents of the categories and linguistic forms with a comparative or contrastive purpose; b. present themselves as multilingual texts; c. do not only describe Spanish, but also Italian and / or French; d. appear as paratexts of other texts, such as introductions or synoptic tables in dictionaries, advice on pronunciation, etc.;","refs":[]},{"text":"Starting from this corpus, during the second phase we will develop a digital database populated with general information on the external structure (for example, chapters, language of description, examples, contrastive information) that will allow qualitative analysis for further studies of the grammar processes of GEI.","refs":[]}]},{"title":"We will:","paragraphs":[{"text":"• build a representative corpus of grammars and treats considering the historical era, the recipients, the metalanguage, the contrast, the origin of the authors and the place of publication; • extract information from the corpus, classify it and digitize it; • analyse the data obtained in order to insert the relevant ones in the database.","refs":[]},{"text":"The database will contain information on constants and variants of: The database will be an essential part for the definition of diachronic variation of each element, in the building of the philological transcription of the textual characteristic segments of each element and will be the starting point for the creation of graphs that will reflect the significance of the information both at a global level and in the textual units of the corpus, representing an adequate tool for the critical study of GEI.","refs":[]},{"text":"To be more precise, we will underline aspects such as:","refs":[]},{"text":"1. characterization of grammatical categories; 2. classes and denominations of the units; 3. constitution of paradigms.","refs":[]},{"text":"The goal is a greater knowledge and a clearer vision of Spanish grammar for Italians and of subgenres such as trilingual grammars. The historiographic perspective offers a descriptive variable that can help us to better understand a complex phenomenon and show the historical evolution of the knowledge on grammatical categories, indispensable for non-native speakers, in addition to the set of contrastive intuitions of grammarians of the GEI. The database will be essential for the definition of the diachronic variation of each element and to elaborate the philological transcription of the textual segments characteristic of each element (third phase). This should represent an adequate operational tool for a critical study of GEI.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The project examines the Spanish grammars for Italians and other didactic texts published between the 16th and 19th centuries to highlight the nature and characteristics of the contrastive traits described by the grammarians, as well as parallels and divergences with the Spanish and Italian grammatical tradition. More specifically, the following topics are proposed:","refs":[]},{"text":"• description and analysis of the grammar process referring to grammar categories (article, pronoun, verb, adverb, particles)  in Spanish grammars for Italians (\"Gramáticas de español para italianos\", hereafter GEI) to have a systematic classification method of all elements such as definitions, terminology, morphology, examples, contrastive observations, etc.; • identification of the distinctive features of didactic grammar as a grammaticographical textual genre in terms of external and internal structure of the text.","refs":[]},{"text":"Like all L2 grammars, GEI make descriptive and theoretical choices to adapt, privilege or omit topics in comparison with L1 grammars. We can already see from the first text of Alessandri d'Urbino how it is characterised by a contrastive and didactic approach. However, the history of grammar as grammaticography began from the study of L1, subordinating the analysis of texts to teach foreign languages to a secondary role, in which the interest lies in the recognition of filiation or originality of these texts in comparison with the grammatical tradition of L2 or L1. This research instead aims to investigate the historical construction of the choices made by the grammarian of L2.","refs":[]}]}}