{"bibliography":{"title":"Digital Archives: Extending the 5S Model through NESTOR","authors":[{"person_name":{"surname":"Ferro","first_name":"Nicola"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"ferro@dei.unipd.it"},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":"Department of Information Engineering","institution":"University of Padua","laboratory":null}],"email":"silvello@dei.unipd.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{"b0":{"title":"The NESTOR Framework: Manage, Access and Exchange Hierarchical Data Structures","authors":[{"person_name":{"surname":"Agosti","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":"Società Editrice Esculapio","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":242,"to_page":253}}},"b1":{"title":"A Methodology for Sharing Archival Descriptive Metadata in a Distributed Environment","authors":[{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2008","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":5173,"pages":{"from_page":268,"to_page":279}}},"b2":{"title":"Enduring Paradigm, New Opportunities: The Value of the Archival Perspective in the Digital Environment","authors":[{"person_name":{"surname":"Gilliland-Swetland","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2000","month":null,"day":null},"ids":null,"target":null,"publisher":"Council on Library and Information Resources","journal":null,"series":null,"scope":null},"b3":{"title":"Streams, Structures, Spaces, Scenarios, Societies (5S): A Formal Model for Digital Libraries","authors":[{"person_name":{"surname":"Gonçalves","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Fox","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Watson","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Kipp","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"ACM Transactions on Information Systems (TOIS)","series":null,"scope":{"volume":22,"pages":{"from_page":270,"to_page":312}}},"b4":{"title":"ISAD(G): General International Standard Archival Description","authors":[],"date":{"year":"1999","month":"03","day":null},"ids":null,"target":null,"publisher":"International Council on Archives","journal":"International Council on Archives","series":null,"scope":{"volume":null,"pages":{"from_page":3,"to_page":3}}}},"sections":[{"title":"Motivation","paragraphs":[{"text":"Over the past two decades, Digital Libraries (DLs) have been steadily evolving and have been shaping the way in which people and institutions access to and interact with our cultural heritage, study, and learn. Nowadays, their reach goes far beyond what has been the realm of traditional libraries and encompasses also other kinds of cultural heritage institutions, such as archives and museums. In particular, this work focuses on archives; an archive is not simply constituted by a series of objects that have been accumulated and filed with the passing of time -as it usually happens with libraries that collect, for example, individual published books, journals, and serials. Instead, it represents the trace of the activities of a physical or juridical person in the course of their business which is preserved because of their continued value.","refs":[]},{"text":"DLs benefit from the existence of sophisticated formal models, such as the Streams, Structures, Spaces, Scenarios, Societies (5S) model [4], which allow us to formally describe them and to prove their properties and features. Notwithstanding the importance of the archives, so far, there has been no attempt to develop a dedicated formal model, built around their peculiar constituents, such as the notion of archival bond. We can neither exploit the 5S model as it is for archives because, as we will discuss later on, it needs some kind of extension and tailoring.","refs":[{"start":136,"end":139,"marker":"bibr","target":"#b3"}]},{"text":"We think that the archival domain deserves a formal theory as well and that this theory has to be reconciled with the more general theories for digital libraries in order to disclose to archives the full breadth of methodologies and technologies which have been developed over the last two decades in the DL field. To this purpose we proposed a formal model for archives, built around the notion of archival bond and hierarchy: the NEsted SeTs for Object hieRarchies (NESTOR) model [1]. Furthermore, we exploit NESTOR to formally extend the 5S model in order to be capable of defining a digital archive as a specific case of digital library able to take into consideration the peculiar features of the archives.","refs":[{"start":482,"end":485,"marker":"bibr","target":"#b0"}]},{"text":"The paper is organized as follows: in Section 2 we provide some background on archives and the 5S formal model. In Section 3 we present the basics of the NESTOR model and in Section 4 we introduce our extension to the 5S model via NESTOR. Finally, in Section 5 we draw some final remarks.","refs":[]}]},{"title":"Related Work","paragraphs":[]},{"title":"Digital Archives","paragraphs":[{"text":"In an archive the context and the relationships between the documents are preserved thanks to the hierarchical organization of the documents inside the archive. Indeed, an archive is divided by fonds and then by sub-fonds and then by series and so on; at every level we can find documents belonging to a particular division of the archive or documents describing the nature of the considered level of the archive. The union of all these documents, the relationships and the context information permits the full informational power of the archival documents to be maintained. The archival documents are analyzed, organized, and recorded by means of the archival descriptions that have to reflect the peculiarities of the archive. In the digital environment archival descriptions are encoded by the use of metadata; these need to be able to express and maintain the structure of the descriptions and their relationships [3].","refs":[{"start":918,"end":921,"marker":"bibr","target":"#b2"}]},{"text":"The standard format of metadata for representing the hierarchical structure of the archive is the Encoded Archival Description (EAD) 1 , which reflects the archival structure and holds relations between entities in an archive. On the other hand, an archive is described by means of a unique EAD file and this may be problematic when we need to access and exchange archival metadata with a variable granularity [2].","refs":[{"start":133,"end":134,"marker":null,"target":"#foot_0"},{"start":410,"end":413,"marker":"bibr","target":"#b1"}]}]},{"title":"The 5S Model","paragraphs":[{"text":"The Streams, Structures, Spaces, Scenarios, Societies (5S) [4] is a formal model and draws upon the broad DL literature in order to have a comprehensive base of support. It has been developed largely bottom up, starting with key definitions and with elucidation of the DL concepts from a minimalist approach. It is built around five main concepts:","refs":[{"start":59,"end":62,"marker":"bibr","target":"#b3"}]},{"text":"streams are sequences of elements of an arbitrary type, e.g. bits, character, images, and so on;","refs":[]},{"text":"structures specify the way in which parts of a whole are arranged or organized, e.g. hypertexts, taxonomies, and so on; -spaces are sets of objects together with operations on those objects that obey certain constraints, e.g. vector spaces, probabilistic spaces, and so on; -scenarios are sequences of related transition events, for instance, a story that describes possible ways to use a system to accomplish some functions that a user desires; -societies are sets of entities and relationships between them, e.g. humans, hardware and software components, and so on.","refs":[]},{"text":"Starting from these five main concepts, it provides a definition for a minimal DL which is constituted by: (i) a repository of digital objects; (ii) a set of metadata catalogs containing metadata specifications for those digital objects; (iii) a set of services containing at least services for indexing, searching, and browsing; and, (iv) a society.","refs":[]},{"text":"While these broad concepts can be in common also with archives, when you look at the specific way in which they are formally defined, you realize that the definitions cannot be straightforwardly applied to the archives case without at least some extension. We will discuss this in further details, presenting an extension of 5S via NESTOR in Section 4.","refs":[]}]},{"title":"The Basics of the NESTOR Formal Model","paragraphs":[{"text":"We define both Nested Sets Model (NS-M) and Inverse Nested Sets Model (INS-M) in terms of the set theory as a collection of subsets where specific conditions must hold.","refs":[]}]},{"title":"Definition 1. Let A be a set and let C be a collection of subsets of A. Then C is a Nested Sets Collection (NS-C) if:","paragraphs":[{"text":"Therefore, we define a NS-C as a collection of subsets where two conditions must hold. The first condition (3.1) states that set A which contains all the subsets of the collection must belong to the NS-C itself. The second condition states the intersection of every couple of sets in the NS-C is not the empty-set only if one set is a proper subset of the other one.","refs":[]}]},{"title":"Now we can introduce the Inverse Nested Sets Collection (INS-C) which defines the INS-M: Definition 2. Let A be a set and let C be a collection. Then, C is an Inverse Nested Sets Collection (INS-C) if:","paragraphs":[{"text":"(3.4)","refs":[]},{"text":"We define an INS-C as a collection of subsets where two conditions must hold. The first condition (3.3) states that C must contain the bottom set B, which is the common subset of all the sets in C. The second condition (3.4) states that if we consider three sets K, H, and L such that H is a subset of K and K is not equal to L, then the intersection between L and K is not the same as the intersection between H and L or H is not a subset of L and vice versa.","refs":[{"start":219,"end":224,"marker":"bibr","target":null}]}]},{"title":"Extending the 5S Model via NESTOR","paragraphs":[{"text":"The notion of descriptive metadata specification2 (definition 14 [4, p. 293]) is suitable either to represent, for each archival division, a descriptive metadata -e.g. a metadata describing a serie, a sub-fonds, or an archival unit -or to represent the archive as a whole, as it happens in the case of EAD.","refs":[{"start":48,"end":49,"marker":null,"target":"#foot_1"},{"start":65,"end":76,"marker":"bibr","target":null}]},{"text":"When it comes to the definition of metadata catalog (definition 18 [4, p. 295]), there is no means to impose a structure over the descriptive metadata in the catalog. Therefore, if you use separate descriptive metadata specifications for each archival division, as in the former case, this would prevent the possibility of expressing the relationships between these archival divisions, i.e. you would loose the possibility of retaining the archival bond.","refs":[]},{"text":"Moreover, in a metadata catalog, there is no means to associate (sub-)parts of the descriptive metadata specifications to the digital objects (definition 16 [4, p. 294]) that they describe, but you can only associate a whole descriptive metadata to a whole digital object.","refs":[{"start":157,"end":168,"marker":"bibr","target":null}]},{"text":"Therefore, if you represent an archive as a whole with a single descriptive metadata specification, as in the latter case, it would not be possible to associate (sub-)parts of that descriptive metadata to the different digital objects corresponding to the various archival divisions.","refs":[]},{"text":"Our extension to the 5S model is thus organized as follows:","refs":[]},{"text":"using the notion of structure (definition 2 [4, p. 288]), we introduce the notion of NESTOR structure, as a structure that complies with the constraints of NS-M or INS-M; -using the notion of metadata catalog, we introduce the notion of NESTOR metadata catalog, as a metadata catalog that exploits a NESTOR structure to retain the archival bonds; -using the notion of digital library (definition 24 [4, p. 299]), we introduce the notion of digital archive, as a digital library where at least one of the metadata catalogs is a NESTOR metadata catalog. ","refs":[]}]},{"title":"Definition 3. Let C be a Nested Set Collection (NS-C) on a set","paragraphs":[{"text":"Definition 3 applies definition 1, ensuring that the resulting structure complies with the NS-M. Note that the set of label values L and the labeling function F are not strictly needed for the NS-M, but they can be useful in the context of the 5S and this feature, in turn, may extend the NS-M with semantic possibilities. Similarly, definition 4 applies definition 2.","refs":[]}]},{"title":"Definition 5. Given a set A, a NESTOR structure(A) is either a NS-M structure(A) or a INS-M structure(A).","paragraphs":[{"text":"The definition of metadata catalog in the 5S model can be expressed as follows. Let H be a set of handles to digital objects and M a set of descriptive metadata specifications, then a metadata catalog is a function DM : H × 2 M . Definition 6. Let H be a set of handles to digital objects and M a set of descriptive metadata specifications, a metadata catalog DM is a NESTOR metadata catalog if:","refs":[]},{"text":"Condition 4.1 imposes that, if exists, there is only one descriptive metadata specification for a given digital object because, in the archival practice, every single metadata describes a unique archival division, being it a level in the archive or a digital object [5]. Condition 4.2 ensures that the relationships among the different archival divisions are compliant with the descriptive metadata specifications in M . Definition 7. A digital archive (R, DM, Serv, Soc) is a digital library where -R is a repository; -at least one of the metadata catalogs in the set of metadata catalogs DM is a NESTOR metadata catalog; -Serv is a set of services containing at least services for indexing, searching, and browsing; -Soc is a society. Definition 7 extends the definition of digital library in the 5S model requiring that at least one of the metadata catalog is a NESTOR one, i.e. there exists at least on metadata catalog capable of retaining the archival bonds.","refs":[{"start":266,"end":269,"marker":"bibr","target":"#b4"}]}]},{"title":"Final Remarks","paragraphs":[{"text":"The definition of digital archive we gave in this paper has a couple of consequences. Firstly, more NESTOR metadata catalogs can be present in the same digital archive, thus giving the possibility of expressing different archival descriptions over the same set of digital objects. This extends the current practice in which a system for managing an archive is usually capable of managing only one description of the archive, thus giving only one point-of-view on the held material. Secondly, you can mix NESTOR and not-NESTOR metadata catalogs which allows for seamlessly integration of different visions of the managed digital objects within the same digital archive. This opens up the possibility of exploiting the whole breadth of methodologies and tools available in the DL field with the archives.","refs":[]},{"text":"Future work will concern the formal definition of creation, deletion, update, and search operations on digital archives via NESTOR. This, in turn, will open up the possibility to further extend the 5S model. Indeed, according to it, a minimal digital library has to offer, at least, indexing, searching, and browsing services [4, p. 299].","refs":[{"start":326,"end":336,"marker":"bibr","target":null}]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Archives are an extremely valuable part of our cultural heritage. Although their importance, the models and technologies that have been developed over the past two decades in the Digital Library (DL) field have not been specifically tailored on archives and this is especially true when it comes to formal and foundational frameworks, as the Streams, Structures, Spaces, Scenarios, Societies (5S) model is. Therefore, we propose an innovative formal model, called NEsted SeTs for Object hieRarchies (NESTOR), for archives, using it to extend the 5S model in order to take into account the specific features of the archives and to tailor the notion of digital library accordingly.","refs":[]}]}}