{"bibliography":{"title":"Measuring and Analyzing the Scholarly Impact of Experimental Evaluation Initiatives","authors":[{"person_name":{"surname":"Angelini","first_name":"Marco"},"affiliations":[{"department":null,"institution":"La Sapienza\" University of Rome","laboratory":null}],"email":null},{"person_name":{"surname":"Ferro","first_name":"Nicola"},"affiliations":[{"department":null,"institution":"University of Padua","laboratory":null}],"email":null},{"person_name":{"surname":"Larsen","first_name":"Birger"},"affiliations":[{"department":null,"institution":"Aalborg University","laboratory":null}],"email":null},{"person_name":{"surname":"Müller","first_name":"Henning"},"affiliations":[{"department":null,"institution":"University of Applied Sciences Western Switzerland (HES-SO)","laboratory":null}],"email":null},{"person_name":{"surname":"Santucci","first_name":"Giuseppe"},"affiliations":[{"department":null,"institution":"La Sapienza\" University of Rome","laboratory":null}],"email":null},{"person_name":{"surname":"Silvello","first_name":"Gianmaria"},"affiliations":[{"department":null,"institution":"University of Padua","laboratory":null}],"email":"silvello@dei.unipd.it"},{"person_name":{"surname":"Tsikrika","first_name":"Theodora"},"affiliations":[{"department":"Centre for Research and Technology Hellas","institution":null,"laboratory":null}],"email":null}],"date":null,"ids":{"DOI":"10.1016/j.procs.2014.10.022","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Experimental evaluation","Scholarly impact","Experimental data","Visual analytics"],"citations":{"b0":{"title":"The Cranfield Tests on Index Languages Devices","authors":[{"person_name":{"surname":"Cleverdon","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"1997","month":null,"day":null},"ids":null,"target":null,"publisher":"Morgan Kaufmann Publisher, Inc","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":47,"to_page":60}}},"b1":{"title":"Economic Impact Assessment of NIST's Text REtrieval Conference (TREC) Program, RTI Project Number 0211875","authors":[{"person_name":{"surname":"Rowe","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Wood","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Link","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Simoni","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":"http://trec.nist.gov/pubs/2010.economic.impact.pdf","publisher":"RTI International","journal":null,"series":null,"scope":null},"b2":{"title":"The Scholarly Impact of TRECVid (2003-2009","authors":[{"person_name":{"surname":"Thornley","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Johnson","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Smeaton","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Lee","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of the American Society for Information Science and Technology (JASIST)","series":null,"scope":{"volume":62,"pages":{"from_page":613,"to_page":627}}},"b3":{"title":"The Scholarly Impact of CLEF","authors":[{"person_name":{"surname":"Tsikrika","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Larsen","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Müller","first_name":"H"},"affiliations":[],"email":null},{"person_name":{"surname":"Endrullis","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Rahm","first_name":"E"},"affiliations":[],"email":null}],"date":{"year":"2000","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":8138,"pages":{"from_page":1,"to_page":12}}},"b4":{"title":"DIRECTions: Design and Specication of an IR Evaluation Infrastructure","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Di Buccio","first_name":"E"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Masiero","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Peruzzo","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":"Springer","journal":null,"series":"LNCS","scope":{"volume":7488,"pages":{"from_page":88,"to_page":99}}},"b5":{"title":"SKOS Simple Knowledge Organization System Reference -W3C Recommendation","authors":[{"person_name":{"surname":"W3c","first_name":null},"affiliations":[],"email":null}],"date":{"year":"2009","month":"08","day":"18"},"ids":null,"target":"http://www.w3.org/TR/skos-reference","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"Deliverable D6.4 -Report on the impact analysis for the CLEF initiative","authors":[{"person_name":{"surname":"Tsikrika","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Larsen","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Bordea","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Buitelaar","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2013","month":"08","day":null},"ids":null,"target":"http://www.promise-noe.eu/documents/10156/9d42701f-7d2f-4450-b6a8-5dec5444a757","publisher":null,"journal":"PROMISE Network of Excellence, EU 7FP","series":null,"scope":{"volume":null,"pages":{"from_page":258191,"to_page":258191}}}},"sections":[{"title":"Motivations","paragraphs":[{"text":"Experimental evaluation is a fundamental methodology adopted in Information Retrieval (IR) since its inception, which substantially contributed to the scientific advancements of the field. It is based on the Cranfield methodology 1 which makes use of shared experimental collections in order to create comparable experiments and evaluate the performances of different information access systems.","refs":[{"start":230,"end":231,"marker":"bibr","target":"#b0"}]},{"text":"Evaluation activities are very demanding both from the technical and economical point-of-views 2 and to be sustainable and scalable they have been carried out in large-scale evaluation campaigns such as Text REtrieval Conference (TREC) in the United States (http://trec.nist.gov/), the Conference and Labs of the Evaluation Forum (CLEF) in Europe (http://www.clef-initiative.eu/), and the NII Testbeds and Community for Information access Research (NTCIR) in Asia (http://research.nii.ac.jp/ntcir/index-en.html). In order to further facilitate their organization and management, each campaign is usually divided into tracks (referred to as labs in CLEF) and tasks. A lab is an area of focus concentrating on a specific evaluation aspect of a particular domain; for instance, CLEF in 2013 was organized into nine labs comprising, for instance, the \"Cross Language Image Annotation and Retrieval\" (ImageCLEF) lab (http://www.imageclef.org/) concentrating on the experimental evaluation of image classification and retrieval. Each lab may be divided into tasks, each focusing on specific sub-problems concerning the scope of the lab; as an example, ImageCLEF 2013 had four tasks comprising, among the others, the \"Photo Annotation and Retrieval\" task aimed at studying visual concept detection, annotation and retrieval in the context of diverse collections.","refs":[{"start":95,"end":96,"marker":"bibr","target":"#b1"}]},{"text":"Despite the general agreement about the importance of evaluation campaigns and the experimental data (e.g., collections, measures and statistics) produced by them 3 and the scientific production based on them, no shared methodology for measuring their scientific impact has already been defined. Such a methodology is much needed since measuring the impact of evaluation campaigns is crucial for assessing which aspects have been successful, and thus obtain guidance for the development of improved evaluation methodologies and information access systems.","refs":[{"start":163,"end":164,"marker":"bibr","target":"#b2"}]},{"text":"Given that the contribution of an evaluation campaign to the field is mainly indicated by the research that would otherwise not have been possible, it is reasonable to consider that their success can be measured, to some extent, by the scholarly impact of the research they foster. Previous works aimed at measuring the scholarly impact of evaluation campaigns 3,4 had relied on the scientific production (i.e., the publications relying on datasets created by the evaluation campaigns), but that they did not have a model behind it, they did not make a connection to the experimental data and most of the analyses have been conducted manually. The goal of this work is to introduce the main aspects of a methodology allowing for modeling the experimental data and scientific production related to them. As consequence we propose a new way for measuring the scholarly impact of evaluation campaigns by exploiting (semi) automatic techniques and analyzing the outcomes by means of visual analytics techniques. This paper introduces a methodology that can be adopted for performing joint analysis of experimental data and scientific production and for exploiting advanced data mining algorithms to determine new insights from the data and to characterize the success of evaluation campaigns. Furthermore, we present a first analysis of CLEF evaluations campaigns which shows how the proposed methodology can be employed and how the impact of an evaluation campaign can be measured.","refs":[{"start":361,"end":363,"marker":"bibr","target":"#b2"},{"start":363,"end":364,"marker":"bibr","target":"#b3"}]},{"text":"To this purpose, Section 2 presents the bibliographical area of the Distributed Information Retrieval Evaluation Campaign Tool (DIRECT) system 5 which is a comprehensive system allowing for managing the experimental data of IR evaluation, providing advanced services over them and defining explicit connections between campaigns and the data produced by them. Section 3 outlines the three main steps to be followed for measuring the scholarly impact of evaluation campaigns. Section 4 shows how the results of the impact analysis can be analyzed through visual analytics tools using the outcomes of the study conducted on CLEF as a use case. Finally, Section 5 draws some final remarks.","refs":[{"start":143,"end":144,"marker":"bibr","target":"#b4"}]}]},{"title":"Modeling Experimental Data of IR evaluation and Scientific Production","paragraphs":[{"text":"The necessity of modeling experimental data and designing a software infrastructure to manage and curate them, led to the development of a rather complex system -i.e., DIRECT -covering all the aspects of experimental evaluation. In this paper we focus on the bibliographical area of DIRECT which is responsible for retaining the relationships between the experimental data and the scientific production based on these data. Furthermore, this area models the bibliometrics (e.g., number of citations, h-index and impact factor) that are used for assessing the impact of evaluation campaigns.","refs":[]},{"text":"Figure 1 depicts the conceptual schema of the bibliographic area. The central entity is Contribution which refers to a published piece of writing; a conference or a workshop paper, a journal article, a book, a technical report, a thesis or a manual are examples of contributions.","refs":[{"start":7,"end":8,"marker":"figure","target":"#fig_0"}]},{"text":"Each Contribution is associated to a Concept that defines its type; e.g., a Contribution can be a generic Publication, a Working Note, or a Journal. In general, Concept is defined as an idea or notion, a unit of thought; it is used to define the type of relationships in a semantic environment or to create a vocabulary (e.g., contribution types) and it resembles the idea of concept introduced by Simple Knowledge Organization System (SKOS) 6 .","refs":[{"start":442,"end":443,"marker":"bibr","target":"#b5"}]},{"text":"Furthermore, each Contribution is associated to no, one or more authors (i.e., User) via the Author relationship and can be described by no, one or more Metadata via the describe relationship. Similar relationships exist also between Contribution and Task, Track (i.e., a lab in CLEF) and Campaign and allow us to explicitly relate contributions with the experimental data. The relationship feature relates a Contribution to a Concept which defines its topic; this allows us to determine the topics of a Contribution and its relevance for a given topic. As a consequence, a Contribution can feature a Concept -e.g., \"Digital Library\" -and given that contributions are related to experimental data, we can conduct topic-oriented analyses on them; for instance, we can calculate the extent to which a task or a campaign is relevant to the topic \"Digital Library\". Also the relationship is related to is relevant from the scholarly impact point-of-view, because it allows analyses based on the number of citations of a contribution. Indeed, we can say that \"Contribution A cites Contribution B\" where cites is a Concept relating \"Contribution A\" with \"Contribution B\".","refs":[]},{"text":"Finally, the relationship bibliometric relates a Contribution to a Concept and a Measure. This allows us to say that \"Contribution A has impact of 1.3\"; impact is defined as a Concept and 1.3 as the value of a Measure (e.g., the contribution received 1.3 times as many citations as expected in relation to a given baseline). The relationship bibliometric user has the same purpose but oriented to User (i.e., author); indeed, through this relationship we can express something like \"User A has h-index 3\", where h-index is a Concept and 3 is the value of a Measure. The entities and relations between them also allow for aggregate indicators to be calculated. For instance, impact factors for a set of contributions in a given time period can be extracted, such as average number of citations per paper up to three years after publication for each of the tracks in an evaluation campaign.","refs":[]}]},{"title":"Three Steps for Measuring the Scholarly Impact","paragraphs":[{"text":"Starting from the above described model we can conduct bibliometric studies providing a quantitative and qualitative indication of the scholarly impact of a research activity by examining the number of publications derived from it and the number of citations these publications receive. Such studies can be conducted by following these three main steps: (i) Publication data collection; (ii) Citation data collection; (iii) Data analysis.","refs":[]},{"text":"So, the first step for assessing the scholarly impact of an evaluation campaign is to identify the publications associated with it and collect them in a dataset so that their citation data can then be obtained and analysed.","refs":[]},{"text":"The second step involves the selection of citation data sources; the most comprehensive are: Thomson Reuters (formerly ISI) Web of Knowledge(http://wokinfo.com/), Scopus(http://www.scopus.com/) and Google Scholar(http: //scholar.google.com/). Each of these sources follows a different data collection policy that affects both the publications covered and the number of citations found. Once the citation data sources have been selected, the next step is to query them using the publication data as input so as to obtain the citation data.","refs":[]},{"text":"The last step regards the analyses that can be performed; they can be along several axes, such as the types of publications and the labs and tasks comprising the evaluation campaign while also drilling down the data into time dimension.","refs":[]}]},{"title":"An Initial Analysis of the Results via Visual Analytics Tools","paragraphs":[{"text":"The three steps depicted above have been applied to the CLEF (2000-2009) Proceedings publications and to the CLEF (2000-2009) Working Notes publications and detailed results are described in 4,7 . For this study, the relationships between experimental data of IR evaluation and contributions retained by DIRECT allowed us to calculate the measures determining the impact of evaluation initiatives; for instance, it emerged that three labs -i.e., Adhoc, Im-ageCLEF, and QA@CLEF -clearly dominate in terms of publication and citation numbers and thus have the higher scholarly impact. These conclusions have been drawn thanks to visual analytics tools offered by DIRECT. Figure 2 presents a screenshot of a part of the visual environment developed for conducting impact analysis. This figure reports the stacked bar chart depicting the number of citations for the CLEF labs and tasks over the years (2000-2009). Each color in the bars represents the number of citations received by the tasks belonging to a specific campaign. This environment allows also for selecting specific tasks and comparing their measures, zooming and highlighting parts of the graphs and to compare citation numbers with other bibliometrics such as the h-index of authors and the impact of publication venues.","refs":[{"start":191,"end":193,"marker":"bibr","target":"#b3"},{"start":193,"end":194,"marker":"bibr","target":"#b6"},{"start":676,"end":677,"marker":"figure","target":"#fig_1"}]},{"text":"By using the analytics possibilities offered by the DIRECT visual environment it is also possible to identify some trends over all labs and tasks; for instance, in many cases there appears to be a peak in their second or third year of operation, followed by a decline 4 . Exceptions include the \"Photo Annotation and Retrieval\" task of ImageCLEF, which attracted significant interest in its fourth year when it employed a new collection and adopted new evaluation methodologies. Such novel aspects result in renewed interest in labs and tasks, and also appear to strengthen their impact.","refs":[{"start":268,"end":269,"marker":"bibr","target":"#b3"}]}]},{"title":"Final Remarks","paragraphs":[{"text":"In this work we present a general framework for modeling the experimental data and their relationships with scientific contributions. This model sets the ground for calculating bibliometrics to be used for assessing the impact of evaluation activities. We have also introduced the three main steps to be followed for measuring impact starting from scientific publications. Finally, we have shown how visual and interactive tools can be used for conducting impact analysis.","refs":[]},{"text":"The presented methodology represents the first effort for modelling experimental data and their related scientific contributions. In this paper we show a possible application of the methodology for measuring the impact of some CLEF evaluation labs, but the methodology is general enough to be applied to other evaluation campaigns, tracks and tasks. Furthermore, there is room for applying advanced data mining algorithms and other data analysis tools for measuring the success and the impact of evaluation activities.","refs":[]},{"text":"Future work will focus on the design and development of more advanced visualizations to interact with and explore the scholarly impact data, as well as improving the automation in gathering and cleaning of further bibliographic data in order to carry out deeper analyses. We also plan to map the presented conceptual model into an RDF schema in order to enable experimental data and their relationships with scientific contributions to be exposed as Linked Data on the Web; this will allow us to reuse existing bibliographic vocabularies and to establish meaningful connections with external datasets and DL as well as to improve interoperability with existing databases.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"Evaluation initiatives have been widely credited with contributing highly to the development and advancement of information access systems, by providing a sustainable platform for conducting the very demanding activity of comparable experimental evaluation in a large scale. Measuring the impact of such benchmarking activities is crucial for assessing which of their aspects have been successful, which activities should be continued, enforced or suspended and which research paths should be further pursued in the future. This work introduces a framework for modeling the data produced by evaluation campaigns, a methodology for measuring their scholarly impact, and tools exploiting visual analytics to analyze the outcomes.","refs":[]}]}}