{"bibliography":{"title":"ASSETS: Advanced Service Search and Enhancing Technological Solutions for the European Digital Library","authors":[{"person_name":{"surname":"Aloia","first_name":"Nicola"},"affiliations":[{"department":"Institute for Information Science and Technologies","institution":"Italian National Research Council (ISTI-CNR)","laboratory":null}],"email":"nicola.aloia@isti.cnr.it"},{"person_name":{"surname":"Concordia","first_name":"Cesare"},"affiliations":[{"department":"Institute for Information Science and Technologies","institution":"Italian National Research Council (ISTI-CNR)","laboratory":null}],"email":"cesare.concordia@isti.cnr.it"},{"person_name":{"surname":"Meghini","first_name":"Carlo"},"affiliations":[{"department":"Institute for Information Science and Technologies","institution":"Italian National Research Council (ISTI-CNR)","laboratory":null}],"email":"carlo.meghini@isti.cnr.it"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":[],"citations":{},"sections":[{"title":"Introduction and Motivation","paragraphs":[{"text":"Heritage, history and cultural diversity represent all together an enormous yet dispersed strength which unanimously contribute to create the Europe uniqueness. Europes libraries, museums, archives and audiovisual archives possess huge and rich collections, which, once made accessible by the Internet, allow people to consult and reuse them for several different purposes, like work,leisure and study, and for a wide range of information product and services (e.g. tourism, education). European Commission has been acknowledging the importance to preserve, maintain, sustain and make European cultural heritage accessible for some years. In particular the Digital Libraries initiative, which is flagship project of the EU Commission i2010 strategy for the Information Society, is strongly supporting the setting up and the development of Europeanathe European Digital Library, which aims at making accessible to a wide public books, films, newspapers, photographs, drawings and archival documents from European cultural institutions, through a unique web portal.","refs":[]},{"text":"The ASSETS project aims at developing digital library services focusing on search, browsing and interfaces in order to improve the usability of Europeana. ASSETS will implement and deploy largescale services for:","refs":[]},{"text":"-Searching multimedia objects based on metadata and on content similarity; -Browsing multimedia objects for rapid navigation through semantic crosslinks; -Building Interfaces designed for interacting with multimedia objects; -Planning Longterm Access to digital information; -Ingestion of metadata requiring normalization, cleaning, knowledge extraction and mapping to common structure.","refs":[]},{"text":"The main expected outcomes from ASSETS project can be summarized as follows:","refs":[]},{"text":"a set of valueadded services to directly enhance the content accessibility and improve the usability of Europeana a set of operational services adding new multimedia digital content to Europeana, a set of recommendations, guidelines and best practices concerning the technology adaptation, and service rolling up, to contribute to the promotion of the standards and specifications addressed in Europeana, and pave the way for an increased interoperability.","refs":[]}]},{"title":"Scientific Challenges","paragraphs":[{"text":"From a scientific point of view, participating to ASSETS gives to researchers the opportunity to have access to very high quality data, such as those made available to the project by the involved stakeholders; and to have direct contact with the users and the stakeholders, thus gaining requirements for new challenges.","refs":[]}]},{"title":"Key Technologies","paragraphs":[{"text":"Considering the \"three-tier architecture\" paradigm typically adopted to describe information management systems, the ASSETS system can be described as follows:","refs":[]},{"text":"Presentation tier: The ASSETS system will provide RESTful APIs enabling external applications to use its functionalities, a set of GUIs for managing specific functionalities (e.g. data ingestion and access) and a web GUI (ASSETS portal) for browsing services and functionalities.","refs":[]}]},{"title":"Business logic:","paragraphs":[{"text":"A set of autonomous software components implementing the functionalities described in the previous paragraph interacting each others using an ad hoc integration component.","refs":[]}]},{"title":"Data tier:","paragraphs":[{"text":"An heterogeneous set of repository managers to manage different kind of information objects: multimedia objects, structured data, etc.","refs":[]},{"text":"The ASSETS system is a loosely coupled system: each software component implementing the business logic has no (or little) knowledge of other components and also is not supposed to know which tools are actually used to store or manage data.","refs":[]},{"text":"The ASSETS system rely on the top of the technology outcomes of the PHAROS, MESH, BRICKS, CASPAR, PLANETS and also other European related projects such as eConnect.","refs":[]}]},{"title":"Contribution by Italian Research Community","paragraphs":[{"text":"CNR-ISTI has a large participation in the ASSETS project.","refs":[]},{"text":"The ISTI team is responsible of several fundamental activities and is involved in all R&D activities. The main ISTI activities are:","refs":[]},{"text":"-Ingestion of metadata and machine learning: The ISTI team will deliver a suite of services implementing sophisticated functionalities for metadata cleaning, knowledge extraction and data classification. The goal of these services is to improve the quality of the content stored in Europeana.","refs":[]},{"text":"-Indexing and retrieval of data: A new search service for Europeana will be provided. The service will use advanced indexing and query processing techniques in order to return the most significant result set and will also provide a similarity-search functionality for multimedia objects. -User Generated Content and personalization: The ISTI team, in cooperation with the University of Paris Sud, will deliver a service managing the ingestion of user generated information objects in Europeana. This service will enable users to create and manage their own objects also in a cooperative way (notifying actions to other users etc) and to submit the object to Europeana, if accepted those objects will be part of the Europeana information space.","refs":[]},{"text":"Another important activity of ISTI is the collaboration to the integration of ASSETS development platforms with the Europeana Labs.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"ASSETS is a 2 year project co-funded by the CIP Policy Support Programme. The main goal of the","refs":[]}]}}