{"bibliography":{"title":"RepOSGate: Open Science Gateways for Institutional Repositories","authors":[{"person_name":{"surname":"Artini","first_name":"Michele"},"affiliations":[{"department":"Institute of Information Science and Technologies","institution":"National Research Council","laboratory":null}],"email":"michele.artini@isti.cnr.it"},{"person_name":{"surname":"Candela","first_name":"Leonardo"},"affiliations":[{"department":"Institute of Information Science and Technologies","institution":"National Research Council","laboratory":null}],"email":"leonardo.candela@isti.cnr.it"},{"person_name":{"surname":"Manghi","first_name":"Paolo"},"affiliations":[{"department":"Institute of Information Science and Technologies","institution":"National Research Council","laboratory":null}],"email":"paolo.manghi@isti.cnr.it"},{"person_name":{"surname":"Giannini","first_name":"Silvia"},"affiliations":[{"department":"Institute of Information Science and Technologies","institution":"National Research Council","laboratory":null}],"email":"silvia.giannini@isti.cnr.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-030-39905-4_15","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Open access","Institutional repository","Open science","Scholarly communication","Openaire"],"citations":{"b0":{"title":"Why so many repositories? Examining the limitations and possibilities of the institutional repositories landscape","authors":[{"person_name":{"surname":"Arlitsch","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Grant","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2018","month":null,"day":null},"ids":{"DOI":"10.1080/01930826.2018.1436778","arXiv":null},"target":"https://doi.org/10.1080/01930826.2018.1436778","publisher":null,"journal":"J. Libr. Adm","series":null,"scope":{"volume":58,"pages":{"from_page":264,"to_page":281}}},"b1":{"title":"Science 2.0 repositories: time for a change in scholarly communication","authors":[{"person_name":{"surname":"Assante","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Candela","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Castelli","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Manghi","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Pagano","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":{"DOI":"10.1045/january2015-assante","arXiv":null},"target":"https://doi.org/10.1045/january2015-assante","publisher":null,"journal":"D-Lib Mag","series":null,"scope":{"volume":21,"pages":null}},"b2":{"title":"Opening Science -The Evolving Guide on How the Internet is Changing Research, Collaboration and Scholarly Publishing","authors":[],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-319-00026-8","arXiv":null},"target":"https://doi.org/10.1007/978-3-319-00026-8","publisher":"Springer","journal":null,"series":null,"scope":null},"b3":{"title":"Global landscape of open access repositories","authors":[{"person_name":{"surname":"Bashir","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Mir","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Sofi","first_name":"Z"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":"https://digitalcommons.unl.edu/libphilprac/2445","publisher":null,"journal":"Libr. Philos. Pract. (e-journal)","series":null,"scope":{"volume":null,"pages":{"from_page":2445,"to_page":2445}}},"b4":{"title":"The scholix framework for interoperability in data-literature information exchange","authors":[{"person_name":{"surname":"Burton","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":{"DOI":"10.1045/january2017-burton","arXiv":null},"target":"https://doi.org/10.1045/january2017-burton","publisher":null,"journal":"D-Lib Mag","series":null,"scope":{"volume":23,"pages":null}},"b5":{"title":"COAR Next Generation Repositories Working Group: Next Generation Repositories -Behaviours and Technical Recommendations of the COAR Next Generation Repositories Working Group","authors":[],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":"https://www.coar-repositories.org/files/NGR-Final-Formatted-Report-cc.pdf","publisher":null,"journal":null,"series":null,"scope":null},"b6":{"title":"OpenAIRE's DOIBoost -boosting CrossRef for research","authors":[{"person_name":{"surname":"Bruzzo","first_name":"La"},"affiliations":[],"email":null},{"person_name":{"surname":"Manghi","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Mannocci","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-030-11226-4_11","arXiv":null},"target":"https://doi.org/10.1007/978-3-030-11226-4_11","publisher":"Springer","journal":null,"series":null,"scope":{"volume":988,"pages":{"from_page":133,"to_page":143}}},"b7":{"title":"OpenAIRE ScholeXplorer Service: Scholix JSON Dump","authors":[{"person_name":{"surname":"Bruzzo","first_name":"La"},"affiliations":[],"email":null},{"person_name":{"surname":"Manghi","first_name":"S"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":{"DOI":"10.5281/zenodo.2674330","arXiv":null},"target":"http://doi.org/10.5281/zenodo.2674330","publisher":null,"journal":"Zenodo","series":null,"scope":null},"b8":{"title":"The making of the open archives initiative protocol for metadata harvesting","authors":[{"person_name":{"surname":"Lagoze","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Van De Sompel","first_name":"H"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":{"DOI":"10.1108/07378830310479776","arXiv":null},"target":"https://doi.org/10.1108/07378830310479776","publisher":null,"journal":"Library Hi Tech","series":null,"scope":{"volume":21,"pages":{"from_page":118,"to_page":128}}},"b9":{"title":"The D-NET software toolkit","authors":[{"person_name":{"surname":"Manghi","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":{"DOI":"10.1108/PROG-08-2013-0045","arXiv":null},"target":"https://doi.org/10.1108/PROG-08-2013-0045","publisher":null,"journal":"Program: Electron. Libr. Inf. Syst","series":null,"scope":{"volume":48,"pages":{"from_page":322,"to_page":354}}},"b10":{"title":"OpenAIRE Research Graph","authors":[],"date":null,"ids":null,"target":"http://catalogue.openaire.eu/service/openaire.openaire_graph","publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"Repository Platforms for Research Data Interest Group of the Research Data Alliance: Matrix of use cases and functional requirements for research data repository platforms","authors":[],"date":{"year":"2016","month":null,"day":null},"ids":{"DOI":"10.15497/rda00033","arXiv":null},"target":"https://doi.org/10.15497/rda00033","publisher":null,"journal":null,"series":null,"scope":null}},"sections":[{"title":"RepOSGate Architecture","paragraphs":[{"text":"RepOSGate has been conceived to make sure that scientists of an institution which already operates an institutional repository whose underlying platform cannot meet Open Science demands, can quickly, and at low cost, meet such demands. For example, the European Commission requires funded researchers to deposit in an Open Access repository, with links to project in the metadata, every article accepted for publication. Many repository platforms offered by institutions to researchers do not meet this basic requirement and researchers end up depositing in open shared platforms, such as Zenodo.org or Figshare. As a consequence, virtuous scientists deposit in two repositories, while others simply deposit once following their most urgent obligation. On a different aspect, but with similar drawbacks, such platforms do not leverage the good practice of providing links between datasets and articles, or of providing ORCID identifiers. For institutions this means they cannot support their researchers with the tools to comply with funders mandates and cannot provide their scientists with functionalities to keep their local collection of publications interlinked with the evolving scholarly communication infrastructure.","refs":[]},{"text":"RepOSGate was designed to deliver an overlay platform capable of enhancing content in a repository with up-to-date metadata information regarding their interlinking with projects, datasets, ORCID IDs, Open Access versions, and more. Moreover, repository managers can upload Open Access versions of repository articles via admin interfaces; to facilitate the adoption of RepOSGate, the Open Access files are kept locally to RepOSGate, independently of the repository platform at hand. Ideally, the resulting overlay repository makes the repository OpenAIRE compliant, hence fitting with the OA mandate of the European Commission, and Plan-S compliant 4 , since all publications will be equipped with an Open Access version, if it exists.","refs":[{"start":650,"end":651,"marker":"bibr","target":"#b3"}]},{"text":"RepOSGate's software builds on top of a D-NET Toolkit [10] instance. D-NET is a framework where designers and developers can find the tools for constructing and operating so-called aggregative infrastructures, namely systems for aggregating (meta)data sources with heterogeneous data models and technologies. Designers and developers can select from a variety of D-NET data management services, can configure them to handle data according to given data models, and can construct autonomic workflows to obtain personalized aggregative infrastructures. As shown in Fig. 1, RepOSGate adopts D-NET to deliver an aggregation system capable of: aggregation of metadata records from the repository collection, performing entity linking to build richer records, and index the records to expose them via a web portal or via OAI-PMH APIs that are compatible with the OpenAIRE Guidelines 4.05 .","refs":[{"start":568,"end":569,"marker":"figure","target":"#fig_0"},{"start":880,"end":881,"marker":null,"target":"#foot_4"}]}]},{"title":"Aggregation","paragraphs":[{"text":"The repository must expose the publication metadata records as an OAI-PMH collection of Dublin Core metadata records, where dc:identifier should contain the DOI of the record. A D-NET aggregation workflow will be scheduled to harvest the records and transform them into the RepOSGate core metadata schema -the setting up of a D-NET workflow is described in detail in [10] and is not in the scope of this paper. The transformation includes standard harmonization rules to convert country codes, dates, DOI URLs/codes, author names, into a common representation; they can be finetuned to match peculiarities of the given repository, for example to include new dc:subject or dc:resourcetype terms into the vocabulary provided by RepOSGate. 6 ","refs":[{"start":737,"end":738,"marker":"bibr","target":"#b5"}]}]},{"title":"Entity Linking","paragraphs":[{"text":"The entity linking process is based on publications DOIs. The basic methodology is to send requests to external metadata source APIs so as to collect information required to enrich the records. Specifically, RepOSGate has been customized to collect information from three main sources:","refs":[]},{"text":"• OpenAIRE Research Graph: entity linking collects abstracts, links to projects from 28 funders (including MIUR, the European Commission, NSF, Wellcome Trust, and others world-wide), links to other versions of the publication into other sources (possibly Open Access), ORCID identifiers, subjects according to standard vocabularies (e.g. MeSH, DEWEY, Arxiv, ACM, etc.), list of citations in the bibliography; • OpenAIRE Scholexplorer: entity linking collects links from the publication to any dataset referring to it.","refs":[]},{"text":"The degree of potential enrichment of the \"pivot\" collection is remarkable considering that:","refs":[]},{"text":"• The OpenAIRE Research Graph aggregates today, November 2019, around 450Mi metadata records with links, which after deduplication and fine-grained classification narrow down to *100Mi publications [11], *8Mi datasets, *200K software research products, 8Mi other scientific products, with 480Mi semantic links between them. Such products are in turn linked to 7 research communities, organizations, and projects/grants from *30 funders worldwide. The Graph aggregates sources such as CrossRef 7 , DataCite 8 , Microsoft Research Graph 9 , Unpaywall, thematic repositories (e.g. ArXiv, RePEc, UK PMC, etc.), all known publishers, journals, data centers, research software repositories, research infrastructure archives/repositories, and all known registries (e.g. ORCID 10 , GRID.ac, re3data. org, OpenDOAR 11 , etc.). The graph is refreshed with new content every two weeks. • The OpenAIRE Scholexplorer aggregates article-dataset and dataset-dataset links from publishers and data centers world wide, for a total of 480Mi links (a dump of Scholexplorer is available at [8]); its APIs are used by Scopus and tens of data centres and publishers to resolve DOIs to the relative linked objects. The Scholexplorer citation graphs is being kept refreshed every hour, with sync actions with DataCite and CrossRef EventData.","refs":[{"start":769,"end":771,"marker":"bibr","target":"#b9"}]},{"text":"Each record in the repository with a DOI is enriched by the knowledge stored in the sources above, to build a richer record with up-to-date information.","refs":[]}]},{"title":"Provision","paragraphs":[{"text":"The final step of data provision is that of indexing the enriched records and deliver an OAI-PMH API and Full-Text Index API with a web portal. This is performed by integrating in the D-NET workflow of aggregation and entity linking a final step of ingestion into the D-NET services designed for this specific purpose, namely the OAI-PMH Publisher (based on MongoDB 12 ) and the Index Service (based on Apache Solr 13 ). The RepOSGate portal is a general purpose UI, which can be configured to include custom branding and text in static pages, which offers search and browse functionalities and statistics on Open Access and Open Science, including integration with Altmetrics to show social media citations to the article DOIs. The user interface allows the upload of Open Access versions of the original PDFs.","refs":[{"start":366,"end":368,"marker":"bibr","target":"#b11"}]},{"text":"The following section will showcase the portal as deployed for the CNR institutes ISTI and ISMAR, whose publication collection is available via People, the central institutional archive of CNR.","refs":[]}]},{"title":"ISTI Open Portal","paragraphs":[{"text":"ISTI is the Institute of Information Science and Technologies of the National Research Council of Italy, counting around 250 members of staff. CNR researchers are mandatorily requested to yearly report their scientific publications, by depositing metadata and files into the central CNR archive called People. People stores and exposes bibliographic metadata according to an internal qualified Dublin Core, where: (i) CNR author enroll numbers are kept with author CNR names, in turn kept separated from non-CNR author names (strings); (ii) grant names are kept in special fields as strings, with no reference codes; (iii) for each article the system can acquire multiple files, but no access rights are provided. People is only used for CNR and National research assessment programs, hence does not offer public search, browse, statistic portals nor public OAI-PMH APIs. This means that, unless the CNR will establish and embrace a roadmap to upgrade the current system, the institutes will not be capable of implementing Open Access and Open Science practices at the level required today by research organizations.","refs":[]},{"text":"Luckily enough, CNR's People APIs are available on request. In order to offer a traditional institutional Open Access repository portal and OAI-PMH APIs, we have deployed an instance of RepOSGate to deliver the ISTI Open Portal14 . A twin installation15 has been made available for the ISMAR institute, the Institute of Marine Sciences. In the following we shall present the aggregation and entity linking workflow implemented by RepOSGate for ISTI but also show the numbers for ISMAR Open Portal, to demonstrate the gain in information enrichment.","refs":[{"start":227,"end":229,"marker":null,"target":"#foot_6"},{"start":251,"end":253,"marker":null,"target":"#foot_7"}]}]},{"title":"Aggregation","paragraphs":[{"text":"RepOSGate collects from People OAI-PMH APIs only the metadata of publications provided by ISTI researchers, via a dedicated OAI-PMH Set. The transformation makes sure that:","refs":[]},{"text":"• CNR authors: CNR Author information, which is properly structured, is included into the DataCite author metadata in such a way CNR enrollment number appears as author identifier; • non-CNR authors: non-CNR Author information follows the same restructuring, but applying a case-driven function that attempts to transform the name into an \"Surname, N.\" structure. • ISTI Laboratories: Thanks to a custom author-laboratory map, CNR authors are also associated to their ISTI Laboratory, the information being kept into the affiliation field of the author structure.","refs":[]},{"text":"Records from People are not clear in terms of Access Rights. This information is key to deliver an Open Access repository or view over the scientific production of ISTI and will be identified via the Entity Linking below.","refs":[]}]},{"title":"Entity Linking","paragraphs":[{"text":"The entity linking process fetches from OpenAIRE Research Graph and Scholexplorer: links to projects, links to other versions of the publication into other sources (possibly Open Access), links from the publication to any dataset referring to it, bibliographic references, and subjects according to standard vocabularies (enrichment with ORCID IDs is in the roadmap).","refs":[]},{"text":"More specifically, by the 22nd of September 2019 the system collected 9329 publication records, out of which 2872 have DOIs (the majority of publications does not necessarily bear a DOI, for example technical reports, presentations, software, etc.). The administrator has uploaded 360 Open Access versions of non-OA articles. The entity linking phase enriched a total of 590 records by querying the OpenAIRE services, the numbers shown in Table 1. Of all information enrichments above, of great interest to the Open Access and Open Science mission of ISTI is in particular:","refs":[{"start":445,"end":446,"marker":"table","target":"#tab_0"}]},{"text":"• The number of Open Access publications: such number could not be identified from the records in People and they are key to offer Open Access analysis and monitoring.","refs":[]}]},{"title":"• Identification of Open Access rights: as long as an Open Access version of a non-","paragraphs":[{"text":"Open Access publication in ISTI Open Portal will be collected by OpenAIRE, this version will also appear in the ISTI Open Portal as part of the publication metadata: researchers can freely deposit in EC compliant repositories like Zenodo.org to comply to the EC Open Access mandates and this version will be first collected by OpenAIRE and then fetched by ISTI Open Portal; • Identification of links to funding: for the same reason, the projects funding the publication will be fetched from OpenAIRE by the ISTI Open Portal and will appear as part of the publication record.","refs":[]},{"text":"Table 2 shows the numbers for ISMAR Open Portal. The 26th of September 2019 the system collected 5891 records, out of which 1898 have a DOI. Interestingly, the marine context features a richer set of datasets if compared to the Computer Science. For both ISTI Open Portal and ISMAR Open Portal the aggregation and entity linking process is scheduled every night, thereby keeping the ISTI collection always up to date with the latest scholarly links and properties collected by OpenAIRE services.","refs":[{"start":6,"end":7,"marker":"table","target":"#tab_1"}]}]},{"title":"Provision","paragraphs":[{"text":"RepOSGate's web portal offers a number of services including: (a) a per-publication page offering augmented information with respect to that natively stored in the institutional archive; (b) browsing options taking into account the ISTI authors and the research laboratories they belong; (c) a rich array of statistics including scholarly production indices, open access indices, and visits and downloads. It is worth highlighting that by aggregating content coming from several sources the portal is also conceived to provide its managers/curators with statistics and indicators on both information completeness and consistency to use to improve what's natively stored in the CNR archive as well as in the rest of providers. Static pages have been added to provide links to the Institute Open Access policy and curators of the site. The envisaged solution is suitable for any CNR institute as well as for any institution/community willing to build a repository by augmenting the content of its native repository(ies)/ archive(s).","refs":[]},{"text":"Figure 2 shows the home search page and the result list page with details on multiple versions of the article, access rights for each version, best access right for the article (following the ordering: Open > Restricted > Embargo > Closed), Altmetrics numbers, and links to projects in OpenAIRE.  Figure 3 shows the detail page of the publication \"Data Journals: a survey\". This record, which originally featured only the minimal metadata available from the People archive, includes today the link to the related ISTI laboratory, the link to ISTI authors, one DOI link to a dataset returned by OpenAIRE Scholexplorer, and the EC projects funding this work, with links to the detail project pages on the OpenAIRE web site. Figure 4 shows the statistics about the scientific production of ISTI over time, by access rights and by year, both in graph and tabular forms. Other statistics, by year/typology and by laboratory/typology, are shown in Fig. 5.  RepOSGate has been developed to provide repository managers with a lightweight solutions easiying the development of their repository with respect to open science practices. This solution benefits from the large amount of knowledge that exists in the scholarly communication web to augment the information accompanying every repository artifact.","refs":[{"start":7,"end":8,"marker":"figure","target":null},{"start":304,"end":305,"marker":"figure","target":"#fig_1"},{"start":729,"end":730,"marker":"figure","target":"#fig_3"},{"start":947,"end":948,"marker":"figure","target":"#fig_4"}]},{"text":"The adoption of this solution was instrumental for ISTI to develop and implement an Open Access policy. From 2018 on (the year the open access policy was signed) the Institute managed to make available more than 70% of its scholarly production.","refs":[]},{"text":"The adoption of RepOSGate is currently being taken into consideration by other CNR institutes. Several enhancements are in the roadmap, such as exploiting entity linking to collect ORCID IDs and, most importantly, the possibility for authorized researchers to upload the Open Access version of an article rather than delegating one administrator of all the work. Acknowledgments. This work was possible and co-funded by the EC H2020 project OpenAIRE-Advance (grant agreement 777541). ","refs":[]}]}],"tables":{"tab_0":{"heading":"Table 1 .","description":"ISTI Open Portal: metadata enrichment statistics.","rows":[["Properties and links","Original","Enriched metadata","Difference"],["","metadata","",""],["Articles with Open","0","757 (360 added by administrator by","757"],["Access version","","depositing OA files)",""],["Subjects","10752","12744","1992"],["Bibliographic","0","6306","6306"],["references","","",""],["Other versions","8146","9270","1124"],["Project links","610","770","160"],["Dataset links","0","5 4","5 4"]]},"tab_1":{"heading":"Table 2 .","description":"ISMAR Open Portal: metadata enrichment statistics.","rows":[["Properties and links","Original","Enriched metadata","Difference"],["","metadata","",""],["Articles with Open","0","417 (no OA file deposited by","417"],["Access version","","administrator)",""],["Subjects","7090","10454","3364"],["Bibliographic references","0","10038","10038"],["Other versions","4770","6068","1298"],["Project links","45","189","144"],["Dataset links","0","128","128"]]}},"abstract":{"title":"Abstract","paragraphs":[{"text":"Most repository platforms used to operate Institutional Repositories fail at delivering a complete set of functionalities required by institutions and researchers to fully comply with Open Science publishing practices. This paper presents RepOSGate, a software that implements an overlay application capable of collecting metadata records from a repository and transparently deliver search, statistics, upload of Open Access versions functionalities over an enhanced version of the metadata collection, which include: links to datasets, Open Access versions of the artifacts, links to projects from several funders, subjects, citations, etc. The paper will also present two instantiations of RepOSGate, used to enhance the publication metadata collections of two CNR institutes: Institute","refs":[]}]}}