{"bibliography":{"title":"Building a Sentiment Analysis Model for Libraries: The CSBNO Consortium Approach","authors":[{"person_name":{"surname":"Tammaro","first_name":"Anna"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"annamaria.tammaro@unipr.it"},{"person_name":{"surname":"Tomaiuolo","first_name":"Michele"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"michele.tomaiuolo@unipr.it"},{"person_name":{"surname":"Mordonini","first_name":"Monica"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"monica.mordonini@unipr.it"},{"person_name":{"surname":"Pellegrino","first_name":"Mattia"},"affiliations":[{"department":null,"institution":"University of Parma","laboratory":null}],"email":"mattia.pellegrino@unipr.it"},{"person_name":{"surname":"Demicelis","first_name":"Riccardo"},"affiliations":[{"department":null,"institution":"CSBNO Consortium","laboratory":null}],"email":"riccardo.demicelis@csbno.net"}],"date":null,"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Participatory approach","Sentiment analysis for libraries","User studies"],"citations":{"b0":{"title":"A multilayer perceptron based ensemble technique for fine-grained financial sentiment analysis","authors":[{"person_name":{"surname":"Akhtar","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Kumar","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Ghosal","first_name":"D"},"affiliations":[],"email":null},{"person_name":{"surname":"Ekbal","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Bhattacharyya","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":540,"to_page":546}}},"b1":{"title":"Flat and hierarchical classifiers for detecting emotion in tweets","authors":[{"person_name":{"surname":"Angiani","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Cagnoni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Chuzhikova","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Fornacciari","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Mordonini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Tomaiuolo","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2016","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":51,"to_page":64}}},"b2":{"title":"SentiXGboost: enhanced sentiment analysis in social media posts with ensemble XGBoost classifier","authors":[{"person_name":{"surname":"Hama Aziz","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Dimililer","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2021","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Journal of the Chinese Institute of Engineers","series":null,"scope":{"volume":44,"pages":{"from_page":562,"to_page":572}}},"b3":{"title":"Sentiment analysis on Twitter data using KNN and SVM","authors":[{"person_name":{"surname":"Huq","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ali","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Rahman","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"International Journal of Advanced Computer Science and Applications","series":null,"scope":{"volume":8,"pages":{"from_page":19,"to_page":25}}},"b4":{"title":"Sentiment analysis of restaurant customer reviews on tripadvisor using naïve bayes","authors":[{"person_name":{"surname":"Laksono","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Sungkono","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Sarno","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Wahyuni","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":49,"to_page":54}}},"b5":{"title":"Constructing a sentiment analysis model for LibQUAL+ comments","authors":[{"person_name":{"surname":"Moore","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2017","month":null,"day":null},"ids":{"DOI":"10.1108/PMM-07-2016-0031","arXiv":null},"target":"https://doi.org/10.1108/PMM-07-2016-0031","publisher":null,"journal":"Performance Measurement and Metrics","series":null,"scope":{"volume":18,"pages":{"from_page":78,"to_page":87}}},"b6":{"title":"Utilizing BERT for aspect-based sentiment analysis via constructing auxiliary sentences","authors":[{"person_name":{"surname":"Sun","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Huang","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Qiu","first_name":"X"},"affiliations":[],"email":null}],"date":{"year":"2019","month":null,"day":null},"ids":{"DOI":null,"arXiv":"arXiv:1903.09588"},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b7":{"title":"A survey on troll detection","authors":[{"person_name":{"surname":"Tomaiuolo","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Lombardo","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Mordonini","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Cagnoni","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Poggi","first_name":"A"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Future Internet","series":null,"scope":{"volume":12,"pages":{"from_page":31,"to_page":31}}},"b8":{"title":"Recognizing contextual polarity in phrase-level sentiment analysis","authors":[{"person_name":{"surname":"Wilson","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Wiebe","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Hoffmann","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":347,"to_page":354}}},"b9":{"title":"Sentiment analysis using deep learning architectures: a review","authors":[{"person_name":{"surname":"Yadav","first_name":"A"},"affiliations":[],"email":null},{"person_name":{"surname":"Vishwakarma","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2020","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Artificial Intelligence Review","series":null,"scope":{"volume":53,"pages":{"from_page":4335,"to_page":4385}}}},"sections":[{"title":"Introduction","paragraphs":[{"text":"The CSBNO (Culture Socialità Biblioteche Network Operativo) Consortium manages 60 libraries in the Milan area and coordinates the transformation of libraries and innovation of services to make them supporting the changing needs of society. CSBNO collaborates with other innovative European libraries gathered in the NEWCOMER 1 project funded by ERASMUS 2 + which intends to promote the vision of the innovative libraries improving the community. The NEWCOMER Project partners intend to promote innovative libraries by actively engaging with users, in a participatory approach. A Manifesto 2 is shared by all Project NEWCOMER partners.","refs":[]}]},{"title":"Telephone replies received from active members.","paragraphs":[{"text":"The first dataset concerns responses collected during the lockdown from inactive members, but had been active in the past.","refs":[]},{"text":"The second dataset concerns responses collected during the lockdown of active members who use the library loan.","refs":[]},{"text":"At the end of the lockdown in May 2020, the libraries of the CSBNO Consortium participated in a national satisfaction survey called \"Library for you\" on the perception of the library by users. The aim of the national survey was to analyze the satisfaction towards libraries upon reopening. The questionnaire administered soon after the lockdown allowed respondents to answer qualitative questions about the level of service and to leave open comments that provide additional data for understanding community opinions. The answers of communities concerning the CSBNO libraries have been extracted.","refs":[]},{"text":"The third dataset concerns the responses to the national Satisfaction survey from CSBNO libraries community.","refs":[]}]},{"title":"Aims and objectives","paragraphs":[{"text":"The CSBNO Consortium intends to build a sentiment analysis model as a tool to explore community expectations and wishes on which to build a participatory approach for service design. The aim of the research is to establish a data mining model to perform sentiment analysis on qualitative comments collected by libraries. The objective is to test a new analytical method to be used to understand the data collected from community and their year-by-year comparison.","refs":[]},{"text":"The feedback mechanism most used by libraries in Italy is usually the survey collecting data with a questionnaire, such as \"The Library for You\" survey. However this data collection has the drawback that it is administered to only active users. To overcome this limitation, sentiment analysis, or opinion mining, can use text datasets with data mining programs. As the name suggests, sentiment analysis involves the analysis and identification of positive and negative opinions and emotions within a given text [9]. By building such a model today, future library surveys done by the CSBNO Consortium can be analyzed quickly and effectively to provide an accurate assessment of users' overall perception of specific areas of the library.","refs":[{"start":511,"end":514,"marker":"bibr","target":"#b8"}]}]},{"title":"Sentiment analysis for libraries","paragraphs":[{"text":"Sentiment analysis for libraries has never been studied in Italy. The international library community has used sentiment analysis in three ways: using social media, using free answer text of questionnaires, and using other corpora.","refs":[]},{"text":"An experience that is important for this research was carried out by Canadian libraries by collecting the free text responses of the LibQual questionnaire [6]. The characteristics analyzed by Canadian libraries were:","refs":[{"start":155,"end":158,"marker":"bibr","target":"#b5"}]},{"text":"• Information control: access to information, promotion, skills and bibliographic guides; • Library space: approach to physical or digital space; • Affect service: negative and positive sentiment for service. These three characteristics analyze the feelings for the two fundamental services of the library seen as access to a collection and physical space. An emotional perception that the library in general arouses in users is added.","refs":[]}]},{"title":"Methodology","paragraphs":[{"text":"To gain comparative appreciation for respondent feedback over time, the comments of the three datasets collected by CSBNO will be analyzed to track their sentiment and the topics they relate to. To gain control over such a significant amount of data, computer-aided data mining tools will be used to conduct sentiment analysis on the comments of each dataset of the survey. The framework for the sentiment analysis model essentially involves three steps: selection of training data, text processing, creating a model. Two students have been involved in the project.","refs":[]}]},{"title":"Selection and loading of training data","paragraphs":[{"text":"The pre-tagged training data is selected and loaded into the program. To create a template, both text elements and any corresponding sentiment assignments must be selected.","refs":[]}]},{"title":"Text processing","paragraphs":[{"text":"The text considered by the CSBNO Consortium is in Italian. Text preprocessing eliminated minor language differences, such as lowercase versus uppercase letters, pluralization, and tenses, using common stemming and stop-words techniques, to create an accurate text analysis model. However, since some models use the grammatical structure of text, the original plain text is also kept in the dataset, for possible use in the following steps of analysis. Once finished, the training data corpus is used to create positive, negative and neutral vectors of features, to capture the polarized elements that characterize the text of the comment. Those vectors of features are saved for future use.","refs":[]}]},{"title":"Creating a model","paragraphs":[{"text":"Using these vectors of features, the program uses a classification algorithm to create a pattern to separate other unseen comments into positive, negative, or neutral, for sentiment analysis. As an orthogonal task, the selected comments will also be classified according to their topic. This further classification will provide a deeper and more complete understanding of the collected opinions. To verify the accuracy of the models, they are tested on some pre-tagged test data, to measure the precision, recall and accuracy of the classification. The model is saved for future use.","refs":[]},{"text":"In simplified terms, the most traditional approaches of sentiment analysis work by providing the algorithm with a so-called \"bag of words\", that allows it to recognize the words and the groups of words that humans use to express positive and negative opinions. The process is a form of supervised machine learning; pre-tagged datasets are used as training examples to \"teach\" the computer and create the basis for the classification of future unlabeled information. By providing pre-tagged \"positive\" (good, polite, excellent, etc.) and \"negative\" (terrible, shoddy, rude, etc.) words, the data mining software can establish a model that will be applied to future comments to decipher their polarity or whether they have a positive or negative feeling. With the same approach, it is also possible to classify a text according to its specific topic, in a task of topic detection. Alternatively, it is possible to use clustering algorithms to group together texts with similar features, in a non supervised scenario.","refs":[]},{"text":"In this work, the most representative and consolidated techniques of sentiment analysis and topic detection will be compared. In particular, the best algorithms of different families will be considered, including those based on some notion of geometric distance between samples (i.e. knn, svm) [4], decision trees (rf, xgboost) [3], probability and statistics (NB) [5], perceptrons and small neural networks [1]. In fact, those algorithms, or their composition [2], have proven their good accuracy over many different datasets, of small and medium size [8].","refs":[{"start":294,"end":297,"marker":"bibr","target":"#b3"},{"start":328,"end":331,"marker":"bibr","target":"#b2"},{"start":365,"end":368,"marker":"bibr","target":"#b4"},{"start":408,"end":411,"marker":"bibr","target":"#b0"},{"start":461,"end":464,"marker":"bibr","target":"#b1"},{"start":553,"end":556,"marker":"bibr","target":"#b7"}]},{"text":"However, some newer algorithms have improved the accuracy over larger datasets, exploiting socalled deep neural network architectures, together with more advanced techniques for collecting the vectors of features of the training set. In fact, the traditional vectorization, based on the bag of words algorithm, creates a dataset with a very large number of features and requires an accurate and sensible phase of feature selection, for obtaining the best results. Instead, techniques of word embedding and dense representations [10] are able to map each word in a multidimensional space, where semantically related words are represented as points at a short distance. The vector representing each sample is calculated on the basis of positions of words in this multidimensional space. Moreover, deep neural networks have shown some impressive results in many applications, including sentiment analysis (BERT) [7]. But these networks are characterized by a very large number of parameters which have to be learned, requiring the use of samples in the order of magnitude of Big Data.","refs":[{"start":528,"end":532,"marker":"bibr","target":"#b9"},{"start":909,"end":912,"marker":"bibr","target":"#b6"}]},{"text":"In the present work, these new techniques will also be used, exploiting pre-trained models and additional phases of transfer learning and fine tuning, for adapting the models to the particular task at hand. The additional steps usually require much smaller datasets, than those used to train the whole model.","refs":[]},{"text":"The research is in its initial step. We intend to analyze a training set of some comments, randomly selected from the responses of the three data sets collected. This training set will be manually reviewed by the two students and labeled as having a positive or negative feeling.","refs":[]},{"text":"Using the data mining platform these training sets of comments will provide the framework for creating data-specific positive and negative word vectors to power the sentiment analysis model. It is thought to create an additional process to isolate individual topics within the larger comments, allowing for more nuanced sentiment analysis.","refs":[]}]},{"title":"Conclusions","paragraphs":[{"text":"The sentiment analysis model provides a complementary tool for analyzing quantitative and qualitative results of simple satisfaction survey of active and inactive users for library services. Sentiment analysis application, could facilitate the realization of a participatory approach with communities, allowing a simple and efficient year-by-year analysis of open comments. The CSBNO Consortium expects the sentiment analysis process to provide the means to isolate specific topics based on specified keywords, allowing individual institutions to tailor results for more in-depth analysis.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The CSBNO Consortium investigated the libraries communities during the lockdown and at their reopening, to learn about their wishes and expectations from the library. Sentiment analysis could improve the analysis of data integrating the community's perception of the library in services design. The framework and the methodology of the research are described in the three foreseen phases: Selection and loading of training data, Text processing, Creating a model. The research is in its initial phase and three characteristics will be analyzed: Information access, Library space, Affect service. The findings will support CSBNO to promote innovative libraries by actively engaging with participative communities.","refs":[]}]}}