{"bibliography":{"title":"Stratifying Semantic Data for Citation and Trust: An Introduction to RDFDF","authors":[{"person_name":{"surname":"De Nart","first_name":"Dario"},"affiliations":[{"department":"Department of Mathematics and Computer Science","institution":"University of Udine","laboratory":null}],"email":null},{"person_name":{"surname":"Degl'innocenti","first_name":"Dante"},"affiliations":[{"department":"Department of Mathematics and Computer Science","institution":"University of Udine","laboratory":null}],"email":"deglinnocenti.dante@spes.uniud.it"},{"person_name":{"surname":"Peressotti","first_name":"Marco"},"affiliations":[{"department":"Department of Mathematics and Computer Science","institution":"University of Udine","laboratory":null}],"email":null},{"person_name":{"surname":"Tasso","first_name":"Carlo"},"affiliations":[{"department":"Department of Mathematics and Computer Science","institution":"University of Udine","laboratory":null}],"email":"carlo.tasso@uniud.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-56300-8","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Semantic web","Data citation","Semantic","Data trust","Theory","Rdf"],"citations":{"b0":{"title":"Describing linked datasets with the void vocabulary","authors":[{"person_name":{"surname":"Alexander","first_name":"K"},"affiliations":[],"email":null},{"person_name":{"surname":"Cyganiak","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Hausenblas","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Zhao","first_name":"J"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b1":{"title":"An introduction to the joint principles for data citation","authors":[{"person_name":{"surname":"Altman","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Borgman","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Crosas","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Matone","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Bull. Am. Soc. Inform. Sci. Technol","series":null,"scope":{"volume":41,"pages":{"from_page":43,"to_page":45}}},"b2":{"title":"The evolution of data citation: from principles to implementation","authors":[{"person_name":{"surname":"Altman","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Crosas","first_name":"M"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"IASSIST Q","series":null,"scope":{"volume":63,"pages":null}},"b3":{"title":"Linked data provenance: state of the art and challenges","authors":[{"person_name":{"surname":"Anam","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Kang","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Kim","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Liu","first_name":"Q"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":27,"pages":{"from_page":30,"to_page":30}}},"b4":{"title":"Why and where: a characterization of data provenance","authors":[{"person_name":{"surname":"Buneman","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Khanna","first_name":"S"},"affiliations":[],"email":null},{"person_name":{"surname":"Wang-Chiew","first_name":"T"},"affiliations":[],"email":null}],"date":{"year":"2001","month":null,"day":null},"ids":{"DOI":"10.1007/3-540-44503-X_20","arXiv":null},"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":1973,"pages":{"from_page":316,"to_page":330}}},"b5":{"title":"Named graphs, provenance and trust","authors":[{"person_name":{"surname":"Carroll","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Bizer","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Hayes","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Stickler","first_name":"P"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":613,"to_page":622}}},"b6":{"title":"Minimal type inference for linked data consumers","authors":[{"person_name":{"surname":"Ciobanu","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Horne","first_name":"R"},"affiliations":[],"email":null},{"person_name":{"surname":"Sassone","first_name":"V"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"J. Logical Algebraic Methods Program","series":null,"scope":null},"b7":{"title":"RDF semantics","authors":[{"person_name":{"surname":"Hayes","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Mcbride","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2004","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b8":{"title":"Linked data: evolving the web into a global data space","authors":[{"person_name":{"surname":"Heath","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Bizer","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Synthesis Lectures on the Semantic Web: Theory and Technology","series":null,"scope":{"volume":1,"pages":{"from_page":1,"to_page":136}}},"b9":{"title":"From SHIQ and RDF to OWL: the making of a web ontology language","authors":[{"person_name":{"surname":"Horrocks","first_name":"I"},"affiliations":[],"email":null},{"person_name":{"surname":"Patel-Schneider","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Van Harmelen","first_name":"F"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"Web Semant. Sci. Serv. Agents World Wide Web","series":null,"scope":{"volume":1,"pages":{"from_page":7,"to_page":26}}},"b10":{"title":"RDF 1.1 concepts and abstract syntax","authors":[{"person_name":{"surname":"Klyne","first_name":"G"},"affiliations":[],"email":null},{"person_name":{"surname":"Carrol","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Mc Bride","first_name":"B"},"affiliations":[],"email":null}],"date":{"year":"2014","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b11":{"title":"Provenance in linked data integration","authors":[{"person_name":{"surname":"Omitola","first_name":"T"},"affiliations":[],"email":null},{"person_name":{"surname":"Gibbins","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Shadbolt","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2010","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"b12":{"title":"A methodology for citing linked open data subsets","authors":[{"person_name":{"surname":"Silvello","first_name":"G"},"affiliations":[],"email":null}],"date":{"year":"2015","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":"D-Lib Magazine","series":null,"scope":{"volume":21,"pages":{"from_page":6,"to_page":6}}},"b13":{"title":"A survey of data provenance techniques","authors":[{"person_name":{"surname":"Simmhan","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Plale","first_name":"B"},"affiliations":[],"email":null},{"person_name":{"surname":"Gannon","first_name":"D"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":47405,"to_page":47405}}},"b14":{"title":"Provenance requirements for the next version of RDF","authors":[{"person_name":{"surname":"Zhao","first_name":"J"},"affiliations":[],"email":null},{"person_name":{"surname":"Bizer","first_name":"C"},"affiliations":[],"email":null},{"person_name":{"surname":"Gil","first_name":"Y"},"affiliations":[],"email":null},{"person_name":{"surname":"Missier","first_name":"P"},"affiliations":[],"email":null},{"person_name":{"surname":"Sahoo","first_name":"S"},"affiliations":[],"email":null}],"date":null,"ids":null,"target":null,"publisher":"Citeseer","journal":null,"series":null,"scope":null}},"sections":[{"title":"Related Work","paragraphs":[{"text":"Data citation has already been explored by the Semantic Web community and it significantly overlaps with the problem of assessing data provenance since determining the authorship of data is vital for citation purposes and both tasks need metainformation over data. Provenance has already been widely discussed by the Semantic Web community leveraging on the insights provided by the Database community [5]. Provenance information can be represented exploiting two approaches: the annotation approach and the inversion approach [12]. In the first approach all metainformation is explicitly stated, while in the latter is computed when needed in a lazy fashion which requires external resources containing the information upon which provenance is entailed to be constantly available. The annotation approach is favored since it provides richer information and allows data to be self-contained; several vocabularies have been proposed to describe metainformation over linked data such as VoID (Vocabulary of Interlinked Datasets) [1], that offers a rich language for describing Semantic Web resources built on top of well known and widely used ontologies such as foaf1 and Dublincore2 , and PROV Ontology (PROV-O) 3 , which is the lightweight ontology for provenance data standardized by the W3C Provenance Working Group. Regardless of the vocabulary used, adopting the annotation approach will result in producing a lot of metainformation which might exceed the actual data in size: provenance data in particular increases exponentially with respect to its depth [14]. For more information about the problem of data provenance, we reference the curious reader to [4]. The state of the art technique for embedding metainformation in RDF, is reification [15] which consists in assigning a URI to a RDF triple by expressing it as an rdf:Statement object. Recently the RDF 1.1 Recommendation [11] introduced the so called \"RDF Quad Semantic\" which consists in adding a fourth element to RDF statements which should refer to the name of the graph which the triple belongs to. The actual semantic of the fourth element however is only hinted, leaving room for interpretation and therefore allowing semantics tailored to fit application needs. In [13] is presented a methodology for citing linked data exploiting the quad semantics: the fourth element is used as identifier for RDF predicates allowing the definition of data subsets. Other usages of the fourth element include specification of a time frame, uncertainty marker, and provenance information container [6]. Finally, the idea of using a type system to ease the fruition of semantic resources is not new to the Semantic Web community: the authors of [7] propose a type system to facilitate programmatic access to RDF resources.","refs":[{"start":402,"end":405,"marker":"bibr","target":"#b4"},{"start":527,"end":531,"marker":"bibr","target":"#b11"},{"start":1027,"end":1030,"marker":"bibr","target":"#b0"},{"start":1164,"end":1165,"marker":null,"target":"#foot_0"},{"start":1180,"end":1181,"marker":null,"target":"#foot_1"},{"start":1211,"end":1212,"marker":null,"target":"#foot_2"},{"start":1561,"end":1565,"marker":"bibr","target":"#b13"},{"start":1661,"end":1664,"marker":"bibr","target":"#b3"},{"start":1750,"end":1754,"marker":"bibr","target":"#b14"},{"start":1886,"end":1890,"marker":"bibr","target":"#b10"},{"start":2238,"end":2242,"marker":"bibr","target":"#b12"},{"start":2556,"end":2559,"marker":"bibr","target":"#b5"},{"start":2702,"end":2705,"marker":"bibr","target":"#b6"}]}]},{"title":"Well Stratified Linked Data","paragraphs":[{"text":"To introduce the concept of stratification of data we need to define a formal representation of metainformation in linked data that abstracts over the actual representation of such information (e.g. reification). Let us assume all the vocabulary of a collection of RDF data to be included in a set of labels named V and all the IRIs to be in U , subset of V . Given those definitions, associating labels to RDF graphs -thus creating named graphs-can be described by a partial function n :","refs":[]},{"text":"This function, that we will refer to herein as naming function maps identifiers to non void RDF graphs. Intuitively, assigning an IRI to a triple puts that IRI in the rôle of metainformation with respect to that triple whence thought as information. Note that the separation between information and metainformation is not absolute but relative to the context i.e. the level at which the reasoning happens. For a concrete example, consider the following RDF snipped:","refs":[]},{"text":"Accordingly to the reification semantics, here x is assigned to triple (y, b, c) and y to the triple (a, b, c) hence, the naming function over the considered data includes the following associations:","refs":[]},{"text":"x → (y, b, c) and y → (a, b, c).","refs":[]},{"text":"Clearly, y plays the rôle of metainformation with respect to the triple (a, b, c) and x plays the rôle of metainforamtion about (y, b, c) whence (a, b, c). From now on we will refer to a vocabulary with an associated naming function as a Named Graph Family (herein NG family), moving along the lines of [6].","refs":[{"start":303,"end":306,"marker":"bibr","target":"#b5"}]},{"text":"We consider a particular class of NG families called well-stratified with the fundamental property of stratifying metainformation over information in a way that prevents any infinite chain of \"downward\" references where the direction is interpreted as crossing the boundary between metainformation and information. Since practical NG families (hence triple stores) contain only a finite amount of explicit information, absence of such chains corresponds to the absence of cycles of references like, for instance, in the NG family:","refs":[]},{"text":"x → (y, b, c) y → (x, b, c).","refs":[]},{"text":"In more formal terms, a relation R on a set X is well-founded whenever every non-empty subset S of X has a minimal element i.e. there exists m ∈ S that is not related by s R m for s ∈ S. This means that we can intuitively walk along R going from right to left for finitely many steps i.e we have to stop, eventually. This implies that R does not contain infinite descending chains (i.e. an infinite sequence x 0 , x 1 , x 2 , . . . such that x n+1 R x n ). We call a NG family well-stratified whenever it comes equipped with a well-founded relation ≺ on its vocabulary such that the naming function n descends along ≺ i.e.:","refs":[]},{"text":"The relation ≺ is called witness for n. It is intuitive that identifying what serves as metainformation and information is easily computable over well-stratified NG families, while non well-founded NG families include cycles wherein it is impossible to separate information from metainformation.","refs":[]},{"text":"We now introduce the concept of abstract reasoner as anything that might alter data either by simply adding new triples (monotonic reasoners) or by deleting and replacing existing triples (non-monotonic reasoners). With abstract reasoners we represent both automated reasoning (and other data managing tasks) and human annotation. Abstract reasoners may easily break well-stratification. Intuitively most reasoning tasks and well-engineered human annotation processes should preserve stratification, however breaking the well-stratification of data is subtle and can be achieved even with monotonic reasoning. For instance, consider a set of triples where there exists a triple (y, type, statement) labelled with some IRI x and an abstract reasoner γ that adds a new triple (x, type, statement) labelled as y. This insertion is totally legit if we are using reification but introduces a circularity in the chain of meta data since the family now contains the following assignments:","refs":[]},{"text":"x → (a, type, statement) a → (x, type, statement)","refs":[]},{"text":"and hence is no more well-stratified. We are interested in a class of abstract reasoners, called coherent, that preserve the well-stratification property of named graph families they operate on. Intuitively, reasoners for provenance, subsetting and versioning are coherent as they cross the boundary between information and meta information only in one direction: descent. However in order to let such reasoners terminate the well-stratification of data must be guaranteed, therefore, every abstract reasoner that interacts with data prior to the resolution of a data citation must be coherent as well. Wrapping up these considerations, data citation can happen if data is well stratified and data can be well stratified if all the abstract reasoners that built, expanded, and verified it are coherent.","refs":[]},{"text":"It is therefore needed a practical solution to assess the coherence of abstract reasoners.","refs":[]}]},{"title":"Resource Description Framework Description Framework","paragraphs":[{"text":"In this section we propose a possible specification of a simple language called RDFDF whose main purpose is to guarantee the well stratification of data, hence the coherence of reasoning. RDFDF can be considered an extension to regular RDF, however it introduce some new top level concepts making it a new language built on the top of RDF rather than its extension (like OWL and RDFS). By design, RDFDF is a superset of RDF, thus every well formed RDF document is a well formed RDFDF document as well. RDFDF makes explicit the so-called fourth element introduced by the RDF 1.1 recommendation [11] and the basic unit of the RDFDF language is the quadruple (s, p, o, i) where s, p, and o are the subject, predicate, and object of regular RDF triples, and i is the optional identifier labelling the RDF triple. With this fourth element the naming function described in Sect. 2 can be easily represented since x → (s, p, o) can be conveniently written as (s, p, o, x). IRIs that appear as fourth object are implicitly of type meta-resource, a sibling class to rdfs:resource which now is a subclass of a broader class called data which includes both information and metainformation. Resource and meta-resource are not disjoint, indeed an IRI that is used as identifier and as subject, object or predicate of another triple belongs to both of them. The rationale behind this choice is that identifiers can be described using resources such as data provenance ontologies, therefore interoperability between resources and meta-resources is needed, and there can exist multiple levels of meta-information such that the meta-information of a certain level serves as information for the upper one. In Fig. 1 we show a practical example of a case where an IRI, in this case U, belongs to both meta-resource and rdfs:resource since it is used as identifier for the triple (A, B, C) and as subject of (U, author, f oaf : x). At the semantics level, however, the most notable difference is the introduction of a basic type system: while the rdf:type property still indicates class membership, RDFDF introduces types at the data set level to check the wellstratification of data. In this context each IRI belongs to a specific level of information: the first one is information, the second meta-information, the third meta-meta-information, and so on. The absence of loops between such layers can be checked with a simple type system, similar to the ones used in programming language, to ensure the well-stratification of RDFDF documents. RDFDF introduces a simple type system whose only type is inhabited by exactly wellstratified data. Judgements are of the form Γ n :","refs":[{"start":593,"end":597,"marker":"bibr","target":"#b10"},{"start":1696,"end":1697,"marker":"figure","target":"#fig_0"}]},{"text":"where n : U x → (a, b, c) is well-stratified. Finally, the third rule allows to break n and Γ reducing the problem to smaller objects which can then be checked separately (clearly, applying this rule with either n 1 or n 2 being ∅ is pointless). We do not need to \"guess\" Γ . This function can be obtained by applying the above typing judgements while considering Γ as an unknown collecting all the hypotheses on it (e.g. Γ (x) > Γ(a) from the second rule) in a set of constraints. Any partial function satisfying these constraints can be used as Γ to derive Γ n : . Computing such solutions can be done pretty efficiently and the choice of the algorithm to be used is left to the implementer, anyway, RDFDF allows to provide explicit typing annotations as separate meta-data with the level property, as in the following snippet. a, rdf:type, b, x x, rdfdf:level, 1","refs":[]},{"text":"The level property is defined as an owl:AnnotationProperty and therefore is ignored by OWL reasoners and is intended solely for type inference purposes. An explicitly typed document can be verified efficiently.","refs":[]}]},{"title":"Conclusions and Future Works","paragraphs":[{"text":"In this paper we briefly introduced the concept of well stratification over linked data and highlighted how achieving well stratification over data is a fundamental requirement to realise data citation over RDF data. With respect to the problem of data citation, the expressive power of OWL and RDF is largely overabundant and might be harmful since a misuse of their primitives might break the stratification of information and metainformation, thus making resolving citations an undecidable problem. In our opinion, a more restricted language, designed specifically to grant the stratification of data, like RDFDF, should be taken into consideration to effectively enable problems such as data citation and provenance assessment to be resolved in practical time, allowing the creation of an effective data trust layer. Attaching RDFDF data or some other kind of well stratified metainformation to data published on the Web might be, in our opinion, Linked Open Data's sixth star, like publishing versioned code is a fundamental quality requirement for Open Source software. The similarity between data metainformation handling and source code versioning is striking since they address similar problems: tracking who and how edited something, identifying subsets of the managed items, and allowing external application or documents to refer to a specific revision. In our opinion this separation is also consistent with the present development of the Semantic Web stack: OWL itself, thought being a logical extension of RDFS, is not built on the top of RDFS but is rather a distinct language sharing concepts and primitives with RDFS. In a similar way a new language for data metainformation management could be built compatibly with RDF and the Linked Data philosophy without being RDF.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"In this paper we analyse the functional requirements of linked data citation and identify a minimal set of operations and primitives needed to realise such task. Citing linked data implies solving a series of data provenance issues and finding a way to identify data subsets. Those two tasks can be handled defining a simple type system inside data and verifying it with a type checker, which is significantly less complex than interpreting reified RDF statements and can be implemented in a non data invasive way. Finally we suggest that data citation should be handled outside of the data, and propose a simple language to describe RDF documents where separation between data and metainformation is explicitly specified.","refs":[]}]}}