{"bibliography":{"title":"An IT Support for an Exhibition of Illuminated Manuscripts","authors":[{"person_name":{"surname":"Ponchia","first_name":"Chiara"},"affiliations":[{"department":"Department of Cultural Heritage","institution":"University of Padua","laboratory":null}],"email":"chiara.ponchia@unipd.it"}],"date":null,"ids":{"DOI":"10.1007/978-3-319-56300-8_2","arXiv":null},"target":null,"publisher":null,"journal":null,"series":null,"scope":null},"keywords":["Ipsa digital archive","Illuminated manuscripts","User engagement"],"citations":{"b0":{"title":"IPSA: a digital archive of herbals to support scientific research","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2003","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-540-24594-0_24","arXiv":null},"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":2911,"pages":{"from_page":253,"to_page":264}}},"b1":{"title":"Engaging the user: elaboration and execution of trials with a database of illuminated images","authors":[{"person_name":{"surname":"Ponchia","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2013","month":null,"day":null},"ids":{"DOI":"10.1007/978-3-642-35834-0_21","arXiv":null},"target":null,"publisher":"Springer","journal":null,"series":null,"scope":{"volume":354,"pages":{"from_page":207,"to_page":215}}},"b2":{"title":"Issues to be addressed for transforming a digital library application for experts into one for final users","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Benfante","first_name":"L"},"affiliations":[],"email":null},{"person_name":{"surname":"Manfioletti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null},{"person_name":{"surname":"Ponchia","first_name":"C"},"affiliations":[],"email":null}],"date":{"year":"2012","month":null,"day":null},"ids":null,"target":null,"publisher":null,"journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":89,"to_page":94}}},"b3":{"title":"Annotating illuminated manuscripts: an effective tool for research and education","authors":[{"person_name":{"surname":"Agosti","first_name":"M"},"affiliations":[],"email":null},{"person_name":{"surname":"Ferro","first_name":"F"},"affiliations":[],"email":null},{"person_name":{"surname":"Orio","first_name":"N"},"affiliations":[],"email":null}],"date":{"year":"2005","month":null,"day":null},"ids":null,"target":null,"publisher":"ACM Press","journal":null,"series":null,"scope":{"volume":null,"pages":{"from_page":121,"to_page":130}}},"b4":{"title":"Splendore nella regola. Codici miniati da monasteri e conventi nella Biblioteca Universitaria di Padova","authors":[],"date":{"year":"2011","month":null,"day":null},"ids":null,"target":null,"publisher":"Biblioteca Universitaria di","journal":null,"series":null,"scope":null}},"sections":[{"title":"Introduction","paragraphs":[{"text":"IPSA (Imaginum Patavinae Scientiae Archivum) is a digital archive of illuminated codices which includes both astrological and botanical manuscripts produced mainly, but not exclusively, in the Veneto region and Northern Italy during the XIV and XV centuries 1 . It was initially designed for a specialist public of scholars and researchers [1] with specific interest in manuscripts and illuminations.","refs":[{"start":258,"end":259,"marker":null,"target":"#foot_0"},{"start":340,"end":343,"marker":"bibr","target":"#b0"}]},{"text":"Due to involvement in the CULTURA project 2 , it was decided to open IPSA to other categories of users, such as non-domain professional researchers, students and the general public. To accomplish this difficult task, it was essential to draw a precise profile of the different types of user and to study new ways of requirements elicitation: therefore different kinds of interactions with the final users were designed, such as trials with groups of undergraduate students and master students and interviews with domain and non-domain professional researchers [2,3]. At the same time IPSA had been progressively changed according to the collected user requirements, and as a result it became more intuitive and user-friendly and it can now be used for other purposes than those for which it was designed.","refs":[{"start":42,"end":43,"marker":null,"target":"#foot_1"},{"start":560,"end":563,"marker":"bibr","target":"#b1"},{"start":563,"end":565,"marker":"bibr","target":"#b2"}]},{"text":"Currently, the research team of the University of Padua which contributed to CULTURA is planning to furtherly extend IPSA possibilities as a tool for scientific knowledge dissemination and to use it in a forthcoming exhibition of illuminated manuscripts to be held in Padua in the spring of 2017.","refs":[]}]},{"title":"Changing IPSA for Non-professional Users","paragraphs":[{"text":"IPSA was created purposely for professional researchers of History of Art and History of Illumination to allow them to study and compare the illuminated images held in the archive: it was therefore originally conceived as a high-specialist tool.","refs":[]},{"text":"It should be underlined that IPSA is not only a digital archive, but also a web-application that enables users to work with images in different ways. In History of Art disclosing new relationships between images brings about further knowledge on a specific artistic period, on a painter or an illuminator, and so on: as a consequence, according to this specific user requirement in IPSA professional researchers are provided with tools that allow to link images and to annotate them [4]. Such a specialist tool turned out to be difficult to use by non-professional users, such as students and members of the general public, and overall the frequent interactions with these user categories highlighted the necessity of working on simplification. In fact these types of users generally do not have particular interest in illuminations or manuscripts but they can find fascinating to browse a beautiful collection if the experience is made easier.","refs":[{"start":483,"end":486,"marker":"bibr","target":"#b3"}]},{"text":"Thus changes and improvements to the system aimed at smoothing users' interaction with IPSA. For example, in the original IPSA professional researchers, accustomed to the complexity of illuminated manuscripts which sometimes can hold hundreds of illuminations, when consulting a manuscript catalogue file were shown a wall with the thumbnails of all the illuminations. This was perceived as confusing by non-professional users, so the list of images of a manuscript evolved from a simple wall of all images, very heavy to render and to explore, to a partial wall of twenty images, much faster to render. Browsing the images was made ever easier by a drop-down menu from where users can select the folio of the illumination they want to see (Fig. 1). ","refs":[{"start":746,"end":747,"marker":"figure","target":"#fig_0"}]}]},{"title":"Preparing an Exhibition","paragraphs":[{"text":"In the context of the project Word and Image in the Padua University Library manuscripts, funded by the University of Padua through a post-doctoral research grant, an exhibition of illuminated manuscripts is currently being organized for the spring of 2017.","refs":[]},{"text":"The project aims at continuing and completing the research work started with the exhibition Splendore nella regola. Codici miniati da monasteri e conventi nella Biblioteca Universitaria di Padova (2011), which presented the results of a study on twentyfour manuscripts held in the Padua University Library [5]. Considering the positive outcomes of this experience, the research is now being extended to those manuscripts that weren't included in the previous exhibition, with the objective to achieve a complete catalogue of the illuminated manuscripts of the Library and to present them to the citizenry.","refs":[{"start":306,"end":309,"marker":"bibr","target":"#b4"}]},{"text":"The research will focus on a corpus of approximately thirty manuscripts, from the XIII to the XVI century, not sumptuous but with a wide range of different decorations and illuminations which testify their various provenances. The corpus includes liturgical and religious books -e.g. the Sermones by Saint Leo Magnus or the Summa de casibus conscentiae by Bartholomaues de San Concordio -but also books for studying, such as the Codex repetitae praelectionis by Justinan or the Expositio super libros Aristotelis de generatione et corruptione by Paolo Veneto. Illuminations can be very different as well: beautiful French gothic illuminations, XIV century Bolognese illuminations, Renaissance decorated pages with the typical ornamental pattern of the bianchi girari, etc. These manuscripts testify to the great flow of books in Padua in the Middle Ages and in the Renaissance connected to the presence of national and international students attending the University and the schools in the local convents.","refs":[]}]},{"title":"Continuing the Research","paragraphs":[{"text":"The exhibition will be a valuable chance to further evaluate IPSA as a tool for scientific knowledge dissemination and to collect useful data for new investigations.","refs":[]},{"text":"In fact, one of the main limits of illuminated manuscripts exhibition is the impossibility to show all the illuminations of the manuscripts: usually manuscripts are opened on their most beautiful illuminated pages, but the others, although equally interesting, remain hidden. Facing this problem not only requires difficult decisions to select the best opening page of each manuscript, but it also gives the visitors the wrong perception that manuscripts are like small paintings, while they are completely different objects, a treasure that it is possible to appreciate only leafing through the pages and discovering their many illuminations, decorated initials and other kinds of embellishments.","refs":[]},{"text":"To this respect, IPSA will be a precious tool to complete visitors' experience: all the manuscripts in the exhibition will be digitized and a new instance of IPSA will be created to collect all the digitized images and their metadata (description of the manuscript, description of its illuminations, date, provenance, calligrapher, illuminator, etc.). Thus visitors, via a computer terminal located in the exhibition, will be able to see all the illuminations hidden in the manuscripts they just saw and to easily get information on them. Visitors' interaction with IPSA will be possibly made more involving through the development of engaging systems for presenting the content, such as narrative and serious games. Afterwards, visitors will be asked to fill in a satisfaction questionnaire, in order to obtain new data for further improvements to IPSA.","refs":[]}]}],"tables":{},"abstract":{"title":"Abstract","paragraphs":[{"text":"The paper reports on a project which envisages the employ of IPSA, an originally high-specialized digital archive and web environment purposely developed for professional researchers in History of Art and History of Illumination, to enrich and complete visitors experience in a forthcoming exhibition of illuminated manuscripts.","refs":[]}]}}